Repository: neovim/neovim
Catalog: src/nvim/po/*.cp1250.po
Languages: sk

source: Greetings, Vim user!
sk: Pozdravujem, u��vate� Vimu!

source: No swap file
sk: �iadny odkladac� s�bor

source: E747: Cannot change directory, buffer is modified (add ! to override)
sk: E747: Nemo�no zmeni� adres�r, buffer je modifikovan� (pou�ite ! pre vyn�tenie)

source: E186: No previous directory
sk: E186: �iadny predch�dzaj�ci adres�r

source: E187: Unknown
sk: E187: Nezn�my

source: E465: :winsize requires two number arguments
sk: E465: :winsize (ve�kos� okna) vy�aduje dva argumenty

source: E188: Obtaining window position not implemented for this platform
sk: E188: Na tejto platforme sa ned� zisti� umiestnenie okna

source: E466: :winpos requires two number arguments
sk: E466: :winpos (poz�cia okna) vy�aduje dva argumenty

source: E739: Cannot create directory: %s
sk: E739: Nemo�no vytvori� adres�r: %s

source: E189: "%s" exists (add ! to override)
sk: E189: "%s" existuje (pou�ite ! pre vyn�tenie)

source: E190: Cannot open "%s" for writing
sk: E190: "%s" sa ned� otvori� pre z�pis

source: E191: Argument must be a letter or forward/backward quote
sk: E191: Argumentem m��e by� iba p�smeno alebo prav� �i �av� apostrof

source: E192: Recursive use of :normal too deep
sk: E192: Rekurz�vne pou�itie pr�kazu :normal pr�li� hlbok�

source: E194: No alternate file name to substitute for '#'
sk: E194: �iadny alternat�vny n�zov s�boru, ktor�m by bolo mo�n� nahradi� '#'

source: E495: no autocommand file name to substitute for "<afile>"
sk: E495: �iadny n�zov s�boru, ktor�m by bolo mo�n� nahradi� "<afile>"

source: E496: no autocommand buffer number to substitute for "<abuf>"
sk: E496: �iadne ��slo bufferu, ktor�m by bolo mo�n� nahradi� "<abuf>"

source: E497: no autocommand match name to substitute for "<amatch>"
sk: E497: �iadna zhoda automatick�ch pr�kazov, ktorou by bolo mo�n� nahradi� "<amatch>"

source: E498: no :source file name to substitute for "<sfile>"
sk: E498: �iadny :source s�bor, ktor�m by bolo mo�n� nahradi� "<sfile>"

source: E500: Evaluates to an empty string
sk: E500: V�sledkom vyhodnotenia je pr�zdny re�azec

source: E195: Cannot open viminfo file for reading
sk: E195: S�bor viminfo sa ned� sa otvori� na ��tanie

source: E608: Cannot :throw exceptions with 'Vim' prefix
sk: E608: Nemo�no spracova� v�nimku :throw s preponou 'Vim'

source: Exception thrown: %s
sk: Spracovanie v�nimky: %s

source: Exception finished: %s
sk: V�nimka ukon�en�: %s

source: Exception discarded: %s
sk: V�nimka zahoden�: %s

source: %s, line %<PRId64>
sk: %s, riadok %<PRId64>

source: Exception caught: %s
sk: Zachyten� v�nimka: %s

source: %s made pending
sk: %s prebieha

source: %s resumed
sk: %s vr�ten�

source: %s discarded
sk: %s zahoden�

source: Exception
sk: V�nimka

source: Error and interrupt
sk: Chyba a preru�en�

source: Error
sk: Chyba

source: Interrupt
sk: Preru�en�

source: E579: :if nesting too deep
sk: E579: vnorenie :if je pr�li� hlbok�

source: E580: :endif without :if
sk: E580: :endif bez zodpovedaj�ceho :if

source: E581: :else without :if
sk: E581: :else bez zodpovedaj�ceho :if

source: E582: :elseif without :if
sk: E582: :elseif bez zodpovedaj�ceho :if

source: E583: multiple :else
sk: E583: viacn�sobn� :else

source: E584: :elseif after :else
sk: E584: :elseif nasleduje po :else

source: E585: :while/:for nesting too deep
sk: E585: vnorenie :while/:for je pr�li� hlbok�

source: E586: :continue without :while or :for
sk: E586: :continue bez zodpovedaj�ceho :while alebo :for

source: E587: :break without :while or :for
sk: E587: :break bez zodpovedaj�ceho :while alebo :for

source: E732: Using :endfor with :while
sk: E732: Pou�it� :endfor spolu s :while

source: E733: Using :endwhile with :for
sk: E733: Pou�it� :endwhile spolu s :for

source: E601: :try nesting too deep
sk: E601: vnorenie :try je pr�li� hlbok�

source: E603: :catch without :try
sk: E603: :catch bez :try

source: E604: :catch after :finally
sk: E604: :catch nasleduje po :finally

source: E606: :finally without :try
sk: E606: :finally bez :try

source: E607: multiple :finally
sk: E607: viacn�sobn� pou�it� :finally

source: E602: :endtry without :try
sk: E602: :endtry bez :try

source: E193: :endfunction not inside a function
sk: E193: :endfunction mimo funkciu

source: tagname
sk: meno tagu

source: kind file
sk: typ s�boru

source: 'history' option is zero
sk: 'vo�ba 'history' je nastaven� na nulu

source: # %s History (newest to oldest):
sk: # Hist�ria %s (za��naj�ci najnov�ou polo�kou):

source: Command Line
sk: Pr�kazov� riadok

source: Search String
sk: Vyh�ad�van� re�azec

source: Expression
sk: V�raz

source: Input Line
sk: Vstupn� riadok

source: E198: cmd_pchar beyond the command length
sk: E198: cmd_pchar prevy�uje d��ku pr�kazu

source: E199: Active window or buffer deleted
sk: E199: Akt�vne okno alebo buffer bol vymazan�

source: E343: Invalid path: '**[number]' must be at the end of the path or be followed by '%s'.
sk: E343: Chybn� cesta: '**[��slo] mus� by� bu� na konci cesty, alebo mus� by� nasledovan� '%s. Vi� :help path.

source: E344: Can't find directory "%s" in cdpath
sk: E344: Adres�r "%s" sa ned� n�js� v cdpath

source: E345: Can't find file "%s" in path
sk: E345: S�bor "%s" sa nepodarilo n�js�

source: E346: No more directory "%s" found in cdpath
sk: E346: �iadny �al�� adres�r "%s" nebol v cdpath n�jden�

source: E347: No more file "%s" found in path
sk: E347: �iadny �al�� s�bor "%s" nebol v ceste n�jden�

source: Illegal file name
sk: Nepr�pustn� n�zov s�boru

source: is a directory
sk: je adres�rom

source: is not a file
sk: nie je s�borom

source: [New File]
sk: [nov� s�bor]

source: [Permission Denied]
sk: [pr�stup odmietnut�]

source: E200: *ReadPre autocommands made the file unreadable
sk: E200: automatick� pr�kazy *ReadPre urobili s�bor ne�itate�n�m

source: E201: *ReadPre autocommands must not change current buffer
sk: E201: automatick� pr�kazy *ReadPre nesm� meni� aktu�lny buffer

source: Vim: Reading from stdin...
sk: Vim: ��tam zo �tandardn�ho vstupu...

source: E202: Conversion made file unreadable!
sk: E202: Po konverzii je s�bor ne�itate�n�!

source: [fifo/socket]
sk: [pomenovan� r�ra/soket]

source: [fifo]
sk: [pomenovan� r�ra]

source: [socket]
sk: [soket]

source: [CR missing]
sk: [ch�ba CR]

source: [long lines split]
sk: [dlh� riadky zalomen�]

source: [NOT converted]
sk: [neskonvertovan�]

source: [converted]
sk: [skonvertovan�]

source: [ILLEGAL BYTE in line %<PRId64>]
sk: [NEPR�PUSTN� BAJT na riadku %<PRId64>]

source: [READ ERRORS]
sk: [CHYBY ��TANIA]

source: Can't find temp file for conversion
sk: Ned� sa n�js� do�asn� s�bor pre konverziu

source: Conversion with 'charconvert' failed
sk: Konverzia s 'charconvert' sa nepodarila

source: can't read output of 'charconvert'
sk: ned� sa ��ta� v�stup 'charconvert'

source: E676: No matching autocommands for acwrite buffer
sk: E676: �iadne vyhovuj�ce automatick� pr�kazy pre acwrite buffer

source: E203: Autocommands deleted or unloaded buffer to be written
sk: E203: Automatick� pr�kazy zmazali �i deaktivovali buffer, ktor� mal by� ulo�en�

source: E204: Autocommand changed number of lines in unexpected way
sk: E204: Automatick� pr�kaz neo�ak�van�m sp�sobom zmenil po�et riadkov

source: is not a file or writable device
sk: nie je s�borom ani zapisovateln�m zariaden�m

source: is read-only (add ! to override)
sk: je iba pre ��tanie (pou�ite ! pre vyn�tenie)

source: E506: Can't write to backup file (add ! to override)
sk: E506: Ned� sa zapisova� do z�lo�n�ho s�boru (pou�ite ! pre vyn�tenie)

source: E507: Close error for backup file (add ! to override)
sk: E507: Chyba pri uzatv�ran� z�lo�n�ho s�boru (pou�ite ! pre vyn�tenie)

source: E508: Can't read file for backup (add ! to override)
sk: E508: Ned� sa na��ta� s�bor pre z�lohu (pou�ite ! pre vyn�tenie)

source: E509: Cannot create backup file (add ! to override)
sk: E509: Ned� sa vytvori� z�lo�n� s�bor (pou�ite ! pre vyn�tenie)

source: E510: Can't make backup file (add ! to override)
sk: E510: Ned� sa vytvori� z�lo�n� s�bor (pou�ite ! pre vyn�tenie)

source: E214: Can't find temp file for writing
sk: E214: Ned� sa n�js� do�asn� s�bor pre ukladanie

source: E213: Cannot convert (add ! to write without conversion)
sk: E213: Ned� sa spravi� konverzia (pou�ite ! pre z�pis bez konverzie)

source: E166: Can't open linked file for writing
sk: E166: S�bor sa ned� otvori� pre ukladanie

source: E212: Can't open file for writing
sk: E212: S�bor sa ned� otvori� pre ukladanie

source: E667: Fsync failed
sk: E667: Fsync zlyhal

source: E512: Close failed
sk: E512: Zatvorenie zlyhalo

source: E513: write error, conversion failed (make 'fenc' empty to override)
sk: E513: chyba pri z�pise, konverzia sa nepodarila (nastavte vo�bu 'fenc' na pr�zdnu pre vyn�tenie)

source: E514: write error (file system full?)
sk: E514: chyba pri ukladan� (pln� disk?)

source: CONVERSION ERROR
sk: CHYBA PREVODU

source: [Device]
sk: [zariadenie]

source: [New]
sk: [nov�]

source: [a]
sk: [p]

source: appended
sk: pripojen�

source: [w]
sk: [u]

source: written
sk: ulo�en�

source: E205: Patchmode: can't save original file
sk: E205: patchmode: ned� sa ulo�i� p�vodn� s�bor

source: E206: patchmode: can't touch empty original file
sk: E206: patchmode: ned� sa zapisova� do pr�zdneho p�vodn�ho s�boru

source: E207: Can't delete backup file
sk: E207: Ned� sa vymaza� z�lo�n� s�bor

source: WARNING: Original file may be lost or damaged
sk: VAROVANIE: Obsah p�vodn�ho s�boru m��e by� straten� alebo po�koden�

source: don't quit the editor until the file is successfully written!
sk: neukon�ujte editor sk�r, ne� bude s�bor �spe�ne ulo�en�!

source: [dos format]
sk: [dos form�t]

source: [mac format]
sk: [mac form�t]

source: [unix format]
sk: [unix form�t]

source: 1 line,
sk: 1 riadok,

source: %<PRId64> lines,
sk: %<PRId64> riadkov,

source: 1 character
sk: 1 znak

source: %<PRId64> characters
sk: %<PRId64> znakov

source: [noeol]
sk: [bez znaku konca riadku]

source: [Incomplete last line]
sk: [ne�pln� posledn� riadok]

source: WARNING: The file has been changed since reading it!!!
sk: VAROVANIE: S�bor bol zmenen� od jeho na��tania!!!

source: Do you really want to write to it
sk: Chcete ho naozaj ulo�i�

source: E208: Error writing to "%s"
sk: E208: Chyba pri z�pise do "%s"

source: E209: Error closing "%s"
sk: E209: Chyba pri uzatv�ran� "%s"

source: E210: Error reading "%s"
sk: E210: Chyba pri ��tan� "%s"

source: E246: FileChangedShell autocommand deleted buffer
sk: E246: automatick� pr�kaz FileChangedShell vymazal buffer

source: E211: File "%s" no longer available
sk: E211: Varovanie: s�bor "%s" u� nie je dostupn�

source: W12: Warning: File "%s" has changed and the buffer was changed in Vim as well
sk: W12: Varovanie: s�bor "%s" bol po za�at� �pravy zmenen� a buffer sa tie� zmenil

source: See ":help W12" for more info.
sk: Pozrite ":help W12" pre viac inform�ci�.

source: W11: Warning: File "%s" has changed since editing started
sk: W11: Varovanie: s�bor "%s" bol po za�at� �pravy zmenen�

source: See ":help W11" for more info.
sk: Pozrite ":help W11" pre viac inform�ci�.

source: W16: Warning: Mode of file "%s" has changed since editing started
sk: W16: Varovanie: Pr�stupov� pr�va k s�boru "%s" boli po za�at� �prav zmenen�

source: See ":help W16" for more info.
sk: Pozrite ":help W16" pre viac inform�ci�.

source: W13: Warning: File "%s" has been created after editing started
sk: W13: Varovanie: S�bor "%s" bol vytvoren� po za�at� �pravy

source: Warning
sk: Varovanie

source: &OK &Load File
sk: &OK &Na��ta� s�bor

source: E462: Could not prepare for reloading "%s"
sk: E462: Nemo�no pripravi� na op�tovn� na��tanie "%s"

source: E321: Could not reload "%s"
sk: E321: ned� sa obnovi� "%s"

source: --Deleted--
sk: --Vymazan�--

source: auto-removing autocommand: %s <buffer=%d>
sk: samomazac� automatick� pr�kaz: %s <buffer=%d>

source: E367: No such group: "%s"
sk: E367: Skupina "%s" neexistuje

source: E215: Illegal character after *: %s
sk: E215: Nepr�pustn� znak po *: %s

source: E216: No such event: %s
sk: E216: Udalos� %s neexistuje

source: E216: No such group or event: %s
sk: E216: Udalos� alebo skupina %s neexistuje

source: --- Auto-Commands ---
sk: --- Automatick� pr�kazy ---

source: E680: <buffer=%d>: invalid buffer number
sk: E680: <buffer=%d>: chybn� ��slo bufferu

source: E217: Can't execute autocommands for ALL events
sk: E217: Automatick� pr�kazy sa nedaj� spusti� pre V�ETKY udalosti

source: No matching autocommands
sk: �iadne vyhovuj�ce automatick� pr�kazy

source: E218: autocommand nesting too deep
sk: E218: vnorenia automatick�ho pr�kazu s� pr�li� hlbok�

source: %s Auto commands for "%s"
sk: %s Automatick� pr�kazy pre "%s"

source: Executing %s
sk: Sp���am %s

source: autocommand %s
sk: automatick� pr�kaz %s

source: E219: Missing {.
sk: E219: Ch�ba {.

source: E220: Missing }.
sk: E220: Ch�ba }.

source: E490: No fold found
sk: E490: Nebol n�jden� �iadne vnorenie

source: E350: Cannot create fold with current 'foldmethod'
sk: E350: Ned� sa vytvori� vnorenie s aktu�lnou met�dou 'foldmethod'

source: E351: Cannot delete fold with current 'foldmethod'
sk: E351: Ned� sa zru�i� vnorenie s aktu�lnou met�dou 'foldmethod'

source: +--%3ld lines folded
sk: +--%3ld riadkov zahnut�ch

source: E222: Add to read buffer
sk: E222: Prida� do bufferu pre ��tanie

source: E223: recursive mapping
sk: E223: rekurz�vne mapovanie

source: E224: global abbreviation already exists for %s
sk: E224: pre %s u� glob�lna skratka existuje

source: E225: global mapping already exists for %s
sk: E225: pre %s u� glob�lne mapovanie existuje

source: E226: abbreviation already exists for %s
sk: E226: pre %s u� skratka existuje

source: E227: mapping already exists for %s
sk: E227: pre %s u� mapovanie existuje

source: No abbreviation found
sk: �iadna skratka nebola n�jden�

source: No mapping found
sk: �iadne mapovanie nebolo n�jden�

source: E228: makemap: Illegal mode
sk: E228: makemap: nepr�pustn� m�d

source: --No lines in buffer--
sk: --Buffer neobsahuje �iadne riadky--

source: E470: Command aborted
sk: E470: Pr�kaz preru�en�

source: E471: Argument required
sk: E471: Je vy�adovan� argument

source: E10: \ should be followed by /, ? or &
sk: E10: po \ by malo nasledova� /, ? alebo &

source: E11: Invalid in command-line window; <CR> executes, CTRL-C quits
sk: E11: Chybn� pr�kaz v okne pr�kazov�ho riadku; <Enter> sp���a, CTRL-C ukon�uje

source: E12: Command not allowed from exrc/vimrc in current dir or tag search
sk: E12: Pr�kaz nie je z exrc/vimrc v aktu�lnom adres�ri alebo pri h�adan� tagu povolen�.

source: E171: Missing :endif
sk: E171: Ch�ba :endif

source: E600: Missing :endtry
sk: E600: Ch�ba :endtry

source: E170: Missing :endwhile
sk: E170: Ch�ba :endwhile

source: E170: Missing :endfor
sk: E170: Ch�ba :endfor

source: E588: :endwhile without :while
sk: E588: :endwhile bez zodpovedaj�ceho :while

source: E588: :endfor without :for
sk: E588: :endfor bez zodpovedaj�ceho :for

source: E13: File exists (add ! to override)
sk: E13: S�bor existuje (pou�ite ! pre prep�sanie)

source: E472: Command failed
sk: E472: Pr�kaz zlyhal

source: E473: Internal error
sk: E473: Vn�torn� chyba

source: Interrupted
sk: Preru�en�

source: E14: Invalid address
sk: E14: Chybn� adresa

source: E474: Invalid argument
sk: E474: Chybn� argument

source: E475: Invalid argument: %s
sk: E475: Chybn� argument: %s

source: E15: Invalid expression: %s
sk: E15: Chybn� v�raz: %s

source: E16: Invalid range
sk: E16: Chybn� rozsah

source: E476: Invalid command
sk: E476: Chybn� pr�kaz

source: E17: "%s" is a directory
sk: E17: "%s" je adres�rom

source: E364: Library call failed for "%s()"
sk: E364: Vyvolanie kni�ni�nej funkcia zlyhalo pre "%s()"

source: E19: Mark has invalid line number
sk: E19: Zna�ka m� chybn� ��slo riadku

source: E20: Mark not set
sk: E20: Zna�ka nie je nastaven�

source: E21: Cannot make changes, 'modifiable' is off
sk: E21: Nemo�no robi� zmeny, vo�ba 'modifiable' je vypnut�

source: E22: Scripts nested too deep
sk: E22: Skripty vnoren� pr�li� hlboko

source: E23: No alternate file
sk: E23: �iadny alternat�vny s�bor

source: E24: No such abbreviation
sk: E24: Tak� skratka neexistuje

source: E477: No ! allowed
sk: E477: ! nie je povolen�

source: E25: GUI cannot be used: Not enabled at compile time
sk: E25: Ned� sa pou��� GUI: nebolo zapnut� pri preklade programu

source: E28: No such highlight group name: %s
sk: E28: Skupina zv�raznenia %s neexistuje

source: E29: No inserted text yet
sk: E29: Zatia� nie je vlo�en� �iaden text

source: E30: No previous command line
sk: E30: �iadny predch�dzaj�ci pr�kazov� riadok

source: E31: No such mapping
sk: E31: Mapovanie nen�jden�

source: E479: No match
sk: E479: �iadna zhoda

source: E480: No match: %s
sk: E480: �iadna zhoda: %s

source: E32: No file name
sk: E32: �iadny n�zov s�boru

source: E33: No previous substitute regular expression
sk: E33: �iadny predch�dzaj�ci prisl�chaj�ci spr�vny v�raz

source: E34: No previous command
sk: E34: �iadny predch�dzaj�ci pr�kaz

source: E35: No previous regular expression
sk: E35: �iadny predch�dzaj�ci regul�rny v�raz

source: E481: No range allowed
sk: E481: Rozsah nie je povolen�

source: E36: Not enough room
sk: E36: Nedostatok miesta

source: E482: Can't create file %s
sk: E482: Ned� sa vytvori� s�bor %s

source: E483: Can't get temp file name
sk: E483: Ned� sa z�ska� n�zov do�asn�ho s�boru

source: E484: Can't open file %s
sk: E484: Ned� sa otvori� s�bor %s

source: E485: Can't read file %s
sk: E485: Ned� sa ��ta� s�bor %s

source: E37: No write since last change (add ! to override)
sk: E37: Neulo�en� zmeny (pou�ite ! pre vyn�tenie)

source: E38: Null argument
sk: E38: Nulov� argument

source: E39: Number expected
sk: E39: O�ak�van� ��slo

source: E40: Can't open errorfile %s
sk: E40: Ned� sa otvori� chybov� s�bor %s

source: E41: Out of memory!
sk: E41: Nedostatok pam�ti!

source: Pattern not found
sk: Vzor nen�jden�

source: E486: Pattern not found: %s
sk: E486: Vzor nen�jden�: %s

source: E487: Argument must be positive
sk: E487: Argument mus� by� kladn�

source: E459: Cannot go back to previous directory
sk: E459: �iadny predch�dzaj�ci adres�r

source: E42: No Errors
sk: E42: �iadne chyby

source: E43: Damaged match string
sk: E43: Po�koden� re�azac pre vyh�ad�vanie

source: E44: Corrupted regexp program
sk: E44: Po�koden� regexp program

source: E45: 'readonly' option is set (add ! to override)
sk: E45: vo�ba 'readonly' (iba na ��tanie) je nastaven� (pou�ite ! pre prep�sanie)

source: E46: Cannot change read-only variable "%s"
sk: E46: Ned� sa nastavi� premenn� len na ��tanie "%s"

source: E47: Error while reading errorfile
sk: E47: Chyba pri ��tan� chybov�ho s�boru

source: E48: Not allowed in sandbox
sk: E48: Nie je dovolen� v bezpe�nostnej schr�nke

source: E523: Not allowed here
sk: E523: Nie je na povolen� na tomto mieste

source: E359: Screen mode setting not supported
sk: E359: Nastavovanie re�imu obrazovky nie je podporovan�

source: E49: Invalid scroll size
sk: E49: Chybn� hodnota ve�kosti rolovania

source: E91: 'shell' option is empty
sk: E91: vo�ba 'shell' je pr�zdna

source: E255: Couldn't read in sign data!
sk: E255: Chyba -- ned�j� sa pre��ta� ozna�ovacie d�ta!

source: E72: Close error on swap file
sk: E72: Chyba pri uzatv�ran� odkladacieho s�boru

source: E73: tag stack empty
sk: E73: zoznam tagov je pr�zdny

source: E74: Command too complex
sk: E74: Pr�kaz je pr�li� zlo�it�

source: E75: Name too long
sk: E75: N�zov je pr�li� dlh�

source: E76: Too many [
sk: E76: Pr�li� mnoho [

source: E77: Too many file names
sk: E77: Pr�li� mnoho n�zvov s�borov

source: E488: Trailing characters
sk: E488: Nadbyto�n� znaky na konci

source: E78: Unknown mark
sk: E78: Nezn�ma zna�ka

source: E79: Cannot expand wildcards
sk: E79: Nemo�no expandova� �ol�kov� znaky (wildcards)

source: E591: 'winheight' cannot be smaller than 'winminheight'
sk: E591: hodnota vo�by 'winheight' (v��ka okna) nesmie by� men�ia ne� hodnota vo�by 'winminheight' (minim�lna v��ka okna)

source: E592: 'winwidth' cannot be smaller than 'winminwidth'
sk: E592: hodnota vo�by 'winwidth' (��rka okna) nesmie by� men�ia ne� hodnota vol�y 'winminwidth' (minim�lna ��rka okna)

source: E80: Error while writing
sk: E80: Chyba pri ukladan�

source: Zero count
sk: Nulov� po�et

source: E81: Using <SID> not in a script context
sk: E81: Pou�itie <SID> mimo kontext skriptu

source: E685: Internal error: %s
sk: E685: Vn�torn� chyba: %s

source: E363: pattern uses more memory than 'maxmempattern'
sk: E363: vzor pou��va viac pam�te ako 'maxmempattern'

source: E749: empty buffer
sk: E749: pr�zdny buffer

source: E682: Invalid search pattern or delimiter
sk: E682: Nepr�pustn� h�adan� re�azec alebo odde�ova�

source: E139: File is loaded in another buffer
sk: E139: S�bor je na��tan� v inom buffere

source: E764: Option '%s' is not set
sk: E764: Vo�ba "%s" nie je nastaven�

source: search hit TOP, continuing at BOTTOM
sk: h�adanie dosiahlo za�iatok, pokra�ovanie od konca

source: search hit BOTTOM, continuing at TOP
sk: h�adanie dosiahlo koniec, pokra�ovanie od za�iatku

source: E550: Missing colon
sk: E550: Ch�ba dvojbodka

source: E551: Illegal component
sk: E551: Nepr�pustn� komponent

source: E552: digit expected
sk: E552: o�ak�van� ��slica

source: Page %d
sk: Strana %d

source: No text to be printed
sk: �iadny text na tla�

source: Printing page %d (%d%%)
sk: Tla��m stranu %d (%d%%)

source: Copy %d of %d
sk: K�pia %d z %d

source: Printed: %s
sk: Vytla�en�: %s

source: Printing aborted
sk: Tla� bola zru�en�

source: E455: Error writing to PostScript output file
sk: E455: Ned� sa zapisova� do v�stupn�ho PostScriptov�ho s�boru

source: E624: Can't open file "%s"
sk: E624: Ned� sa otvori� s�bor "%s"

source: E457: Can't read PostScript resource file "%s"
sk: E457: Ned� sa ��ta� PostScriptov� s�bor "%s"

source: E618: file "%s" is not a PostScript resource file
sk: E618: s�bor "%s" nie je vo form�te PostScript

source: E619: file "%s" is not a supported PostScript resource file
sk: E619: s�bor "%s" nie je podporvan� PostScriptov� s�bor

source: E621: "%s" resource file has wrong version
sk: E621: "%s" zdrojov� s�bor m� zl� ��slo verzie

source: E673: Incompatible multi-byte encoding and character set.
sk: E673: nekompatibiln� viacbajtov� k�dovanie a znakov� sada.

source: E674: printmbcharset cannot be empty with multi-byte encoding.
sk: E674: vo�ba printmbcharset nem��e by� pr�zdna pri viacbajtovom k�dovan�.

source: E675: No default font specified for multi-byte printing.
sk: E675: Nie je �pecifikovan� �iadne p�smo pre viacbajtov� tla�enie.

source: E324: Can't open PostScript output file
sk: E324: Ned� sa otvori� v�stupn� PostScriptov� s�bor

source: E456: Can't open file "%s"
sk: E456: Ned� sa otvori� s�bor "%s"

source: E456: Can't find PostScript resource file "prolog.ps"
sk: E456: Nemo�no n�js� PostScriptov� zdrojov� s�bor "prolog.ps"

source: E456: Can't find PostScript resource file "cidfont.ps"
sk: E456: Nemo�no n�js� PostScriptov� zdrojov� s�bor "cidfont.ps"

source: E456: Can't find PostScript resource file "%s.ps"
sk: E456: Nemo�no n�js� PostScriptov� zdrojov� s�bor "%s.ps"

source: E620: Unable to convert to print encoding "%s"
sk: E620: Nemo�no skonvertova� do k�dovania na tla�enie "%s"

source: Sending to printer...
sk: Posielam na tla�iare�...

source: E365: Failed to print PostScript file
sk: E365: PostScriptov� s�bor sa nepodarilo vytla�i�

source: Print job sent.
sk: Tla�ov� �loha bola odoslan�.

source: Add a new database
sk: Prida� nov� datab�zu

source: Query for a pattern
sk: H�adanie vzoru

source: Show this message
sk: Zobrazi� t�to spr�vu

source: Kill a connection
sk: Ukon�i� spojenie

source: Reinit all connections
sk: Znovu inicializova� v�etky spojenia

source: Show connections
sk: Zobrazi� spojenia

source: E560: Usage: cs[cope] %s
sk: E560: Pou�itie: cs[cope] %s
