Repository: neovim/neovim
Catalog: src/nvim/po/*.cp1250.po
Languages: sk

source: This cscope command does not support splitting the window.
sk: Tento cscope pr�kaz nepodporuje rozde�ovanie okna.

source: E562: Usage: cstag <ident>
sk: E562: Pou�itie: cstag <odsadenie>

source: E257: cstag: tag not found
sk: E257: cstag: tag nen�jden�

source: E563: stat(%s) error: %d
sk: E563: stat(%s) chyba: %d

source: E564: %s is not a directory or a valid cscope database
sk: E564: %s nie je ani adres�rom ani spr�vnou cscope datab�zou

source: Added cscope database %s
sk: Pridan� cscope datab�za %s

source: E262: error reading cscope connection %<PRId64>
sk: E262: chyba pri ��tan� cscope spojenia %<PRId64>

source: E561: unknown cscope search type
sk: E561: nezn�my typ cscope h�adania

source: E566: Could not create cscope pipes
sk: E566: Nedaj� sa vytvori� cscope r�ry

source: E622: Could not fork for cscope
sk: E622: Nemo�no spusti� proces pre cscope

source: cs_create_connection exec failed
sk: spustenie cs_create_connection zlyhalo

source: cs_create_connection: fdopen for to_fp failed
sk: cs_create_connection: volanie fdopen pre to_fp zlyhalo

source: cs_create_connection: fdopen for fr_fp failed
sk: cs_create_connection: volanie fdopen pre fr_fp zlyhalo

source: E623: Could not spawn cscope process
sk: E623: Nedaj� sa vytvori� cscope r�ry

source: E567: no cscope connections
sk: E567: �iadne cscope spojenia

source: E469: invalid cscopequickfix flag %c for %c
sk: E469: chybn� cscopequickfix pr�znak %c pre %c

source: E259: no matches found for cscope query %s of %s
sk: E259: cscope h�adanie %s vo vzore %s nena�lo �iadnu zhodu

source: cscope commands:
sk: pr�kazy cscope:

source: E568: duplicate cscope database not added
sk: E568: duplicitn� cscope datab�za nebola pridan�

source: E261: cscope connection %s not found
sk: E261: cscope spojenie %s nen�jden�

source: cscope connection %s closed
sk: cscope spojenie %s ukon�en�

source: E570: fatal error in cs_manage_matches
sk: E570: v��na chyba v cs_manage_matches

source: # line
sk: # riadok

source: filename / context / line
sk: n�zov s�boru/ kontext / riadok

source: E609: Cscope error: %s
sk: E609: Chyba cscope: %s

source: All cscope databases reset
sk: V�etky cscope datab�ze resetovan�

source: no cscope connections
sk: �iadne cscope spojenia

source: # pid database name prepend path
sk: # pid n�zov datab�zy predpona cesty

source: Unknown option argument
sk: Nezn�my parameter vo�by

source: Too many edit arguments
sk: Pr�li� mnoho upravovac�ch argumentov

source: Argument missing after
sk: Ch�ba argument po

source: Garbage after option argument
sk: Chyby za parametrom vo�by

source: Too many "+command", "-c command" or "--cmd command" arguments
sk: Pr�li� mnoho "+pr�kaz", "-c pr�kaz" alebo "--cmd pr�kaz" argumentov

source: Invalid argument for
sk: Chybn� argument pre

source: %d files to edit
sk: %d s�borov pre �pravu

source: Attempt to open script file again: "
sk: Pokus o op�tovn� otvorenie skriptu: "

source: Cannot open for reading: "
sk: Ned� sa otvori� pre z�pis: "

source: Cannot open for script output: "
sk: Ned� sa otvori� pre v�stup skriptu: "

source: Vim: Warning: Output is not to a terminal
sk: Vim: Varovanie: V�stup nesmeruje na termin�l

source: Vim: Warning: Input is not from a terminal
sk: Vim: Varovanie: Vstup nepoch�dza z termin�lu

source: pre-vimrc command line
sk: pre-vimrc pr�kazov� riadok

source: E282: Cannot read from "%s"
sk: E282: Ned� sa ��ta� z "%s"

source: More info with: "vim -h"
sk: Podrobnej�ie inform�cie z�sk�te pomocou "vim -h"

source: [file ..] edit specified file(s)
sk: [s�bor ..] .. upravi� s�bor(y)

source: - read text from stdin
sk: - ��ta� text z �tandardn�ho vstupu

source: -t tag edit file where tag is defined
sk: -t tag upravi� s�bor na mieste defin�cie tagu

source: -q [errorfile] edit file with first error
sk: -q [chybov� s�bor] upravi� s�bor na mieste v�skytu prvej chyby

source: usage:
sk: pou�itie:

source: vim [arguments]
sk: vim [argumenty]

source: or:
sk: alebo:

source: Arguments:
sk: Argumenty:

source: -- Only file names after this
sk: -- M��u nasledova� iba n�zvy s�borov

source: --literal Don't expand wildcards
sk: --literal Nexpandova� �ol�kov� znaky (wildcards)

source: -v Vi mode (like "vi")
sk: -v Vi m�d (rovnak� ako "vi")

source: -e Ex mode (like "ex")
sk: -e Ex m�d (rovnak� ako "ex")

source: -s Silent (batch) mode (only for "ex")
sk: -s Tich� (d�vkov�) m�d (iba pre "ex")

source: -d Diff mode (like "vimdiff")
sk: -d Porovn�vac� m�d (rovnak� ako "vimdiff")

source: -y Easy mode (like "evim", modeless)
sk: -y Jednoduch� m�d (rovnak� ako "evim", bezm�dov�)

source: -R Readonly mode (like "view")
sk: -R M�d iba pre ��tanie (ako "view")

source: -Z Restricted mode (like "rvim")
sk: -Z Obmedzen� m�d (rovnak� ako "rvim")

source: -m Modifications (writing files) not allowed
sk: -m Zmeny (ukladanie s�borov) zak�zan�

source: -M Modifications in text not allowed
sk: -M Zmeny v texte zak�zan�

source: -b Binary mode
sk: -b Bin�rny m�d

source: -l Lisp mode
sk: -l Lisp m�d

source: -C Compatible with Vi: 'compatible'
sk: -C Kompatabiln� s Vi: 'compatible'

source: -N Not fully Vi compatible: 'nocompatible'
sk: -N Kompatibilita s Vi vypnut�: 'nocompatible'

source: -D Debugging mode
sk: -D Ladiaci m�d

source: -n No swap file, use memory only
sk: -n Nevytv�ra� odkladac� s�bor, pou��va� iba pam��

source: -r List swap files and exit
sk: -r Vyp�� zoznam odkladac�ch s�borov a skon�i

source: -r (with file name) Recover crashed session
sk: -r (s n�zvom s�boru) Obnov� preru�en� sedenie

source: -L Same as -r
sk: -L Rovnak� ako -r

source: -A start in Arabic mode
sk: -A spusti v Arabic m�de

source: -H Start in Hebrew mode
sk: -H spusti v hebrejskom m�de

source: -F Start in Farsi mode
sk: -F spusti vo Farsi m�de

source: -T <terminal> Set terminal type to <terminal>
sk: -T <termin�l> Nastav� typ termin�lu na <termin�l>

source: -u <vimrc> Use <vimrc> instead of any .vimrc
sk: -u <vimrc> Pou�ije <vimrc> namiesto ak�hoko�vek .vimrc

source: --noplugin Don't load plugin scripts
sk: --noplugin Nenahr� z�suvn� moduly(plugin skripty)

source: -o[N] Open N windows (default: one for each file)
sk: -o[N] Otvor� N okien (implicitne jedno pre ka�d� s�bor)

source: -O[N] Like -o but split vertically
sk: -O[N] Ako -o ale rozdel� vertik�lne

source: + Start at end of file
sk: + Nastav� kurzor na koniec s�boru

source: +<lnum> Start at line <lnum>
sk: +<riadok> Nastav� kurzor na <riadok>

source: --cmd <command> Execute <command> before loading any vimrc file
sk: --cmd <pr�kaz> Vykon� <pr�kaz> pred nahrat�m vimrc s�boru

source: -c <command> Execute <command> after loading the first file
sk: -c <pr�kaz> Po nahrat� prv�ho s�boru vykon� <pr�kaz>

source: -S <session> Source file <session> after loading the first file
sk: -S <sedenie> Po nahrat� prv�ho s�boru vykon� pr�kazy v s�bore <sedenie>

source: -s <scriptin> Read Normal mode commands from file <scriptin>
sk: -s <skript> Na��ta pr�kazy norm�lneho m�du zo <skriptu>

source: -w <scriptout> Append all typed commands to file <scriptout>
sk: -w <skript> Pripoj� v�etky nap�san� pr�kazy do s�boru <skript>

source: -W <scriptout> Write all typed commands to file <scriptout>
sk: -W <skript> Ulo�� v�etky nap�san� pr�kazy do s�boru <skript>

source: -i <viminfo> Use <viminfo> instead of .viminfo
sk: -i <viminfo> Pou�ije <viminfo> namiesto ak�hoko�vek .viminfo

source: -h or --help Print Help (this message) and exit
sk: -h alebo --help Vyp��e t�to n�povedu a skon��

source: --version Print version information and exit
sk: --version Vyp��e inform�cie o verzii a skon��

source: No marks set
sk: Nie s� nastaven� �iadne zna�ky

source: E283: No marks matching "%s"
sk: E283:"%s" nevyhovuj� �iadne zna�ky

source: mark line col file/text
sk: zna�ka riadok st�pec s�bor/text

source: jump line col file/text
sk: skok riadok st�pec s�bor/text

source: change line col text
sk: zna�ka riadok st�pec text

source: # File marks:
sk: # S�borov� zna�ky:

source: # Jumplist (newest first):
sk: # Zoznam skokov (za��naj�ci najnov�ou polo�kou):

source: # History of marks within files (newest to oldest):
sk: # Hist�ria zna�iek v s�boroch (za��naj�ci najnov�ou polo�kou):

source: Missing '>'
sk: Ch�ba '>'

source: E293: block was not locked
sk: E293: blok nebol zamknut�

source: E294: Seek error in swap file read
sk: E294: Chyba posunu pri ��tan� odkladacieho s�boru

source: E295: Read error in swap file
sk: E295: Chyba pri ��tan� odkladacieho s�boru

source: E296: Seek error in swap file write
sk: E296: Chyba posunu pri ukladan� do odkladacieho s�boru

source: E297: Write error in swap file
sk: E297: Chyba pri ukladan� do odkladacieho s�boru

source: E300: Swap file already exists (symlink attack?)
sk: E300: Odkladac� s�bor u� existuje (symlink �tok?)

source: E298: Didn't get block nr 0?
sk: E298: Ned� sa z�ska� blok 0?

source: E298: Didn't get block nr 1?
sk: E298: Ned� sa z�ska� blok 1?

source: E298: Didn't get block nr 2?
sk: E298: Ned� sa z�ska� blok 2?

source: E301: Oops, lost the swap file!!!
sk: E301: Ups, odkladac� s�bor bol straten�!!!

source: E302: Could not rename swap file
sk: E302: Ned� sa premenova� odkladac� s�bor

source: E303: Unable to open swap file for "%s", recovery impossible
sk: E303: Ned� sa otvori� odkladac� s�bor pre "%s", oprava nemo�n�

source: E304: ml_upd_block0(): Didn't get block 0??
sk: E304: ml_upd_block0(): ned� sa z�ska� blok 0??

source: E305: No swap file found for %s
sk: E305: Odkladac� s�bor pre %s nebol n�jden�

source: Enter number of swap file to use (0 to quit):
sk: Zadajte ��slo odkladacieho s�boru, ktor� sa m� pou�it (0 pre ukon�enie):

source: E306: Cannot open %s
sk: E306: Ned� sa otvori� %s

source: Unable to read block 0 from
sk: Ned� sa ��ta� blok 0 z

source: Maybe no changes were made or Vim did not update the swap file.
sk: Mo�no nedo�lo k �iadnym zmen�m, alebo Vim neaktualizoval odkladac� s�bor.

source: cannot be used with this version of Vim.
sk: ned� sa pou�i� s touto verziou Vim.

source: Use Vim version 3.0.
sk: Pou�ite Vim verziu 3.0.

source: E307: %s does not look like a Vim swap file
sk: E307: %s sa nezd� by� odkladac�m s�borom Vim

source: cannot be used on this computer.
sk: ned� sa pou��� na tomto po��ta�i.

source: The file was created on
sk: S�bor bol vytvoren�

source: , or the file has been damaged.
sk: , alebo bol s�bor po�koden�.

source: Using swap file "%s"
sk: Pou��vam odkladac� s�bor "%s"

source: Original file "%s"
sk: P�vodn� s�bor "%s"

source: E308: Warning: Original file may have been changed
sk: E308: Varovanie: P�vodn� s�bor mohol by� zmenen�

source: E309: Unable to read block 1 from %s
sk: E309: Ned� sa ��ta� blok 1 z %s

source: ???MANY LINES MISSING
sk: ???CH�BA MNOHO RIADKOV

source: ???LINE COUNT WRONG
sk: ???CHYBN� PO�ET RIADKOV

source: ???EMPTY BLOCK
sk: ???PR�ZDNY BLOK

source: ???LINES MISSING
sk: ???CH�BAJ�CE RIADKY

source: E310: Block 1 ID wrong (%s not a .swp file?)
sk: E310: ID bloku 1 je chybn� (je %s odkladac�m s�borom?)

source: ???BLOCK MISSING
sk: ???CH�BA BLOK

source: ??? from here until ???END lines may be messed up
sk: od ??? po ???END m��u by� riadky pomie�an�

source: ??? from here until ???END lines may have been inserted/deleted
sk: od ??? po ???END m��u by� riadky vlo�en�/vymazan�

source: ???END
sk: ???KONIEC

source: E311: Recovery Interrupted
sk: E311: Obnova preru�en�

source: E312: Errors detected while recovering; look for lines starting with ???
sk: E312: V priebehu obnovy do�lo k chyb�m; skontrolujte riadky za��naj�ce na ???

source: See ":help E312" for more information.
sk: Pozrite ":help E312" pre �al�ie inform�cie

source: Recovery completed. You should check if everything is OK.
sk: Obnova dokon�en�. Skontrolujte, �i je v�etko v poriadku.

source: (You might want to write out this file under another name
sk: (Zv��te ulo�enie tohoto s�boru pod in�m menom

source: Swap files found:
sk: N�jden� odkladacie s�bory:

source: In current directory:
sk: V aktu�lnom adres�ri:

source: Using specified name:
sk: So zadan�m menom:

source: In directory
sk: V adres�ri

source: -- none --
sk: -- �iadne --

source: owned by:
sk: vlastn�k:

source: dated:
sk: d�tum vytvorenia:

source: dated:
sk: d�tum vytvorenia:

source: [from Vim version 3.0]
sk: [od Vim verzie 3.0]

source: [does not look like a Vim swap file]
sk: [nevyzer� ako odkladac� s�bor Vim]

source: file name:
sk: n�zov s�boru:

source: modified:
sk: zmenen�:

source: YES
sk: �NO

source: no
sk: nie

source: user name:
sk: u��vate�sk� meno:

source: host name:
sk: n�zov po��ta�a:

source: host name:
sk: n�zov po��ta�a:

source: process ID:
sk: ID procesu :

source: (still running)
sk: (st�le be��)

source: [not usable on this computer]
sk: [nepou�iteln� na tomto po��ta�i]

source: [cannot be read]
sk: [ned� sa pre��ta�]

source: [cannot be opened]
sk: [ned� sa otvori�]

source: E313: Cannot preserve, there is no swap file
sk: E313: Ned� sa zachova� - odkladac� s�bor neexistuje

source: File preserved
sk: S�bor zachovan�

source: E314: Preserve failed
sk: E314: Uchovanie sa nepodarilo

source: E315: ml_get: invalid lnum: %<PRId64>
sk: E315: ml_get: chybn� ��slo riadku: %<PRId64>

source: E316: ml_get: cannot find line %<PRId64>
sk: E316: ml_get: ned� sa n�js� riadok %<PRId64>

source: E317: pointer block id wrong 3
sk: E317: chybn� ��slo ukazovate�a na blok 3

source: stack_idx should be 0
sk: stack_idx by mal ma� hodnotu 3

source: E318: Updated too many blocks?
sk: E318: Aktualizovan�ch pr�li� ve�a blokov?

source: E317: pointer block id wrong 4
sk: E317: chybn� ��slo ukazovate�a na blok 4

source: deleted block 1?
sk: vymazan� blok 1?

source: E320: Cannot find line %<PRId64>
sk: E320: Ned� sa n�js� riadok %<PRId64>

source: E317: pointer block id wrong
sk: E317: chybn� ��slo ukazovate�a na blok

source: pe_line_count is zero
sk: pe_line_count m� nulov� hodnotu

source: E322: line number out of range: %<PRId64> past the end
sk: E322: ��slo riadku je mimo rozsah: %<PRId64> (za koncom)

source: E323: line count wrong in block %<PRId64>
sk: E323: chybn� po�et riadkov v bloku %<PRId64>

source: Stack size increases
sk: N�rast ve�kosti z�sobn�ku

source: E317: pointer block id wrong 2
sk: E317: chybn� ��slo ukazovate�a na blok 2

source: E325: ATTENTION
sk: E325: POZOR

source: Found a swap file by the name "
sk: N�jden� odkladac� s�bor s menom "

source: While opening file "
sk: Pri otv�ran� s�boru "

source: NEWER than swap file!
sk: NOV�� ako odkladac� s�bor!

source: If this is the case, use ":recover" or "vim -r
sk: Ak je tomu tak, potom pou�ite ":recover" alebo "vim -r

source: " to recover the changes (see ":help recovery").
sk: " pre obnovenie zmien (vi� ":help recovery)".

source: If you did this already, delete the swap file "
sk: Pokia� ste tak u� urobili, tak vyma�te odkladac� s�bor "

source: " to avoid this message.
sk: " a t�to spr�va sa u� nebude objavova�.

source: Swap file "
sk: Odkladac� s�bor "

source: " already exists!
sk: " u� existuje!

source: VIM - ATTENTION
sk: VIM - POZOR

source: Swap file already exists!
sk: Odkladac� s�bor u� existuje!

source: &Open Read-Only &Edit anyway &Recover &Quit &Abort
sk: &Otvori� iba pre ��tanie &Pokra�ova� v �prav�ch O&bnovi� s�bor &Koniec &Zru�i�

source: E326: Too many swap files found
sk: E326: Pr�li� mnoho odkladac�ch s�borov

source: E342: Out of memory! (allocating %<PRIu64> bytes)
sk: E342: Nedostatok pam�te! (alokujem %<PRIu64> bajtov)

source: E327: Part of menu-item path is not sub-menu
sk: E327: �as� cesty k predmetu ponuky nie je podponukou

source: E328: Menu only exists in another mode
sk: E328: Ponuka existuje iba v inom m�de

source: E329: No menu "%s"
sk: E329: Ponuka "%s" neexistuje

source: E330: Menu path must not lead to a sub-menu
sk: E330: Cesta ponuky nesmie vies� do podponuky

source: E331: Must not add menu items directly to menu bar
sk: E331: Polo�ky ponuky sa nejd� prid�va� priamo na li�tu

source: E332: Separator cannot be part of a menu path
sk: E332: Odde�ova� nesmie by� �as�ou cesty ponuky

source: --- Menus ---
sk: --- Ponuky ---

source: E333: Menu path must lead to a menu item
sk: E333: Cesta ponuky mus� vies� k polo�ke ponuky

source: E334: Menu not found: %s
sk: E334: Ponuka nen�jden�: %s

source: E335: Menu not defined for %s mode
sk: E335: V %s m�de nie je ponuka definovan�

source: E336: Menu path must lead to a sub-menu
sk: E336: Cesta ponuky mus� vies� do podponuky

source: E337: Menu not found - check menu names
sk: E337: Ponuka nen�jden� - skontrolujte n�zvy pon�k

source: Error detected while processing %s:
sk: Chyba pri spracovan� %s:

source: line %4ld:
sk: riadok %4ld:

source: E354: Invalid register name: '%s'
sk: E354: '%s' nie je pr�stupn� meno registru

source: Messages maintainer: Bram Moolenaar <Bram@vim.org>
sk: Spr�vca prekladu: Lubomir Host <rajo@platon.sk>

source: Interrupt:
sk: Preru�enie:

source: Press ENTER or type command to continue
sk: Stla�te ENTER alebo zadajte pr�kaz pre pokra�ovanie

source: -- More --
sk: -- Pokra�ovanie --

source: SPACE/d/j: screen/page/line down, b/u/k: up, q: quit
sk: MEDZERA/d/j: obrazovka/str�nka/riadok dole, b/u/k: hore, q: koniec

source: Question
sk: Ot�zka

source: &Yes &No
sk: &Ano &Nie

source: &Yes &No &Cancel
sk: &Ano &Nie &Zru�i�

source: &Yes &No Save &All &Discard All &Cancel
sk: &Ano &Nie &Ulo�i� v�etko Zahodi� &v�etko &Zru�i�

source: E766: Insufficient arguments for printf()
sk: E766: Chybn� argumenty pre funkciu printf()

source: E767: Too many arguments to printf()
sk: E767: Pr�li� mnoho argumentov pre funkciu printf()

source: W10: Warning: Changing a readonly file
sk: W10: Varovanie: men�m s�bor iba pre ��tanie

source: 1 more line
sk: 1 nov� riadok

source: 1 line less
sk: 1 vymazan� riadok

source: %<PRId64> more lines
sk: %<PRId64> nov�ch riadkov

source: %<PRId64> fewer lines
sk: %<PRId64> vymazan�ch riadkov

source: (Interrupted)
sk: (Preru�en�)

source: Beep!
sk: Piip!

source: Calling shell to execute: "%s"
sk: Vol�m shell na spustenie: "%s"

source: E349: No identifier under cursor
sk: E349: Pod kurzorom nie je �iadny identifik�tor

source: Warning: terminal cannot highlight
sk: Varovanie: termin�l nepodporuje zv�raz�ovanie

source: E348: No string under cursor
sk: E348: Pod kurzorom nie je �iadny re�azec

source: E352: Cannot erase folds with current 'foldmethod'
sk: E352: Pomocou 'foldmethod' sa ned� vymaza� vnorenie

source: E664: changelist is empty
sk: E664: zoznam zmien je pr�zdny

source: E662: At start of changelist
sk: E662: Na za�iatku zoznamu zmien

source: E663: At end of changelist
sk: E663: Na konci zoznamu zmien

source: Type :quit<Enter> to exit Vim
sk: Zadajte :quit<Enter> pre ukon�enie programu Vim

source: 1 line %sed 1 time
sk: po�et riadkov upraven�ch naraz pomocou %s: 1

source: 1 line %sed %d times
sk: 1 riadok upraven� pomocou %s %d kr�t

source: %<PRId64> lines %sed 1 time
sk: %<PRId64> riadkov upraven�ch naraz pomocou %s

source: %<PRId64> lines %sed %d times
sk: %<PRId64> riadkov upraven�ch pomocou %s %d kr�t

source: %<PRId64> lines to indent...
sk: %<PRId64> riadkov pre odsadenie...

source: 1 line indented
sk: 1 riadok odsaden�

source: %<PRId64> lines indented
sk: %<PRId64> riadkov odsaden�ch

source: E748: No previously used register
sk: E748: �iadny predt�m pou��van� register

source: cannot yank; delete anyway
sk: ned� sa kop�rova�; napriek tomu vymazan�

source: 1 line changed
sk: 1 riadok zmenen�

source: %<PRId64> lines changed
sk: %<PRId64> zmenen�ch riadkov

source: block of 1 line yanked
sk: skop�rovan� blok 1 riadku

source: 1 line yanked
sk: 1 riadok skop�rovan�

source: block of %<PRId64> lines yanked
sk: skop�rovan� blok %<PRId64> riadkov

source: %<PRId64> lines yanked
sk: %<PRId64> skop�rovan�ch riadkov

source: E353: Nothing in register %s
sk: E353: Register %s je pr�zdny

source: --- Registers ---
sk: --- Registre ---

source: Illegal register name
sk: Nepr�pustn� n�zov registra

source: # Registers:
sk: # Registre:

source: E574: Unknown register type %d
sk: E574: Nezn�my typ registra %d

source: %<PRId64> Cols;
sk: %<PRId64> St�pcov;

source: Selected %s%<PRId64> of %<PRId64> Lines; %<PRId64> of %<PRId64> Words; %<PRId64> of %<PRId64> Bytes
sk: Vybran�ch %s%<PRId64> z %<PRId64> Riadkov; %<PRId64> zo %<PRId64> Slov; %<PRId64> z %<PRId64> Bajtov

source: Selected %s%<PRId64> of %<PRId64> Lines; %<PRId64> of %<PRId64> Words; %<PRId64> of %<PRId64> Chars; %<PRId64> of %<PRId64> Bytes
sk: Vybran�ch %s%<PRId64> z %<PRId64> Riadkov; %<PRId64> zo %<PRId64> Slov; %<PRId64> z %<PRId64> Znakov; %<PRId64> z %<PRId64> Bajtov

source: Col %s of %s; Line %<PRId64> of %<PRId64>; Word %<PRId64> of %<PRId64>; Byte %<PRId64> of %<PRId64>
sk: St�pec %s z %s; Riadok %<PRId64> z %<PRId64>; Slovo %<PRId64> z %<PRId64>; Bajt %<PRId64> z %<PRId64>

source: Col %s of %s; Line %<PRId64> of %<PRId64>; Word %<PRId64> of %<PRId64>; Char %<PRId64> of %<PRId64>; Byte %<PRId64> of %<PRId64>
sk: St�pec %s z %s; Riadok %<PRId64> z %<PRId64>; Slovo %<PRId64> z %<PRId64>; Znak %<PRId64> z %<PRId64>; Bajt %<PRId64> z %<PRId64>

source: (+%<PRId64> for BOM)
sk: (+%<PRId64> pre BOM)

source: %<%f%h%m%=Page %N
sk: %<%f%h%m%=Strana %N

source: Thanks for flying Vim
sk: �akujeme za pou�itie Vim

source: E518: Unknown option
sk: E518: Nezn�ma vo�ba

source: E519: Option not supported
sk: E519: Vo�ba nie je podporovan�

source: E520: Not allowed in a modeline
sk: E520: Nie je v modeline povolen�

source: E521: Number required after =
sk: E521: Po = je vy�adovan� ��slo

source: E522: Not found in termcap
sk: E522: Nen�jden� v termcape

source: E539: Illegal character <%s>
sk: E539: Nepr�pustn� znak <%s>

source: E529: Cannot set 'term' to empty string
sk: E529: Vo�ba 'term' nem��e by� pr�zdna

source: E589: 'backupext' and 'patchmode' are equal
sk: E589: vo�by 'backupext' a 'patchmode' maj� rovnak� hodnotu

source: E524: Missing colon
sk: E524: Ch�ba dvojbodka

source: E525: Zero length string
sk: E525: Re�azec s nulovou d��kou

source: E526: Missing number after <%s>
sk: E526: Po <%s> ch�ba ��slo

source: E527: Missing comma
sk: E527: Ch�ba �iarka

source: E528: Must specify a ' value
sk: E528: Je nutn� zada� hodnotu '

source: E595: contains unprintable or wide character
sk: E595: obsahuje netla�ite�n� znaky

source: E535: Illegal character after <%c>
sk: E535: Nepr�pustn� znak po <%c>

source: E536: comma required
sk: E536: je nutn� �iarka

source: E537: 'commentstring' must be empty or contain %s
sk: E537: 'commentstring' (koment�r) mus� by� pr�zdny alebo mus� obsahova� %s

source: E540: Unclosed expression sequence
sk: E540: Neuzatvoren� zoskupenie v�razov

source: E541: too many items
sk: E541: pr�li� mnoho polo�iek

source: E542: unbalanced groups
sk: E542: nevyv��en� skupiny

source: E590: A preview window already exists
sk: E590: Okno n�h�adu u� existuje

source: W17: Arabic requires UTF-8, do ':set encoding=utf-8'
sk: W17: M�d Arabic vy�aduje k�dovanie UTF-8, nastavte to pr�kazom ':set encoding=utf-8'

source: E593: Need at least %d lines
sk: E593: Minim�lny potrebn� po�et riadkov je %d

source: E594: Need at least %d columns
sk: E594: Minim�lne potrebn� po�et st�pcov je %d

source: E355: Unknown option: %s
sk: E355: Nezn�ma vo�ba: %s

source: --- Terminal codes ---
sk: --- K�dy termin�lu ---

source: --- Global option values ---
sk: --- Nastavenie glob�lnych volieb ---

source: --- Local option values ---
sk: --- Nastavenie lok�lnych volieb ---

source: --- Options ---
sk: --- Mo�nosti ---

source: E356: get_varp ERROR
sk: E356: get_varp CHYBA

source: E357: 'langmap': Matching character missing for %s
sk: E357: 'langmap': pre %s ch�ba vyhovuj�ci znak

source: E358: 'langmap': Extra characters after semicolon: %s
sk: E358: 'langmap': nadbyto�n� znaky po bodko�iarke: %s

source: Cannot execute shell
sk: Ned� sa spusti� shell

source: shell returned
sk: n�vratov� hodnota shellu

source: E447: Can't find file "%s" in path
sk: E447: S�bor "%s" sa ned� n�js� v ceste
