Repository: neovim/neovim
Catalog: src/nvim/po/*.cp1250.po
Languages: sk

source: E82: Cannot allocate any buffer, exiting...
sk: E82: Ned� sa alokova� buffer, kon��m...

source: E83: Cannot allocate buffer, using other one...
sk: E83: Ned� sa alokova� buffer, pou�ijem in�...

source: E515: No buffers were unloaded
sk: E515: �iadny buffer nebol uvo�nen�

source: E516: No buffers were deleted
sk: E516: �iadny buffer nebol vymazan�

source: E517: No buffers were wiped out
sk: E517: �iadny buffer nebol vymazan�

source: 1 buffer unloaded
sk: 1 buffer uvo�nen�

source: %d buffers unloaded
sk: %d bufferov uvo�nen�ch

source: 1 buffer deleted
sk: 1 buffer vymazan�

source: %d buffers deleted
sk: %d bufferov vymazan�ch

source: 1 buffer wiped out
sk: 1 buffer odstr�nen�

source: %d buffers wiped out
sk: %d bufferov odstr�nen�ch

source: E90: Cannot unload last buffer
sk: E90: Posledn� buffer sa ned� odstr�ni�

source: E84: No modified buffer found
sk: E84: Nebol n�jden� �iadny zmenen� buffer

source: E85: There is no listed buffer
sk: E85: Nena�iel som �iadny buffer

source: E86: Buffer %<PRId64> does not exist
sk: E86: Buffer %<PRId64> neexistuje

source: E87: Cannot go beyond last buffer
sk: E87: Za posledn� buffer sa ned� presko�i�

source: E88: Cannot go before first buffer
sk: E88: Pred prv� buffer sa ned� presko�i�

source: E89: No write since last change for buffer %<PRId64> (add ! to override)
sk: E89: Zmeny v bufferi %<PRId64> neboli ulo�en� (! pre vyn�tenie)

source: W14: Warning: List of file names overflow
sk: W14: Varovanie: prete�enie zoznamu s n�zvami s�borov

source: E92: Buffer %<PRId64> not found
sk: E92: buffer %<PRId64> nen�jden�

source: E93: More than one match for %s
sk: E93: Vzoru %s vyhovuje viac bufferov

source: E94: No matching buffer for %s
sk: E94: Vzoru %s nevyhovuje �iadny buffer

source: line %<PRId64>
sk: riadok %<PRId64>

source: E95: Buffer with this name already exists
sk: E95: Buffer tak�hoto mena u� existuje

source: [Modified]
sk: [Zmenen�]

source: [Not edited]
sk: [Neupravovan�]

source: [New file]
sk: [Nov� s�bor]

source: [Read errors]
sk: [Chyby pri ��tan�]

source: [readonly]
sk: [iba pre ��tanie]

source: 1 line --%d%%--
sk: 1 riadok --%d%%--

source: %<PRId64> lines --%d%%--
sk: %<PRId64> riadkov --%d%%--

source: line %<PRId64> of %<PRId64> --%d%%-- col
sk: riadok %<PRId64> z %<PRId64> --%d%%-- st�pec

source: [No Name]
sk: [Bez mena]

source: help
sk: pomocn�k

source: [Preview]
sk: [N�h�ad]

source: All
sk: V�etko

source: Bot
sk: Koniec

source: Top
sk: Za�iatok

source: # Buffer list:
sk: # Zoznam bufferov:

source: --- Signs ---
sk: --- Znaky ---

source: Signs for %s:
sk: Znaky pre %s:

source: line=%<PRId64> id=%d name=%s
sk: riadok=%<PRId64> id=%d meno=%s

source: E545: Missing colon
sk: E545: Ch�ba dvojbodka

source: E546: Illegal mode
sk: E546: Nepr�pustn� m�d

source: E548: digit expected
sk: E548: o�ak�van� ��slica

source: E549: Illegal percentage
sk: E549: Nepr�pustn� percento

source: E96: Can not diff more than %<PRId64> buffers
sk: E96: Nem��em porovna� viac ako %<PRId64> bufferov

source: E97: Cannot create diffs
sk: E97: Nedaj� sa vytvori� porovnania

source: E98: Cannot read diff output
sk: E98: Ned� sa ��ta� v�stup porovnania

source: E99: Current buffer is not in diff mode
sk: E99: Aktu�lny buffer nie je v porovn�vacom m�de

source: E100: No other buffer in diff mode
sk: E100: V porovn�vacom m�de sa nenach�dza in� buffer

source: E101: More than two buffers in diff mode, don't know which one to use
sk: E101: Viac ako dva buffery v porovn�vacom m�de; neviem, ktor� pou�i�

source: E102: Can't find buffer "%s"
sk: E102: Ned� sa n�js� buffer "%s"

source: E103: Buffer "%s" is not in diff mode
sk: E103: Buffer "%s" nie je v porovn�vacom m�de

source: E104: Escape not allowed in digraph
sk: E104: digraph nesmie obsahova� znak Escape

source: E544: Keymap file not found
sk: E544: Mapa kl�ves nen�jden�

source: E105: Using :loadkeymap not in a sourced file
sk: E105: Pou�it� pr�kaz :loadkeymap v s�bore, ktor� nie je interpretovan�

source: Keyword completion (^N^P)
sk: Dopl�ovanie k���ov�ch slov (^N^P)

source: Whole line completion (^L^N^P)
sk: Dopl�ovanie cel�ch riadkov (^L^N^P)

source: File name completion (^F^N^P)
sk: Dopl�ovanie n�zvov s�borov (^F^N^P)

source: Tag completion (^]^N^P)
sk: Dopl�ovanie tagov (^]^N^P)

source: Path pattern completion (^N^P)
sk: Dopl�ovanie vzoru ciest (^N^P)

source: Definition completion (^D^N^P)
sk: Dopl�ovanie defin�ci� (^D^N^P)

source: Dictionary completion (^K^N^P)
sk: Dopl�ovanie pod�a slovn�ka (^K^N^P)

source: Thesaurus completion (^T^N^P)
sk: Dopl�ovanie pod�a lexikonu (^T^N^P)

source: Command-line completion (^V^N^P)
sk: Dopl�ovanie pr�kazov�ho riadka (^V^N^P)

source: User defined completion (^U^N^P)
sk: Dopl�ovanie cel�ch riadkov (^U^N^P)

source: Omni completion (^O^N^P)
sk: Dopl�ovanie tagov (^O^N^P)

source: Keyword Local completion (^N^P)
sk: Miestne dopl�ovanie k���ov�ch slov (^N^P)

source: Hit end of paragraph
sk: Koniec odstavca

source: 'dictionary' option is empty
sk: vo�ba 'dictionary' (slovn�k) je pr�zdna

source: 'thesaurus' option is empty
sk: vo�ba 'thesaurus' (lexikon) je pr�zdna

source: Scanning dictionary: %s
sk: preh�ad�vam slovn�k %s

source: (insert) Scroll (^E/^Y)
sk: (insert) Rolovanie (^E/^Y)

source: (replace) Scroll (^E/^Y)
sk: (replace) Rolovanie (^E/^Y)

source: Scanning: %s
sk: Preh�ad�vam: %s

source: Scanning tags.
sk: Preh�ad�vam tagy.

source: Adding
sk: Prid�vam

source: -- Searching...
sk: -- H�ad�m...

source: Back at original
sk: V�chodzia podoba

source: Word from other line
sk: Slovo z in�ho riadku

source: The only match
sk: Jedin� zhoda

source: match %d of %d
sk: zhoda %d z %d

source: match %d
sk: zhoda %d

source: E18: Unexpected characters in :let
sk: E18: Neo�ek�van� znaky v :let

source: E684: list index out of range: %<PRId64>
sk: E684: index v zozname je mimo rozsah: %<PRId64>

source: E121: Undefined variable: %s
sk: E121: Nedefinovan� premenn�: %s

source: E111: Missing ']'
sk: E111: Ch�ba ']'

source: E686: Argument of %s must be a List
sk: E686: Argument %s mus� by� Zoznam (List)

source: E712: Argument of %s must be a List or Dictionary
sk: E712: Argument %s mus� by� Zoznam (List) alebo Slovn�k (Dictionary)

source: E713: Cannot use empty key for Dictionary
sk: E713: Nemo�no pou�i� pr�zdny k��� pre Slovn�k (Dictionary)

source: E714: List required
sk: E714: vy�aduje sa Zoznam (List)

source: E715: Dictionary required
sk: E715: Vy�aduje sa Slovn�k (Dictionary)

source: E118: Too many arguments for function: %s
sk: E118: Pr�li� mnoho argumentov pre funkciu %s

source: E716: Key not present in Dictionary: %s
sk: E716: k��� sa v Slovn�ku (Dictionary) nenach�dza: %s

source: E122: Function %s already exists, add ! to replace it
sk: E122: Funkcia %s u� existuje. Pou�ite ! pre jej nahradenie.

source: E717: Dictionary entry already exists
sk: E717: Z�znam v Slovn�ku (Dictionary) u� existuje

source: E718: Funcref required
sk: E718: Je vy�adovan� odkaz na Funkciu (Funcref)

source: E719: Cannot use [:] with a Dictionary
sk: E719: Nemo�no pou�it [:] so Slovn�kom (Dictionary)

source: E734: Wrong variable type for %s=
sk: E734: Zl� typ premennej pre %s=

source: E130: Unknown function: %s
sk: E130: Nezn�ma funkcia: %s

source: E461: Illegal variable name: %s
sk: E461: Nepr�pustn� meno premennej: %s

source: E687: Less targets than List items
sk: E687: Menej cie�ov ako polo�iek Po�a (List items)

source: E688: More targets than List items
sk: E688: Viac cie�ov ako polo�iek Po�a (List items)

source: Double ; in list of variables
sk: Dvojit� ; v zozname premenn�ch

source: E738: Can't list variables for %s
sk: E738: Nemo�no vyp�sa� premenn� pre %s

source: E689: Can only index a List or Dictionary
sk: E689: Indexova� mo�no iba Zoznam (List) alebo Slovn�k (Dictionary)

source: E708: [:] must come last
sk: E708: [:] mus� pr�s� ako posledn�

source: E709: [:] requires a List value
sk: E709: [:] vy�aduje hodnotu Po�a (List value)

source: E710: List value has more items than target
sk: E710: Hodnota Po�a (List value) m� viac polo�iek ako cie�

source: E711: List value has not enough items
sk: E711: Hodnota Po�a (List value) nem� dostatok polo�iek

source: E690: Missing "in" after :for
sk: E690: Ch�ba "in" po :for

source: E107: Missing parentheses: %s
sk: E107: Ch�baj� z�tvorky: %s

source: E108: No such variable: "%s"
sk: E108: Premenn� "%s" neexistuje

source: E743: variable nested too deep for (un)lock
sk: E743: premenn� je pr�li� vnoren� na (od)blokovanie

source: E109: Missing ':' after '?'
sk: E109: Po '?' ch�ba ':'

source: E691: Can only compare List with List
sk: E691: Porovn�va� mo�no iba Zoznam so Zoznamom (List with List)

source: E692: Invalid operation for Lists
sk: E692: Neplatn� oper�cia pre Zoznamy (Lists)

source: E735: Can only compare Dictionary with Dictionary
sk: E735: Porovn�va� mo�no iba Slovn�k so Slovn�kom (Dictionary with Dictionary)

source: E736: Invalid operation for Dictionary
sk: E736: Neplatn� oper�cia pre Slovn�k

source: E693: Can only compare Funcref with Funcref
sk: E693: Porovn�va� mo�no iba odkaz na Funkciu s odkazom na Funkciu (Funcref with Funcref)

source: E694: Invalid operation for Funcrefs
sk: E694: Neplatn� oper�cia pre odkazy na Funkcie (Funcrefs)

source: E110: Missing ')'
sk: E110: Ch�ba ')'

source: E695: Cannot index a Funcref
sk: E695: Nemo�no indexova� odkaz na Funkciu (Funcref)

source: E112: Option name missing: %s
sk: E112: Ch�ba meno vo�by: %s

source: E113: Unknown option: %s
sk: E113: Nezn�ma vo�ba: %s

source: E114: Missing quote: %s
sk: E114: Ch�baj� �vodzovky: %s

source: E115: Missing quote: %s
sk: E115: Ch�baj� �vodzovky: %s

source: E696: Missing comma in List: %s
sk: E696: Ch�ba �iarka v Zozname: %s

source: E697: Missing end of List ']': %s
sk: E697: Ch�ba koniec Zoznamu (List) ']': %s

source: E720: Missing colon in Dictionary: %s
sk: E720: Ch�ba dvojbodka v Slovn�ku (Dictionary): %s

source: E721: Duplicate key in Dictionary: "%s"
sk: E721: Duplikovan� k��� v Slovn�ku (Dictionary): "%s"

source: E722: Missing comma in Dictionary: %s
sk: E722: Ch�ba �iarka v Slovn�ku (Dictionary): %s

source: E723: Missing end of Dictionary '}': %s
sk: E723: Ch�ba koniec Slovn�ka (Dictionary) '}': %s

source: E724: variable nested too deep for displaying
sk: E724: premenn� je vnoren� pr�li� hlboko pre zobrazenie

source: E699: Too many arguments
sk: E699: Pr�li� mnoho argumentov

source: E737: Key already exists: %s
sk: E737: K��� u� existuje: %s

source: +-%s%3ld lines:
sk: +-%s%3ld riadky:

source: E700: Unknown function: %s
sk: E700: Nezn�ma funkcia: %s

source: called inputrestore() more often than inputsave()
sk: funkcia inputrestore() volan� �astej�ie ako inputsave()

source: E701: Invalid type for len()
sk: E701: Neplatn� typ pre len()

source: E726: Stride is zero
sk: E726: Krok je nulov�

source: E727: Start past end
sk: E727: Za�iatok presahuje koniec

source: <empty>
sk: <pr�zdny>

source: E655: Too many symbolic links (cycle?)
sk: E655: Pr�li� mnoho symbolick�ch odkazov (slu�ka?)

source: E702: Sort compare function failed
sk: E702: Funkcia na utriedenie/porovnanie zlyhala

source: (Invalid)
sk: (Chybn�)

source: E677: Error writing temp file
sk: E677: Chyba pri z�pise do�asn�ho s�boru

source: E703: Using a Funcref as a Number
sk: E703: Pou�it� odkaz na Funkciu (Funcref) ako ��slo

source: E745: Using a List as a Number
sk: E745: Zoznam (List) pou�it� ako ��slo

source: E728: Using a Dictionary as a Number
sk: E728: Slovn�k (Dictionary) pou�it� ako ��slo

source: E729: using Funcref as a String
sk: E729: Odkaz na Funkciu (Funcref) pou�it� ako Re�azec (String)

source: E730: using List as a String
sk: E730: Zoznam (List) pou�it� ako Re�azec (String)

source: E731: using Dictionary as a String
sk: E731: Slovn�k (Dictionary) pou�it� ako Re�azec (String)

source: E706: Variable type mismatch for: %s
sk: E706: Typ premennej sa nezhoduje: %s

source: E704: Funcref variable name must start with a capital: %s
sk: E704: Premenn� typu odkaz na Funkciu (Funcref) mus� za��na� s ve�k�m p�smenom: %s

source: E705: Variable name conflicts with existing function: %s
sk: E705: Meno premennej je v konflikte s existuj�cou funkciou: %s

source: E741: Value is locked: %s
sk: E741: Hodnota je uzamknut�: %s

source: Unknown
sk: Nezn�my

source: E742: Cannot change value of %s
sk: E742: Nemo�no zmeni� hodnotu %s

source: E698: variable nested too deep for making a copy
sk: E698: premenn� je vnoren� pr�li� hlboko pre skop�rovanie

source: E124: Missing '(': %s
sk: E124: Ch�ba '(': %s

source: E125: Illegal argument: %s
sk: E125: Nepr�pustn� argument: %s

source: E126: Missing :endfunction
sk: E126: Ch�ba :endfunction

source: E746: Function name does not match script file name: %s
sk: E746: Meno funkcie sa nezhoduje s menom interpretovan�ho s�boru: %s

source: E129: Function name required
sk: E129: Je vy�adovan� meno funkcie

source: E131: Cannot delete function %s: It is in use
sk: E131: Ned� sa vymaza� funkcia %s: je pou��van�

source: E132: Function call depth is higher than 'maxfuncdepth'
sk: E132: Zanorenie funkci� je hlb�ie ne� 'maxfuncdepth'

source: calling %s
sk: vol�m %s

source: %s aborted
sk: %s zru�en�

source: %s returning #%<PRId64>
sk: %s vr�tilo #%<PRId64>

source: %s returning %s
sk: %s vr�tilo %s

source: continuing in %s
sk: pokra�ujem v %s

source: E133: :return not inside a function
sk: E133: :return mimo funkciu

source: # global variables:
sk: # glob�lne premenn�:

source: Last set from
sk: Posledn� nastavenie z

source: <%s>%s%s %d, Hex %02x, Octal %03o
sk: <%s>%s%s %d, �estn�stkovo %02x, osmi�kovo %03o

source: > %d, Hex %04x, Octal %o
sk: > %d, �estn�stkovo %04x, osmi�kovo %o

source: > %d, Hex %08x, Octal %o
sk: > %d, �estn�stkovo %08x, osmi�kovo %o

source: E134: Move lines into themselves
sk: E134: Prekrytie riadkov sebou sam�mi

source: 1 line moved
sk: 1 riadok presunut�

source: %<PRId64> lines moved
sk: %<PRId64> riadkov presunut�ch

source: %<PRId64> lines filtered
sk: %<PRId64> riadkov filtrovan�ch

source: E135: *Filter* Autocommands must not change current buffer
sk: E135: Automatick� pr�kazy *Filter* nesm� meni� aktu�lny buffer

source: [No write since last change]
sk: [Neulo�en� zmeny]

source: %sviminfo: %s in line:
sk: %sviminfo: %s na riadku:

source: E136: viminfo: Too many errors, skipping rest of file
sk: E136: viminfo: pr�li� mnoho ch�b, preskakujem zbytok s�boru

source: Reading viminfo file "%s"%s%s%s
sk: ��tam viminfo s�bor "%s"%s%s%s

source: info
sk: inform�cie

source: marks
sk: zna�ky

source: FAILED
sk: ZLYHALO

source: E137: Viminfo file is not writable: %s
sk: E137: Do viminfo s�boru %s sa ned� zapisova�

source: E138: Can't write viminfo file %s!
sk: E138: Ned� sa ulo�i� viminfo s�bor %s!

source: Writing viminfo file "%s"
sk: Ukl�d�m viminfo s�boru "%s"

source: # This viminfo file was generated by Vim %s.
sk: # Tento viminfo s�bor bol vytvoren� editorom Vim %s.

source: # You may edit it if you're careful!
sk: # Pokia� budete opatrn�, m��ete ho upravova�.

source: # Value of 'encoding' when this file was written
sk: # Hodnota 'encoding' (k�dovania) po�as z�pisu tohoto s�boru

source: Illegal starting char
sk: Nepr�pustn� za�iato�n� znak

source: Write partial file?
sk: Ulo�i� ne�pln� s�bor?

source: E140: Use ! to write partial buffer
sk: E140: Pou�ite ! pre ulo�enie ne�pln�ho bufferu

source: Overwrite existing file "%s"?
sk: Prep�sa� existuj�ci s�bor "%s"?

source: Swap file "%s" exists, overwrite anyway?
sk: Odkladac� s�bor "%s" existuje, aj tak prep�sa�?

source: E768: Swap file exists: %s (:silent! overrides)
sk: E768: Odkladac� s�bor existuje: %s (pou�ite :silent! pre prep�sanie)

source: E141: No file name for buffer %<PRId64>
sk: E141: �iadny n�zov s�boru pre buffer %<PRId64>

source: E142: File not written: Writing is disabled by 'write' option
sk: E142: S�bor nebol ulo�en�: ukladanie je zak�zan� vo�bou 'write'

source: 'readonly' option is set for "%s". Do you wish to write anyway?
sk: Pre "%s" je nastaven� vo�ba 'readonly' (iba na ��tanie). Prajete si aj tak ulo�i�?

source: E143: Autocommands unexpectedly deleted new buffer %s
sk: E143: Automatick� pr�kazy neo�ak�vane zmazali nov� buffer %s

source: E144: non-numeric argument to :z
sk: E144: ne��seln� argument pre :z

source: E145: Shell commands not allowed in rvim
sk: E145: rvim nepovo�uje pou�itie pr�kazov shellu

source: E146: Regular expressions can't be delimited by letters
sk: E146: Regul�rne v�razy nesm� by� oddelen� p�smenami

source: replace with %s (y/n/a/q/l/^E/^Y)?
sk: nahradi� %s (y/n/a/q/l/^E/^Y)?

source: (Interrupted)
sk: (preru�en�)

source: 1 match
sk: 1 zhoda

source: 1 substitution
sk: 1 nahradenie

source: %<PRId64> matches
sk: %<PRId64> zh�d

source: %<PRId64> substitutions
sk: %<PRId64> nahraden�

source: on 1 line
sk: na 1 riadku

source: on %<PRId64> lines
sk: na %<PRId64> riadkov

source: E147: Cannot do :global recursive
sk: E147: :global sa ned� vola� rekurz�vne

source: E148: Regular expression missing from global
sk: E148: Pri pr�kaze global ch�ba regul�rny v�raz

source: Pattern found in every line: %s
sk: Vzor n�jden� na ka�dom riadku: %s

source: # Last Substitute String: $
sk: # Posledn� zamie�an� re�azec: $

source: E478: Don't panic!
sk: E478: �iadnu paniku!

source: E661: Sorry, no '%s' help for %s
sk: E661: �utujem, �iadny '%s' pomocn�k pre %s

source: E149: Sorry, no help for %s
sk: E149: �utujem, pre %s nie je �iadny pomocn�k

source: Sorry, help file "%s" not found
sk: �utujem, s�bor "%s" s pomocn�kom nebol n�jden�

source: E150: Not a directory: %s
sk: E150: %s nie je adres�rom

source: E152: Cannot open %s for writing
sk: E152: %s sa ned� sa otvori� pre z�pis

source: E153: Unable to open %s for reading
sk: E153: %s as ned� otvori� pre ��tanie

source: E670: Mix of help file encodings within a language: %s
sk: E670: R�zne k�dovania pre s�bory s pomocn�kom pre jazyk: %s

source: E154: Duplicate tag "%s" in file %s/%s
sk: E154: Duplicitn� tag "%s" v s�bore %s/%s

source: E160: Unknown sign command: %s
sk: E160: Nezn�mu pr�kaz pre zna�ky: %s

source: E156: Missing sign name
sk: E156: Ch�ba meno pre zna�ku

source: E612: Too many signs defined
sk: E612: Pr�li� mnoho definovan�ch zna�iek

source: E239: Invalid sign text: %s
sk: E239: Chybn� text zna�ky: %s

source: E155: Unknown sign: %s
sk: E155: Nezn�ma zna�ka: %s

source: E159: Missing sign number
sk: E159: Ch�ba �islo zna�ky

source: E158: Invalid buffer name: %s
sk: E158: Chybn� meno bufferu: %s

source: E157: Invalid sign ID: %<PRId64>
sk: E157: Chybn� ID zna�ky: %<PRId64>

source: (not supported)
sk: (nepodporovan�)

source: [Deleted]
sk: [vymazan�]

source: Entering Debug mode. Type "cont" to continue.
sk: Sp���am re�im ladenia. Pre ukon�enie nap��te "cont".

source: line %<PRId64>: %s
sk: riadok %<PRId64>: %s

source: cmd: %s
sk: pr�kaz: %s

source: Breakpoint in "%s%s" line %<PRId64>
sk: Bod preru�enia v "%s%s" na riadku %<PRId64>

source: E161: Breakpoint not found: %s
sk: E161: Bod preru�enia nen�jden�: %s

source: No breakpoints defined
sk: Neboli definovn� �iadne body preru�enia

source: %3d %s %s line %<PRId64>
sk: %3d %s %s riadok %<PRId64>

source: Save changes to "%s"?
sk: Ulo�i� zmeny do "%s"?

source: Untitled
sk: Bez mena

source: E162: No write since last change for buffer "%s"
sk: E162: Buffer "%s" obsahuje neulo�en� zmeny

source: Warning: Entered other buffer unexpectedly (check autocommands)
sk: Varovanie: Ne�akan� vstup do in�ho bufferu (skontrolujte automatick� pr�kazy)

source: E163: There is only one file to edit
sk: E163: Pre �pravu bol zadan� iba jeden s�bor

source: E164: Cannot go before first file
sk: E164: Ned� sa presko�i� pred prv� s�bor

source: E165: Cannot go beyond last file
sk: E165: Ned� sa presko�i� za posledn� s�bor

source: E666: compiler not supported: %s
sk: E666: preklada� nie je podporovan�: %s

source: Searching for "%s" in "%s"
sk: H�ad�m "%s" v "%s"

source: Searching for "%s"
sk: H�ad�m "%s"

source: not found in 'runtimepath': "%s"
sk: s�bor "%s" nebol n�jden� v 'runtimepath'

source: Cannot source a directory: "%s"
sk: Nemo�no interpretova� adres�r: "%s"

source: could not source "%s"
sk: ned� sa interpretova� "%s"

source: line %<PRId64>: could not source "%s"
sk: riadok %<PRId64>: nem��no interpretova� "%s"

source: sourcing "%s"
sk: interpretujem "%s"

source: line %<PRId64>: sourcing "%s"
sk: riadok %<PRId64>: interpretujem "%s"

source: finished sourcing %s
sk: dokon�en� interpret�cia %s

source: W15: Warning: Wrong line separator, ^M may be missing
sk: W15: Varovanie: chybn� odde�ova� riadkov. Mo�no ch�ba ^M

source: E167: :scriptencoding used outside of a sourced file
sk: E167: pr�kaz :scriptencoding pou�it� mimo interpretovan� s�bor

source: E168: :finish used outside of a sourced file
sk: E168: pr�kaz :finish pou�it� mimo interpretovan� s�bor

source: Current %slanguage: "%s"
sk: Aktu�lny %sjazyk: "%s"

source: E197: Cannot set language to "%s"
sk: E197: Ned� sa nastavi� jazyk na "%s"

source: Entering Ex mode. Type "visual" to go to Normal mode.
sk: Sp���am Ex re�im. Nap��te "visual" pre n�vrat do Norm�lneho re�imu.

source: E501: At end-of-file
sk: E501: Koniec s�boru

source: E169: Command too recursive
sk: E169: Pr�kaz je pr�li� rekurz�vny

source: E605: Exception not caught: %s
sk: E605: V�nimka nezachyten�: %s

source: End of sourced file
sk: Koniec interpretovan�ho s�boru

source: End of function
sk: Koniec funkcie

source: E464: Ambiguous use of user-defined command
sk: E464: Nejednozna�n� pou�itie pou��vate�om definovan�ho pr�kazu

source: E492: Not an editor command
sk: E492: Nie je pr�kazom editoru

source: E493: Backwards range given
sk: E493: Zadan� sp�tn� rozsah

source: Backwards range given, OK to swap
sk: Zadan� sp�tn� rozsah. OK pre z�menu

source: E494: Use w or w>>
sk: E494: Pou�ite w alebo w>>

source: E319: Sorry, the command is not available in this version
sk: E319: �utujem, ale tento pr�kaz nie je dostupn� v tejto verzii

source: E172: Only one file name allowed
sk: E172: Pr�pustn� je iba jeden n�zov s�boru

source: 1 more file to edit. Quit anyway?
sk: E�te zost�va 1 s�bor k �prave. Chcete napriek tomu ukon�i� editor?

source: %d more files to edit. Quit anyway?
sk: E�te zost�va %d s�borov k �prave. Chcete napriek tomu ukon�i� editor?

source: E173: 1 more file to edit
sk: E173: E�te zost�va 1 s�bor k �prave.

source: E173: %<PRId64> more files to edit
sk: E173: E�te zost�va %<PRId64> s�borov k �prave.

source: E174: Command already exists: add ! to replace it
sk: E174: Pr�kaz u� existuje: pou�ite ! pre predefinovanie

source: Name Args Range Complete Definition
sk: Meno Args Rozsah �plnos� Defin�cia

source: No user-defined commands found
sk: Neboli n�jden� �iadne pou�ivate�om definovan� pr�kazy

source: E175: No attribute specified
sk: E175: Neboli zadan� �iadne vlastnosti

source: E176: Invalid number of arguments
sk: E176: Chybn� po�et argumentov

source: E177: Count cannot be specified twice
sk: E177: Po�et nem��e by� zadan� dvakr�t

source: E178: Invalid default value for count
sk: E178: Chybn� implicitn� hodnota pre po�et

source: E179: argument required for -complete
sk: E179: pre doplnenie (-complete) je potrebn� argument

source: E181: Invalid attribute: %s
sk: E181: Chybn� vlastnos�: %s

source: E182: Invalid command name
sk: E182: Chybn� meno pr�kazu

source: E183: User defined commands must start with an uppercase letter
sk: E183: Pou��vate�om definovan� pr�kazy musia za��na� ve�k�m p�smenom

source: E184: No such user-defined command: %s
sk: E184: Pou��vate�om definovan� pr�kaz %s neexistuje

source: E180: Invalid complete value: %s
sk: E180: Chybn� hodnota doplnenia: %s

source: E468: Completion argument only allowed for custom completion
sk: E468: Argument doplnenia je povolen� iba pre vlastn� dop��ania (completion)

source: E467: Custom completion requires a function argument
sk: E467: Vlastn� doplnenia vy�aduj� meno funkcie ako argument
