Repository: neovim/neovim
Catalog: src/nvim/po/*.cp1250.po
Languages: sk

source: E372: Too many %%%c in format string
sk: E372: Pr�li� mnoho %%%c vo form�tovacom re�azci

source: E373: Unexpected %%%c in format string
sk: E373: Neo�ak�van� v�skyt %%%c vo form�tovacom re�azci

source: E374: Missing ] in format string
sk: E374: Vo form�tovacom re�azci ch�ba ]

source: E375: Unsupported %%%c in format string
sk: E375: Nepodporovan� form�tov� �pecifik�cia %%%c vo form�tovacom re�azci

source: E376: Invalid %%%c in format string prefix
sk: E376: Nepr�stupn� %%%c v prefixe form�tovacieho re�azca

source: E377: Invalid %%%c in format string
sk: E377: Nepr�stupn� %%%c vo form�tovacom re�azci

source: E378: 'errorformat' contains no pattern
sk: E378: 'errorformat' neobsahuje �iadny vzor

source: E379: Missing or empty directory name
sk: E379: Ch�baj�ci alebo pr�zdny n�zov adres�ra

source: E553: No more items
sk: E553: �iadne �al�ie polo�ky

source: (%d of %d)%s%s:
sk: (%d z %d)%s%s:

source: (line deleted)
sk: (riadok vymazan�)

source: E380: At bottom of quickfix stack
sk: E380: Koniec quickfix zoznamu

source: E381: At top of quickfix stack
sk: E381: Za�iatok quickfix zoznamu

source: error list %d of %d; %d errors
sk: zoznam ch�b %d z %d; %d ch�b

source: E382: Cannot write, 'buftype' option is set
sk: E382: Ned� sa ulo�i�, je nastaven� vo�ba 'buftype'

source: E683: File name missing or invalid pattern
sk: E683: Ch�ba meno s�boru alebo chybn� vzor

source: Cannot open file "%s"
sk: Ned� sa otvori� s�bor "%s"

source: E681: Buffer is not loaded
sk: E681: Buffer nie je na��tan�

source: E369: invalid item in %s%%[]
sk: E369: chybn� polo�ka v %s%%[]

source: E769: Missing ] after %s[
sk: E769: Ch�baj�ca ] po %s[

source: E53: Unmatched %s%%(
sk: E53: Nesp�rovan� %s%%(

source: E54: Unmatched %s(
sk: E54: Nesp�rovan� %s(

source: E55: Unmatched %s)
sk: E55: Nesp�rovan� %s)

source: E66: \z( not allowed here
sk: E66: \z( tu nie je povolen�

source: E67: \z1 et al. not allowed here
sk: E67: \z1 a spol. tu nie je povolen�

source: E69: Missing ] after %s%%[
sk: E69: Ch�baj�ca ] po %s%%[

source: E70: Empty %s%%[]
sk: E70: Pr�zdny %s%%[]

source: E339: Pattern too long
sk: E339: Vzor je pr�li� dlh�

source: E50: Too many \z(
sk: E50: Pr�li� mnoho \z(

source: E51: Too many %s(
sk: E51: Pr�li� mnoho %s(

source: E52: Unmatched \z(
sk: E52: Nesp�rovan� \z(

source: E59: invalid character after %s@
sk: E59: Nepr�pustn� znak po %s@

source: E60: Too many complex %s{...}s
sk: E60: Pr�li� komplexn� %s{...}

source: E61: Nested %s*
sk: E61: Vnoren� %s*

source: E62: Nested %s%c
sk: E62: Vnoren� %s%c

source: E63: invalid use of \_
sk: E63: Chybne pou�it� \_

source: E64: %s%c follows nothing
sk: E64: %s%c ni� nenasleduje

source: E65: Illegal back reference
sk: E65: Chybn� sp�tn� referencia

source: E68: Invalid character after \z
sk: E68: Nepr�pustn� znak po \z

source: E678: Invalid character after %s%%[dxouU]
sk: E678: Nepr�pustn� znak po %s%%[dxouU]

source: E71: Invalid character after %s%%
sk: E71: Nepr�pustn� znak po %s%%

source: E554: Syntax error in %s{...}
sk: E554: Chyba syntaxe v %s{...}

source: External submatches:
sk: Vn�torn� podraden� zhody:

source: VREPLACE
sk: NAHRADI� VERTIK�LNE

source: REPLACE
sk: NAHRADI�

source: REVERSE
sk: OBR�TI�

source: INSERT
sk: VLO�I�

source: (insert)
sk: (vlo�i�)

source: (replace)
sk: (nahradi�)

source: (vreplace)
sk: (nahradi� vertik�lne)

source: Hebrew
sk: Hebrejsk�

source: Arabic
sk: Arabsk�

source: (lang)
sk: (jazyk)

source: (paste)
sk: (vlo�i�)

source: VISUAL
sk: VIZU�LNE

source: VISUAL LINE
sk: VIZU�LNY RIADOK

source: VISUAL BLOCK
sk: VIZU�LNY BLOK

source: SELECT
sk: ZHODY

source: SELECT LINE
sk: OZNA� RIADOK

source: SELECT BLOCK
sk: OZNA� BLOK

source: recording
sk: nahr�vam

source: E383: Invalid search string: %s
sk: E383: Nepr�pustn� h�adan� re�azec: %s

source: E384: search hit TOP without match for: %s
sk: E384: h�adanie dosiahlo za�iatok bez n�jdenia %s

source: E385: search hit BOTTOM without match for: %s
sk: E385: h�adanie dosiahlo koniec bez n�jdenia %s

source: E386: Expected '?' or '/' after ';'
sk: E386: Po ';' o�ak�vam '?' alebo '/'

source: (includes previously listed match)
sk: (vr�tane u� vyp�san�ch zh�d)

source: --- Included files
sk: --- Vlo�en� s�bory

source: not found
sk: nen�jden�

source: in path ---
sk: v ceste ---

source: (Already listed)
sk: (U� vyp�san�)

source: NOT FOUND
sk: NEN�JDEN�

source: Scanning included file: %s
sk: Preh�ad�vam vlo�en� s�bory: %s

source: E387: Match is on current line
sk: E387: Zhoda je na aktu�lnom riadku

source: All included files were found
sk: V�etky vlo�en� s�bory boli n�jden�

source: No included files
sk: �iadne vlo�en� s�bory

source: E388: Couldn't find definition
sk: E388: Ned� sa n�js� defin�cia

source: E389: Couldn't find pattern
sk: E389: Ned� sa n�js� vzor

source: E759: Format error in spell file
sk: E759: Chyba form�tovania v spell s�bore (kontrola pravopisu)

source: E758: Truncated spell file
sk: E758: Odseknut� spell s�bor (kontrola pravopisu)

source: Trailing text in %s line %d: %s
sk: Prebyto�n� text v %s na riadku %d: %s

source: Affix name too long in %s line %d: %s
sk: Pr�pona pr�li� dlh� v %s riadok %d: %s

source: E761: Format error in affix file FOL, LOW or UPP
sk: E761: Chyba form�tovania v s�bore pr�pon FOL, LOW alebo UPP (NASLEDUJE, MAL� alebo VE�K�)

source: E762: Character in FOL, LOW or UPP is out of range
sk: E762: Znak v FOL, LOW alebo UPP (NASLEDUJE, MAL� alebo VE�K�) je mimo rozsah

source: Compressing word tree...
sk: Rob�m kompresiu stromu slov...

source: E756: Spell checking is not enabled
sk: E756: Kontrola pravopisu nie je zapnut�

source: Warning: Cannot find word list "%s.%s.spl" or "%s.ascii.spl"
sk: Varovanie: Nemo�no n�js� zoznam slov "%s.%s.spl" alebo "%s.ascii.spl"

source: Reading spell file "%s"
sk: ��tam slovn�kov� s�bor "%s"

source: E757: This does not look like a spell file
sk: E757: Toto sa nezd� by� slovn�kov�m s�borom

source: E771: Old spell file, needs to be updated
sk: E771: Star� slovn�kov� s�bor, potrebuje by� zaktualizovan�

source: E772: Spell file is for newer version of Vim
sk: E772: Slovn�kov� s�bor je pre nov�iu verziu Vim

source: E770: Unsupported section in spell file
sk: E770: Nepodporovan� sekcia v slovn�kovom s�bore

source: Warning: region %s not supported
sk: Varovanie: regi�n %s nie je podporovan�

source: Reading affix file %s ...
sk: Na��tavam s�bor s pr�ponami %s ...

source: Conversion failure for word in %s line %d: %s
sk: Konverzia slova zlyhala v %s riadok %d: %s

source: Conversion in %s not supported: from %s to %s
sk: Konverzia v %s nie je podporovan�: z %s do %s

source: Invalid value for FLAG in %s line %d: %s
sk: Neplatn� hodnota pre pr�znak (FLAG) v %s riadok %d: %s

source: FLAG after using flags in %s line %d: %s
sk: Pr�znak (FLAG) po pou�it� pr�znakov v %s riadok %d: %s

source: Wrong COMPOUNDMIN value in %s line %d: %s
sk: Zl� hodnota COMPOUNDMIN v %s riadok %d: %s

source: Wrong COMPOUNDSYLMAX value in %s line %d: %s
sk: Zl� hodnota COMPOUNDSYLMAX v %s riadok %d: %s

source: Different combining flag in continued affix block in %s line %d: %s
sk: Rozdielna kombin�cia pr�znakov v nasleduj�com bloku pr�pon v %s riadok %d: %s

source: Duplicate affix in %s line %d: %s
sk: Duplicitn� pr�pona v %s riadok %d: %s

source: Expected Y or N in %s line %d: %s
sk: O�ak�vane Y alebo N v %s riadok %d: %s

source: Broken condition in %s line %d: %s
sk: Naru�en� podmienka v %s riadok %d: %s

source: Expected MAP count in %s line %d
sk: O�ak�vam po�et MAP v %s riadok %d

source: Duplicate character in MAP in %s line %d
sk: Opakovan� znak v MAP v %s riadok %d

source: Unrecognized or duplicate item in %s line %d: %s
sk: Nerozpoznan� alebo opakuj�ca sa polo�ka v %s riadok %d: %s

source: Missing FOL/LOW/UPP line in %s
sk: Ch�baj�ci riadok FOL/LOW/UPP v %s

source: COMPOUNDSYLMAX used without SYLLABLE
sk: COMPOUNDSYLMAX pou�it� bez SYLLABLE

source: Too many postponed prefixes
sk: Pr�li� mnoho odlo�en�ch pr�pon

source: Too many compound flags
sk: Pr�li� mnoho upravovac�ch pr�znakov

source: Too many postponed prefixes and/or compound flags
sk: Pr�li� mnoho odlo�en�ch pr�pon a/alebo upravovac�ch pr�znakov

source: Missing SOFO%s line in %s
sk: Ch�ba SOFO%s riadok v %s

source: Both SAL and SOFO lines in %s
sk: SAL a SOFO riadky z�rove� v %s

source: Flag is not a number in %s line %d: %s
sk: Pr�znak nie je ��slo v %s na riadku %d: %s

source: Illegal flag in %s line %d: %s
sk: Nepr�pustn� pr�znak v %s riadok %d: %s

source: %s value differs from what is used in another .aff file
sk: Hodnota %s sa odli�uje od hodnoty pou�itej v inom .aff s�bore

source: Reading dictionary file %s ...
sk: Na��tavam slovn�k %s ...

source: E760: No word count in %s
sk: E760: Ch�aj�ci po�et slov v %s

source: line %6d, word %6d - %s
sk: riadok %6d, slovo %6d - %s

source: Duplicate word in %s line %d: %s
sk: Opakuj�ce sa slovo v %s riadok %d: %s

source: First duplicate word in %s line %d: %s
sk: Prv� duplicitn� slovo v %s riadok %d: %s

source: %d duplicate word(s) in %s
sk: %d duplicitn� slovo(�) v %s

source: Ignored %d word(s) with non-ASCII characters in %s
sk: Ignorovan�ch %d slov s nep�smenn�mi znakmi v %s

source: Reading word file %s ...
sk: Na��tavam s�bor so slovami %s ...

source: Duplicate /encoding= line ignored in %s line %d: %s
sk: Duplicitn� riadok /encoding= v %s riadok %d ignorovan�: %s

source: /encoding= line after word ignored in %s line %d: %s
sk: /encoding= riadok nasleduj�ci po slove v %s riadok %d ignorovan�: %s

source: Duplicate /regions= line ignored in %s line %d: %s
sk: Duplicitn� riadok /regions= v %s riadok %d ignorovan�: %s

source: Too many regions in %s line %d: %s
sk: Pr�li� mnoho regi�nov v %s riadok %d: %s

source: / line ignored in %s line %d: %s
sk: Riadok / v %s riadok %d ignorovan�: %s

source: Invalid region nr in %s line %d: %s
sk: Pou��t� chybn� ��slo regi�nu v %s riadok %d: %s

source: Unrecognized flags in %s line %d: %s
sk: Nerozpoznan� pr�znak v %s riadok %d: %s

source: Ignored %d words with non-ASCII characters
sk: Ignorovan�ch %d slov s nep�smenn�mi znakmi

source: Estimated runtime memory use: %d bytes
sk: Ve�kos� pou��vanej pam�te: %d bajtov

source: E751: Output file name must not have region name
sk: E751: V�stupn� meno s�boru nesmie ma� n�zov regi�nu

source: E754: Only up to 8 regions supported
sk: E754: Podporovan�ch max. 8 regi�nov

source: E755: Invalid region in %s
sk: E755: Chybn� regi�n v %s

source: Warning: both compounding and NOBREAK specified
sk: Varovanie: �pecifikovan� sp�janie a nezalamovanie

source: Writing spell file %s ...
sk: Ukl�d�m slovn�kov� s�bor %s ...

source: Done!
sk: Hotovo!

source: E765: 'spellfile' does not have %<PRId64> entries
sk: E765: 'spellfile' nem� %<PRId64> polo�iek

source: E763: Word characters differ between spell files
sk: E763: Znaky slov sa odli�uj� medzi slovn�kov�mi s�bormi

source: Sorry, no suggestions
sk: Prep��te, �iadne n�vrhy

source: Sorry, only %<PRId64> suggestions
sk: Prep��te, iba %<PRId64> n�vrhov

source: Change "%.*s" to:
sk: Zmeni� "%.*s" na:

source: E752: No previous spell replacement
sk: E752: �iadny predch�dzaj�ce nahradenie pod�a slovn�ka

source: E753: Not found: %s
sk: E753: Nen�jden�: %s

source: E783: duplicate char in MAP entry
sk: E783: duplicitn� znak v MAP polo�ke

source: No Syntax items defined for this buffer
sk: Pre tento buffer nie s� definovan� �iadne polo�ky syntaxe

source: E390: Illegal argument: %s
sk: E390: Nepr�pustn� argument: %s

source: E391: No such syntax cluster: %s
sk: E391: Syntaktick� zostava %s neexistuje

source: syncing on C-style comments
sk: synchronizujem pod�a koment�rov jazyka C

source: no syncing
sk: �iadne synchroniz�cie

source: syncing starts
sk: synchroniz�cia za��na

source: lines before top line
sk: riadkov pred za�iatkom

source: --- Syntax sync items ---
sk: --- Polo�ky synchroniz�cie syntaxe ---

source: syncing on items
sk: synchronizujem polo�ky

source: --- Syntax items ---
sk: --- Polo�ky syntaxe ---

source: E392: No such syntax cluster: %s
sk: E392: Syntaktick� zostava %s neexistuje

source: minimal
sk: minim�lne

source: maximal
sk: maxim�lne

source: ; match
sk: ; zhoda

source: line breaks
sk: zalomen� riadkov

source: E395: contains argument not accepted here
sk: E395: obsahuje argumenty, ktor� tu nie s� povolen�

source: E393: group[t]here not accepted here
sk: E393: group[t]here nesmie by� na tomto mieste

source: E394: Didn't find region item for %s
sk: E394: Pre %s ch�ba polo�ka regi�nu

source: E397: Filename required
sk: E397: Vy�adovan� n�zov s�boru

source: E789: Missing ']': %s
sk: E789: Ch�ba ']': %s

source: E398: Missing '=': %s
sk: E398: Ch�ba '=': %s

source: E399: Not enough arguments: syntax region %s
sk: E399: Pr�li� m�lo argumentov: oblas� syntaxe %s

source: E400: No cluster specified
sk: E400: Nebola zadan� �iadna zostava

source: E401: Pattern delimiter not found: %s
sk: E401: Odde�ova� vzoru %s nen�jden�

source: E402: Garbage after pattern: %s
sk: E402: Chyba za vzorom: %s

source: E403: syntax sync: line continuations pattern specified twice
sk: E403: synchroniz�cia syntaxe: vzor pokra�ovania riadkov zadan� dvakr�t

source: E404: Illegal arguments: %s
sk: E404: Chybn� argumenty: %s

source: E405: Missing equal sign: %s
sk: E405: Ch�ba znamienko rovn� sa: %s

source: E406: Empty argument: %s
sk: E406: Pr�zdny argument: %s

source: E407: %s not allowed here
sk: E407: %s tu nie je povolen�

source: E408: %s must be first in contains list
sk: E408: %s mus� by� prv� v 'contains' zozname

source: E409: Unknown group name: %s
sk: E409: Nezn�my n�zov skupiny: %s

source: E410: Invalid :syntax subcommand: %s
sk: E410: Chybn� podraden� pr�kaz :syntax : %s

source: E679: recursive loop loading syncolor.vim
sk: E679: rekurz�vna slu�ka pri na��tavan� syncolor.vim

source: E411: highlight group not found: %s
sk: E411: skupina zv�raznenia %s nebola n�jden�

source: E412: Not enough arguments: ":highlight link %s"
sk: E412: Pr�li� m�lo argumentov: ":highlight link %s"

source: E413: Too many arguments: ":highlight link %s"
sk: E413: Pr�li� mnoho argumentov: ":highlight link %s"

source: E414: group has settings, highlight link ignored
sk: E414: skupina je nastaven�, odkaz na zv�raz�ovaciu skupinu ignorovan�

source: E415: unexpected equal sign: %s
sk: E415: neo�ak�van� znamienko rovn� sa: %s

source: E416: missing equal sign: %s
sk: E416: ch�ba znamienko rovn� sa: %s

source: E417: missing argument: %s
sk: E417: ch�ba argument: %s

source: E418: Illegal value: %s
sk: E418: Nepr�pustn� hodnota: %s

source: E419: FG color unknown
sk: E419: farba popredia nie je zn�ma

source: E420: BG color unknown
sk: E420: farba pozadia nie je zn�ma

source: E421: Color name or number not recognized: %s
sk: E421: N�zov alebo ��slo farby nebolo rozpoznan�: %s

source: E422: terminal code too long: %s
sk: E422: termin�lov� k�d je pr�li� dlh�: %s

source: E423: Illegal argument: %s
sk: E423: Nepr�pustn� argument: %s

source: E424: Too many different highlighting attributes in use
sk: E424: Pou��van�ch pr�li� ve�a odli�n�ch zv�raz�ovac�ch vlastnost�

source: E669: Unprintable character in group name
sk: E669: Netla�iteln� znak v mene skupiny

source: W18: Invalid character in group name
sk: W18: Chybn� znak v mene skupiny

source: E555: at bottom of tag stack
sk: E555: na konci zoznamu tagov

source: E556: at top of tag stack
sk: E556: na za�iatku zoznamu tagov

source: E425: Cannot go before first matching tag
sk: E425: Ned� sa sko�i� pred prv� vyhovuj�ci tag

source: E426: tag not found: %s
sk: E426: tag %s nen�jden�

source: # pri kind tag
sk: # pri typ tag

source: file
sk: s�bor

source: E427: There is only one matching tag
sk: E427: Vyhovuje iba jeden tag

source: E428: Cannot go beyond last matching tag
sk: E428: Za posledn� vyhovuj�ci tag sa ned� presko�i�

source: File "%s" does not exist
sk: S�bor "%s" neexistuje

source: tag %d of %d%s
sk: tag %d z %d%s

source: or more
sk: alebo viac

source: Using tag with different case!
sk: Pou��vam tag s p�smom inej ve�kosti!

source: E429: File "%s" does not exist
sk: E429: S�bor "%s" neexistuje

source: # TO tag FROM line in file/text
sk: # CIE� tag �TART riadok v s�bore/texte

source: Searching tags file %s
sk: Preh�ad�vam s�bor tagov %s

source: E431: Format error in tags file "%s"
sk: E431: Chyba form�tovania v s�bore tagov "%s"

source: Before byte %<PRId64>
sk: Pred bajtom %<PRId64>

source: E432: Tags file not sorted: %s
sk: E432: Obsah s�boru tagov %s nie je zoraden�

source: E433: No tags file
sk: E433: �iadny s�bor tagov

source: E434: Can't find tag pattern
sk: E434: Ned� sa n�js� vzor tagov

source: E435: Couldn't find tag, just guessing!
sk: E435: Tag sa ned� n�js�, iba h�dam!

source: ' not known. Available builtin terminals are:
sk: ' nie je zn�my. Dostupn� vstavan� termin�ly:

source: defaulting to '
sk: nastavujem na '

source: E557: Cannot open termcap file
sk: E557: Ned� sa otvori� termcap s�bor

source: E558: Terminal entry not found in terminfo
sk: E558: Terminfo neobsahuje polo�ku pre tento termin�l

source: E559: Terminal entry not found in termcap
sk: E559: Termcap neobsahuje polo�ku pre tento termin�l

source: E436: No "%s" entry in termcap
sk: E436: Termcap neobsahuje polo�ku "%s"

source: E437: terminal capability "cm" required
sk: E437: Termin�l mus� ma� schopnos� "cm" (schopnos� pohybu kurzora)

source: --- Terminal keys ---
sk: --- Kl�vesy termin�lu ---

source: Vim: Error reading input, exiting...
sk: Vim: Chyba pri ��tan� vstupu, kon��m...

source: E438: u_undo: line numbers wrong
sk: E438: u_undo: ��sla riadkov s� chybn�

source: E439: undo list corrupt
sk: E439: z�znam o zmen�ch po�koden�

source: E440: undo line missing
sk: E440: ch�ba opravn� riadok

source: Included patches:
sk: Pou�it� z�platy:

source: Modified by
sk: Zmenil

source: Compiled
sk: Prelo�en�

source: Huge version
sk: Maxim�lna verzia

source: without GUI.
sk: bez grafick�ho rozhrania.

source: Features included (+) or not (-):
sk: Vlastnosti zahrnut� (+) a nezahrnut� (-):

source: system vimrc file: "
sk: syst�mov� vimrc s�bor: "

source: user vimrc file: "
sk: u��vate�sk� vimrc s�bor: "

source: 2nd user vimrc file: "
sk: druh� u��vate�sk� vimrc s�bor: "

source: 3rd user vimrc file: "
sk: tret� u��vate�sk� vimrc s�bor: "

source: user exrc file: "
sk: u��vate�sk� exrc s�bor: "

source: 2nd user exrc file: "
sk: druh� u��vate�sk� exrc s�bor: "

source: fall-back for $VIM: "
sk: implicitn� hodnota $VIM:"

source: f-b for $VIMRUNTIME: "
sk: f-b pre $VIMRUNTIME: "

source: Compilation:
sk: Preklad:

source: Linking:
sk: Zlinkovan�:

source: DEBUG BUILD
sk: PODPORA LADENIA

source: version
sk: verzia

source: by Bram Moolenaar et al.
sk: od Brama Moolenaara a �al��ch

source: Vim is open source and freely distributable
sk: Vim je vo�ne ��rite�n� program s otvoren�m k�dom

source: Help poor children in Uganda!
sk: Pom��te chudobn�m de�om v Ugande!

source: type :help iccf<Enter> for information
sk: zadajte :help iccf<Enter> pre inform�cie

source: type :q<Enter> to exit
sk: zadajte :q<Enter> pre ukon�enie programu

source: type :help<Enter> or <F1> for on-line help
sk: zadajte :help<Enter> alebo <F1> pre pomocn�ka

source: type :help version7<Enter> for version info
sk: zadajte :help version7<Enter> pre inform�cie o verzii

source: Sponsor Vim development!
sk: Zasponzorujte v�voj Vimu!

source: Become a registered Vim user!
sk: Sta�te sa registrovan�m u��vate�om Vimu!

source: type :help sponsor<Enter> for information
sk: zadajte :help sponsor<Enter> pre inform�cie

source: type :help register<Enter> for information
sk: zadajte :help register<Enter> pre inform�cie

source: menu Help->Sponsor/Register for information
sk: bli��ie inform�cie v ponuke Pomocn�k->Sponzor/Registr�cia

source: Already only one window
sk: Existuje u� iba jedno okno

source: E441: There is no preview window
sk: E441: Nen�jden� �iadne okno n�h�adu

source: E442: Can't split topleft and botright at the same time
sk: E442: Okno sa ned� rozdeli� z�rove� v m�de 'vrchn�-�av�' a 'spodn�-prav�' ('topleft' a 'botright')

source: E443: Cannot rotate when another window is split
sk: E443: Ned� sa rotova�, ak je in� okno rozdelen�

source: E444: Cannot close last window
sk: E444: Posledn� okno sa ned� zatvori�

source: E445: Other window contains changes
sk: E445: In� okno obsahuje zmeny

source: E446: No file name under cursor
sk: E446: Pod kurzorom sa nenach�dza n�zov s�boru
