Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: internal error: unknown option type
pl: b³±d wewnêtrzny: nieznany typ opcji

source: [Location List]
ko: [��ġ ����]
pl: [Lista lokacji]

source: [Quickfix List]
ko: [Quickfix ����]
pl: [Lista quickfix]

source: E855: Autocommands caused command to abort
pl: E855: Autokomendy spowodowa³y porzucenie komendy

source: E82: Cannot allocate any buffer, exiting...
ko: E82: ���۸� �Ҵ��� �� ��� �����ϴ�...
pl: E82: Nie mogê zarezerwowaæ bufora; zakoñczenie...
zh_tw: E82: µLªk°t¸m¥ô¦ó½w½Ä°Ï¡AÂ÷¶}µ{¦¡...

source: E83: Cannot allocate buffer, using other one...
ko: E83: ���۸� �Ҵ��� �� ��� �ٸ� �� �����մϴ�...
pl: E83: Nie mogê zarezerwowaæ bufora; u¿ywam innego...
zh_tw: E83: µLªk°t¸m½w½Ä°Ï¡A¨Ï¥Î¥t¤@­Ó½w½Ä°Ï....

source: E515: No buffers were unloaded
ko: E515: ������ ���۰� �����ϴ�
pl: E515: Nie wy³adowano ¿adnego bufora
zh_tw: E515: ¨S¦³ÄÀ©ñ¥ô¦ó½w½Ä°Ï

source: E516: No buffers were deleted
ko: E516: ������ ���۰� �����ϴ�
pl: E516: Nie skasowano ¿adnego bufora
zh_tw: E516: ¨S¦³§R°£¥ô¦ó½w½Ä°Ï

source: E517: No buffers were wiped out
ko: E517: ������ ������ ���۰� �����ϴ�
pl: E517: Nie wyrzucono ¿adnego bufora
zh_tw: E517: ¨S¦³²M°£¥ô¦ó½w½Ä°Ï

source: 1 buffer unloaded
ko: ���� �� ���� ���������ϴ�
pl: 1 bufor wy³adowany
zh_tw: ¤wÄÀ©ñ¤@­Ó½w½Ä°Ï

source: %d buffers unloaded
ko: ���� %d ���� ���������ϴ�
pl: wy³adowano %d buforów
zh_tw: ¤wÄÀ©ñ %d ­Ó½w½Ä°Ï

source: 1 buffer deleted
ko: ���� �� ���� ���������ϴ�
pl: 1 bufor skasowany
zh_tw: ¤w§R°£¤@­Ó½w½Ä°Ï

source: %d buffers deleted
ko: ���� %d ���� ���������ϴ�
pl: %d buforów skasowano
zh_tw: ¤w§R°£ %d ­Ó½w½Ä°Ï

source: 1 buffer wiped out
ko: ���� �� ���� ������ ���������ϴ�
pl: wyrzucono 1 bufor
zh_tw: ¤w§R°£¤@­Ó½w½Ä°Ï

source: %d buffers wiped out
ko: ���� %d���� ������ ���������ϴ�
pl: wyrzucono %d buforów
zh_tw: ¤w§R°£ %d ­Ó½w½Ä°Ï

source: E90: Cannot unload last buffer
ko: E90: ������ ���۸� ���� �� �����ϴ�
pl: E90: Nie mogê wy³adowaæ ostatniego bufora
zh_tw: E90: µLªkÄÀ©ñ³Ì«á¤@­Ó½w½Ä°Ï

source: E84: No modified buffer found
ko: E84: �ٲ� ���۸� ã�� �� �����ϴ�
pl: E84: Nie znaleziono zmienionych buforów
zh_tw: E84: ¨S¦³­×§ï¹Lªº½w½Ä°Ï

source: E85: There is no listed buffer
ko: E85: ������ ���۰� �����ϴ�
pl: E85: Nie ma wylistowanych buforów
zh_tw: E85: ¨S¦³¦C¥Xªº½w½Ä°Ï

source: E86: Buffer %<PRId64> does not exist
ko: E86: ���� %<PRId64>��(��) �������� �ʽ��ϴ�
pl: E86: Bufor "%<PRId64>" nie istnieje
zh_tw: E86: ½w½Ä°Ï %<PRId64> ¤£¦s¦b

source: E87: Cannot go beyond last buffer
ko: E87: ������ �����Դϴ�
pl: E87: Nie mogê przej¶æ poza ostatni bufor
zh_tw: E87: µLªk¤Á´«¨ì§ó«á­±ªº½w½Ä°Ï

source: E88: Cannot go before first buffer
ko: E88: ù ��° �����Դϴ�
pl: E88: Nie mogê przej¶æ przed pierwszy bufor
zh_tw: E88: µLªk¤Á´«¨ì§ó«e­±ªº½w½Ä°Ï

source: E89: No write since last change for buffer %<PRId64> (add ! to override)
ko: E89: ���� %<PRId64>��(��) ���������� ��ģ �� �������� �ʾҽ��ϴ� (������� ! ���ϱ�)
pl: E89: Nie zapisano zmian w buforze %<PRId64> (wymu¶ przez !)
zh_tw: E89: ¤w§ó§ï¹L½w½Ä°Ï %<PRId64> ¦ý©|¥¼¦sÀÉ (¥i¥Î ! ±j¨î°õ¦æ)

source: W14: Warning: List of file names overflow
ko: W14: ����: ���� �̸� ������ ���ƽ��ϴ�
pl: W14: OSTRZE¯ENIE: Przepe³nienie listy nazw plików
zh_tw: W14: Äµ§i: ÀÉ¦W¹L¦h

source: E92: Buffer %<PRId64> not found
ko: E92: ���� %<PRId64>��(��) ã�� �� �����ϴ�
pl: E92: Nie znaleziono bufora %<PRId64>
zh_tw: E92: §ä¤£¨ì²Ä %<PRId64> ­Ó½w½Ä°Ï

source: E93: More than one match for %s
ko: E93: %s��(��) �ϳ� �̻� ã�ҽ��ϴ�
pl: E93: Wielokrotne dopasowania dla %s
zh_tw: E93: §ä¨ì¤@­Ó¥H¤Wªº %s

source: E94: No matching buffer for %s
ko: E94: %s�� �´� ���۰� �����ϴ�
pl: E94: ¯aden bufor nie pasuje do %s
zh_tw: E94: §ä¤£¨ì %s

source: line %<PRId64>
ko: %<PRId64> ��
pl: wiersz %<PRId64>
zh_tw: ¦æ %<PRId64>

source: E95: Buffer with this name already exists
ko: E95: �� �̸��� ���� ���۰� �̹� �ֽ��ϴ�
pl: E95: Bufor o tej nazwie ju¿ istnieje
zh_tw: E95: ¤w¦³½w½Ä°Ï¨Ï¥Î³o­Ó¦W¦r

source: [Modified]
ko: [�ٲ�]
pl: [Zmieniony]
zh_tw: [¤w­×§ï]

source: [Not edited]
ko: [��ġ�� �ʾ���]
pl: [Nie edytowany]
zh_tw: [¥¼½s¿è]

source: [New file]
pl: [Nowy Plik]
zh_tw: [·sÀÉ®×]

source: [Read errors]
ko: [�б� ����]
pl: [B³±d odczytu]
zh_tw: [Åª¨ú¿ù»~]

source: [readonly]
ko: [�б� ����]
pl: [tylko odczyt]
zh_tw: [°ßÅª]

source: 1 line --%d%%--
ko: 1 �� --%d%%--
pl: 1 wiersz --%d%%--
zh_tw: ¦æ¼Æ 1 --%d%%--

source: %<PRId64> lines --%d%%--
ko: %<PRId64> �� --%d%%--
pl: %<PRId64> wiersze --%d%%--
zh_tw: ¦æ¼Æ %<PRId64> --%d%%--

source: line %<PRId64> of %<PRId64> --%d%%-- col
ko: %<PRId64> / %<PRId64> �� --%d%%-- ĭ
pl: wiersz %<PRId64> z %<PRId64> --%d%%-- kol
zh_tw: ¦æ %<PRId64>/%<PRId64> --%d%%-- Äæ

source: [No Name]
pl: [Bez nazwy]

source: help
pl: pomoc
zh_tw: [»²§U»¡©ú]

source: [Help]
pl: [Pomoc]

source: [Preview]
pl: [Podgl±d]
zh_tw: [¹wÄý]

source: All
pl: Wszystko
zh_tw: ¥þ³¡

source: Bot
ko: �ٴ�
pl: Dó³
zh_tw: ©³ºÝ

source: Top
pl: Góra
zh_tw: ³»ºÝ

source: # Buffer list:
pl: # Lista buforów:
zh_tw: # ½w½Ä°Ï¦Cªí:

source: [Scratch]
pl: [Notka]

source: --- Signs ---
ko: --- ��ȣ ---
pl: --- Znaki ---
zh_tw: --- ²Å¸¹ ---

source: Signs for %s:
ko: %s�� ���� ��ȣ:
pl: Znaki dla %s:
zh_tw: %s ªº²Å¸¹:

source: line=%<PRId64> id=%d name=%s
ko: ��=%<PRId64> id=%d �̸�=%s
pl: wiersz=%<PRId64> id=%d nazwa=%s
zh_tw: ¦æ=%<PRId64> id=%d ¦WºÙ=%s

source: E545: Missing colon
ko: E545: �ݷ��� �����ϴ�
pl: E545: Brak dwukropka
zh_tw: E545: ¯Ê¤Ö colon

source: E546: Illegal mode
ko: E546: �̻��� ����
pl: E546: Niedozwolony tryb
zh_tw: E546: ¤£¥¿½Tªº¼Ò¦¡

source: E548: digit expected
ko: E548: ���ڰ� �ʿ��մϴ�
pl: E548: oczekiwa³em na cyfrê
zh_tw: E548: À³¸Ó­n¦³¼Æ¦r

source: E549: Illegal percentage
ko: E549: �̻��� ������
pl: E549: Niedozwolony procent
zh_tw: E549: ¤£¥¿½Tªº¦Ê¤À¤ñ

source: E96: Can not diff more than %<PRId64> buffers
ko: E96: %<PRId64>�� �̻��� ���ۿ� ���ؼ��� diff�� �� �� �����ϴ�
pl: E96: Nie mogê zró¿nicowaæ wiêcej ni¿ %<PRId64> buforów
zh_tw: E96: µLªk¤ñ¸û(diff) %<PRId64>­Ó¥H¤Wªº½w½Ä°Ï

source: E810: Cannot read or write temp files
ko: E810: �ӽ� ������ �аų� �� �� �����ϴ�
pl: E810: Nie mogê otworzyæ lub zapisaæ plików tymczasowych

source: E97: Cannot create diffs
ko: E97: diff�� ���� �� �����ϴ�
pl: E97: Nie mogê stworzyæ ró¿nic
zh_tw: E97: ¤£¯à«Ø¥ß

source: E816: Cannot read patch output
ko: E816: patch ������ ���� �� �����ϴ�
pl: E816: Nie mogê odczytaæ wyj¶cia pliku ³aty

source: E98: Cannot read diff output
ko: E98: diff ������ ���� �� �����ϴ�
pl: E98: Nie mogê wczytaæ wyj¶cia ró¿nicy
zh_tw: E98: µLªkÅª¨ú diff ªº¿é¥X

source: E99: Current buffer is not in diff mode
ko: E99: ���� ���۴� diff ���°� �ƴմϴ�
pl: E99: Bie¿±cy bufor nie jest w trybie ró¿nic
zh_tw: E99: ¥Ø«eªº½w½Ä°Ï¤£¬O¦b diff ¼Ò¦¡

source: E793: No other buffer in diff mode is modifiable
ko: E793: ���� ������ diff ���� ���۴� �����ϴ�
pl: E793: ¯aden inny bufor w trybie diff nie jest modyfikowalny

source: E100: No other buffer in diff mode
ko: E100: �ٸ� �����߿� diff ������ �� �����ϴ�
pl: E100: Brak innego bufora w trybie ró¿nic
zh_tw: E100: ¨S¦³½w½Ä°Ï¦b diff ¼Ò¦¡

source: E101: More than two buffers in diff mode, don't know which one to use
ko: E101: �ΰ� �̻��� ���۰� diff ���¿��� � ���� ������ �� �� �� �����ϴ�
pl: E101: Wiêcej ni¿ jeden bufor w trybie ró¿nicowania, nie wiem którego u¿yæ
zh_tw: E101: ¦³¨â­Ó¥H¤Wªº½w½Ä°Ï¦b diff ¼Ò¦¡¡AµLªk¨M©w­n¥Î­þ¤@­Ó

source: E102: Can't find buffer "%s"
ko: E102: "%s" ���۸� ã�� �� �����ϴ�
pl: E102: Nie mogê znale¼æ bufora "%s"
zh_tw: E102: §ä¤£¨ì½w½Ä°Ï: "%s"

source: E103: Buffer "%s" is not in diff mode
ko: E103: "%s" ���۴� diff ���°� �ƴմϴ�
pl: E103: Bufor "%s" nie jest w trybie ró¿nicowania
zh_tw: E103: ½w½Ä°Ï "%s" ¤£¬O¦b diff ¼Ò¦¡

source: E787: Buffer changed unexpectedly
ko: E787: ���۰� �𸣴� ���̿� �ٲ������ϴ�
pl: E787: Nieoczekiwana zmiana bufora

source: E104: Escape not allowed in digraph
ko: E104: digraph���� Escape�� �� �� �����ϴ�
pl: E104: Escape jest niedozwolone w dwugrafie
zh_tw: E104: ½Æ¦X¦r¤¸(digraph)¤¤¤£¯à¨Ï¥Î Escape

source: E544: Keymap file not found
ko: E544: Ű�� ������ ã�� �� �����ϴ�
pl: E544: Nie znaleziono pliku rozk³adu klawiszy
zh_tw: E544: §ä¤£¨ì keymap ÀÉ

source: E105: Using :loadkeymap not in a sourced file
ko: E105: �ҷ����� ���Ͽ��� :loadkeymap�� �������� �ʾҽ��ϴ�
pl: E105: Zastosowano :loadkeymap w niewczytanym pliku
zh_tw: E105: ¨Ï¥Î :loadkeymap

source: E791: Empty keymap entry
ko: E791: Ű�� ��Ʈ���� ��������
pl: E791: Pusty wpis keymap

source: Keyword completion (^N^P)
ko: ���� �ϼ� (^N^P)
pl: Dope³nianie s³ów kluczowych (^N^P)
zh_tw: ÃöÁä¦r¦Û°Ê§¹¦¨ (^N^P)

source: ^X mode (^]^D^E^F^I^K^L^N^O^Ps^U^V^Y)
ko: ^X ���� (^]^D^E^F^I^K^L^N^O^Ps^U^V^Y)
pl: ^X tryb (^]^D^E^F^I^K^L^N^O^Ps^U^V^Y)

source: Whole line completion (^L^N^P)
ko: ��ü �� �ϼ� (^L^N^P)
pl: Dope³nianie pe³nych wierszy (^L^N^P)
zh_tw: ¾ã¦æ¦Û°Ê§¹¦¨ (^L^N^P)

source: File name completion (^F^N^P)
ko: ���� �̸� �ϼ� (^F^N^P)
pl: Dope³nianie nazw plików (^F^N^P)
zh_tw: ÀÉ¦W¦Û°Ê§¹¦¨ (^F^N^P)

source: Tag completion (^]^N^P)
ko: �±� �ϼ� (^]^N^P)
pl: Dope³nianie znaczników (^]^N^P)
zh_tw: ¼ÐÅÒ¦Û°Ê§¹¦¨ (^]^N^P)

source: Path pattern completion (^N^P)
ko: ���� ���� �ϼ� (^N^P)
pl: Dope³nianie wzorców tropów (^N^P)
zh_tw: ¸ô®|¦Û°Ê§¹¦¨ (^N^P)

source: Definition completion (^D^N^P)
ko: ���� �ϼ� (^D^N^P)
pl: Dope³nianie definicji (^D^N^P)
zh_tw: ©w¸q¦Û°Ê§¹¦¨ (^D^N^P)

source: Dictionary completion (^K^N^P)
ko: Dictionary �ϼ� (^K^N^P)
pl: Dope³nianie ze s³owników (^K^N^P)
zh_tw: ¦r¨å¦Û°Ê§¹¦¨ (^K^N^P)

source: Thesaurus completion (^T^N^P)
ko: �������� �ϼ� (^T^N^P)
pl: Dope³nianie z tezaurusa (^T^N^P)
zh_tw: Thesaurus ¦Û°Ê§¹¦¨ (^T^N^P)

source: Command-line completion (^V^N^P)
ko: ������ �ϼ� (^V^N^P)
pl: Dope³nianie wiersza poleceñ (^V^N^P)
zh_tw: ©R¥O¦C¦Û°Ê§¹¦¨ (^V^N^P)

source: User defined completion (^U^N^P)
ko: ������ ���� �ϼ� (^U^N^P)
pl: Dope³nianie zdefiniowane przez u¿ytkownika (^U^N^P)

source: Omni completion (^O^N^P)
ko: Omni �ϼ� (^O^N^P)
pl: Omni uzupe³nianie (^O^N^P)

source: Spelling suggestion (s^N^P)
ko: �ܾ� ���� (s^N^P)
pl: Propozycja pisowni (^L^N^P)

source: Keyword Local completion (^N^P)
ko: ���� ���� �ϼ� (^N^P)
pl: Lokalne dope³nianie s³ów kluczowych (^N^P)
zh_tw: °Ï°ìÃöÁä¦r¦Û°Ê§¹¦¨ (^N^P)

source: Hit end of paragraph
pl: Dobi³em do koñca akapitu
zh_tw: ¤w¨ì¬q¸¨µ²§À

source: E839: Completion function changed window
ko: E839: Completion ������ â�� �ٲپ����ϴ�
pl: E839: Funkcja uzupe³niania zmieni³a okno

source: E840: Completion function deleted text
ko: E840: Completion ������ ���ڿ��� �������ϴ�
pl: E840: Funkcja uzupe³nania usunê³a tekst

source: 'dictionary' option is empty
ko: 'dictionary' �ɼ��� �������ϴ�
pl: opcja 'dictionary' jest pusta
zh_tw: ¿ï¶µ 'dictionary' ¥¼³]©w

source: 'thesaurus' option is empty
ko: 'thesaurus' �ɼ��� �������ϴ�
pl: opcja 'thesaurus' jest pusta
zh_tw: ¿ï¶µ 'thesaurus' ¥¼³]©w

source: Scanning dictionary: %s
ko: ���� ã�� ��: %s
pl: Przegl±dam s³ownik: %s
zh_tw: ±½ºË¦r¨å: %s

source: (insert) Scroll (^E/^Y)
ko: (�����ֱ�) ��ũ�� (^E/^Y)
pl: (wprowadzanie) Przewijanie (^E/^Y)
zh_tw: (´¡¤J) Scroll (^E/^Y)

source: (replace) Scroll (^E/^Y)
ko: (�ٲ�) ��ũ�� (^E/^Y)
pl: (zamiana) Przewijanie (^E/^Y)
zh_tw: (¨ú¥N) Scroll (^E/^Y)

source: Scanning: %s
ko: ã�� ��: %s
pl: Przegl±dam: %s
zh_tw: ±½ºË¤¤: %s

source: Scanning tags.
ko: �±� ã�� ��.
pl: Przegl±dam znaczniki.
zh_tw: ±½ºË¼ÐÅÒ.

source: Adding
ko: ���ϱ�
pl: Dodajê
zh_tw: ¼W¥[

source: -- Searching...
ko: -- ã�� ��...
pl: -- Szukam...
zh_tw: -- ·j´M¤¤...

source: Back at original
pl: Z powrotem na pierwotnym
zh_tw: ¦^¨ì°_ÂI

source: Word from other line
ko: �ٸ� �ٿ� ����
pl: Wyraz z innego wiersza
zh_tw: ±q§O¦æ¶}©lªº¦r (?)

source: The only match
pl: Jedyne dopasowanie
zh_tw: ¥u¦³¦¹¶µ²Å¦X

source: match %d of %d
pl: pasuje %d z %d
zh_tw: §ä¨ì %d / %d

source: match %d
pl: pasuje %d
zh_tw: ²Å¦X %d

source: E18: Unexpected characters in :let
ko: E18: ':let'�� �𸣴� ����
pl: E18: Nieoczekiwane znaki w :let

source: E684: list index out of range: %<PRId64>
ko: E684: ���� ��ȣ�� ������ ���: %<PRId64>
pl: E684: Indeks listy poza zakresem: %<PRId64>

source: E121: Undefined variable: %s
ko: E121: ���� �� �� ����: %s
pl: E121: Nieokre¶lona zmienna: %s
zh_tw: E121: ÅÜ¼Æ %s ©|¥¼©w¸q

source: E111: Missing ']'
ko: E111: ']'�� �����ϴ�
pl: E111: Brak ']'
zh_tw: E111: ¯Ê¤Ö¹ïÀ³ªº "]"

source: E686: Argument of %s must be a List
ko: E686: %s ���ڴ� List�̾��� �մϴ�
pl: E686: Argument %s musi byæ List±

source: E712: Argument of %s must be a List or Dictionary
ko: E712: %s ���ڴ� List Ȥ�� Dictionary���� �մϴ�
pl: E712: Argument %s musi byæ List± lub S³ownikiem

source: E713: Cannot use empty key for Dictionary
ko: E713: Dictionary�� �� Ű�� �� �� �����ϴ�
pl: E713: Nie mo¿na u¿yæ pustego klucza dla S³ownika

source: E714: List required
ko: E714: List�� �ʿ��մϴ�
pl: E714: wymagana Lista

source: E715: Dictionary required
ko: E715: Dictionary�� �ʿ��մϴ�
pl: E715: wymagany S³ownik

source: E118: Too many arguments for function: %s
ko: E118: �Լ��� �ʹ� ���� ���� �ѱ�: %s
pl: E118: Zbyt wiele argumentów dla funkcji: %s
zh_tw: E118: ¨ç¦¡ %s ªº¤Þ¼Æ¹L¦h

source: E716: Key not present in Dictionary: %s
ko: E716: Dictionary�� Ű�� ����: %s
pl: E716: Klucz nie istnieje w S³owniku: %s

source: E122: Function %s already exists, add ! to replace it
ko: E122: �Լ� %s��(��) �̹� �ֽ��ϴ�, �ٲٷ��� !�� ���ϼ���
pl: E122: Funkcja %s ju¿ istnieje; aby j± zamieniæ u¿yj !
zh_tw: E122: ¨ç¦¡ %s ¤w¸g¦s¦b, ½Ð¨Ï¥Î ! ±j¨î¨ú¥N

source: E717: Dictionary entry already exists
ko: E717: �̹� Dictionary �׸��� �ֽ��ϴ�
pl: E717: istnieje ju¿ taki element S³ownika

source: E718: Funcref required
ko: E718: Funcref�� �ʿ��մϴ�
pl: E718: wymagana Funcref

source: E719: Cannot use [:] with a Dictionary
ko: E719: Dictionary�� [:]�� ������ �� �����ϴ�
pl: E719: Nie mo¿na u¿yæ [:] przy S³owniku

source: E734: Wrong variable type for %s=
ko: E734: %s=�� ���� �߸��� ������
pl: E734: Z³y typ zmiennej dla %s=

source: E130: Unknown function: %s
ko: E130: �𸣴� �Լ�: %s
pl: E130: Nieznana funkcja: %s

source: E461: Illegal variable name: %s
ko: E461: ���������� ���� ��: %s
pl: E461: Niedozwolona nazwa zmiennej: %s
zh_tw: E461: ¤£¦XªkªºÅÜ¼Æ¦WºÙ: %s

source: E806: using Float as a String
ko: E806: Float�� String���� ����
pl: E806: U¿ycie Zmiennoprzecinkowej jako £añcucha

source: E687: Less targets than List items
ko: E687: List �׸񺸴� ���� ����
pl: E687: Mniej celów ni¿ elementów Listy

source: E688: More targets than List items
ko: E688: List �׸񺸴� ���� ����
pl: E688: Wiêcej celów ni¿ elementów Listy

source: Double ; in list of variables
ko: ���� ���Ͽ� �ߺ��� ;
pl: Podwójny ; w li¶cie zmiennych

source: E738: Can't list variables for %s
ko: E738: %s ���� ������ ������ �� �����ϴ�
pl: E738: Nie mogê wypisaæ zmiennych dla %s

source: E689: Can only index a List or Dictionary
ko: E689: List�� Dictionary�� ������ �� �ֽ��ϴ�
pl: E689: Indeks mo¿e istnieæ tylko dla Listy lub S³ownika

source: E708: [:] must come last
ko: E708: [:]�� ���򸷿� ��ġ�ؾ� �մϴ�
pl: E708: [:] musi byæ ostatnie

source: E709: [:] requires a List value
ko: E709: [:]�� List ���� �ʿ��մϴ�
pl: E709: [:] wymaga warto¶ci listy

source: E710: List value has more items than target
ko: E710: List ���� ���󺸴� ���� �׸��� ������ �ֽ��ϴ�
pl: E710: Lista ma wiêcej elementów ni¿ cel

source: E711: List value has not enough items
ko: E711: List ���� ������ �׸��� ������ ���� �ʽ��ϴ�
pl: E711: Lista nie ma wystarczaj±cej ilo¶ci elementów

source: E690: Missing "in" after :for
ko: E690: :for �ڿ� "in"�� �����ϴ�
pl: E690: Brak "in" po :for

source: E107: Missing parentheses: %s
ko: E107: ��ȣ ����: %s
pl: E107: Brak nawiasów: %s
zh_tw: E107: ¯Ê¤Ö¹ïÀ³ªº¬A¸¹: %s

source: E108: No such variable: "%s"
ko: E108: �̷� ���� ����: "%s"
pl: E108: Nie istnieje zmienna: "%s"
zh_tw: E108: µL¦¹ÅÜ¼Æ: "%s"

source: E743: variable nested too deep for (un)lock
ko: E743: ����(����)�ϱ⿡ ������ �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E743: zmienna zagnie¿d¿ona zbyt g³êboko dla (un)lock

source: E109: Missing ':' after '?'
ko: E109: '?' �ڿ� ':'�� �����ϴ�
pl: E109: Brak ':' po '?'
zh_tw: E109: '?' «á¯Ê¤Ö ':'

source: E691: Can only compare List with List
ko: E691: List�� List�͸� ������ �� �ֽ��ϴ�
pl: E691: Listê mogê porównaæ tylko z List±

source: E692: Invalid operation for Lists
ko: E692: List�� ���� �߸��� ����
pl: E692: Nieprawid³owa operacja dla Listy

source: E735: Can only compare Dictionary with Dictionary
ko: E735: Dictionary�� Dictionary�͸� ������ �� �ֽ��ϴ�
pl: E735: S³ownik mogê porównaæ tylko ze S³ownikiem

source: E736: Invalid operation for Dictionary
ko: E736: Dictionary�� ���� �߸��� ����
pl: E736: Nieprawid³owa operacja dla S³ownika

source: E693: Can only compare Funcref with Funcref
ko: E693: Funcref�� Funcref�͸� ������ �� �ֽ��ϴ�
pl: E693: Funcref mogê porównaæ tylko z Funcref

source: E694: Invalid operation for Funcrefs
ko: E694: Funcrefs�� ���� �߸��� ����
pl: E694: Nieprawid³owa operacja dla Funcref

source: E804: Cannot use '%' with Float
ko: E804: Float�� '%'�� ������ �� �����ϴ�
pl: E804: Nie mogê u¿yæ '%' w Zmiennoprzecinkowej

source: E110: Missing ')'
ko: E110: ')'�� �����ϴ�
pl: E110: Brak ')'
zh_tw: E110: ¯Ê¤Ö¹ïÀ³ªº ")"

source: E695: Cannot index a Funcref
ko: E695: Funcref�� ������ �� �����ϴ�
pl: E695: Nie mo¿na zindeksowaæ Funcref

source: E112: Option name missing: %s
ko: E112: �ɼ� �̸� ����: %s
pl: E112: Brak nazwy opcji: %s
zh_tw: E112: ¯Ê¤Ö¿ï¶µ¦WºÙ: %s

source: E113: Unknown option: %s
ko: E113: �𸣴� �ɼ�: %s
pl: E113: Nieznana opcja: %s
zh_tw: E113: ¤£¥¿½Tªº¿ï¶µ: %s

source: E114: Missing quote: %s
ko: E114: ����ǥ ����: %s
pl: E114: Brak cudzys³owu: %s
zh_tw: E114: ¯Ê¤Ö¤Þ¸¹: %s

source: E115: Missing quote: %s
ko: E115: ����ǥ ����: %s
pl: E115: Brak cudzys³owu: %s
zh_tw: E115: ¯Ê¤Ö¤Þ¸¹: %s

source: E696: Missing comma in List: %s
ko: E696: List�� �޸� ����: %s
pl: E696: Brakuj±cy przecinek w Li¶cie: '%s

source: E697: Missing end of List ']': %s
ko: E697: List ���� ']' ����: %s
pl: E697: Brak zakoñczenia Listy ']': %s

source: E720: Missing colon in Dictionary: %s
ko: E720: Dictionary�� �ݷ� ����: %s
pl: E720: Brak dwukropka w S³owniku: %s

source: E721: Duplicate key in Dictionary: "%s"
ko: E721: Dictionary�� �ߺ��� Ű: "%s"
pl: E721: Powtórzony klucz w S³owniku: "%s"

source: E722: Missing comma in Dictionary: %s
ko: E722: Dictionary�� �޸� ����: %s
pl: E722: Brakuj±cy przecinek w S³owniku: %s

source: E723: Missing end of Dictionary '}': %s
ko: E723: Dictionary ���� '}' ����: %s
pl: E723: Brak koñca w S³owniku '}': %s

source: E724: variable nested too deep for displaying
ko: E724: ������ ǥ���ϱ⿡ �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E724: Zmienna zagnie¿d¿ona zbyt g³êboko by pokazaæ

source: E740: Too many arguments for function %s
ko: E740: �Լ� %s�� �ʹ� ���� ���ڰ� ���޵Ǿ����ϴ�
pl: E740: Zbyt wiele argumentów dla funkcji %s

source: E116: Invalid arguments for function %s
ko: E116: �Լ� %s(��)�� �߸��� ���ڰ� �Ѱ������ϴ�
pl: E116: Zbyt wiele argumentów dla funkcji %s
zh_tw: E116: ¨ç¦¡ %s ªº¤Þ¼Æ¤£¥¿½T

source: E117: Unknown function: %s
ko: E117: �𸣴� �Լ�: %s
pl: E117: Nieznana funkcja: %s
zh_tw: E117: ¥¼©w¸qªº¨ç¦¡: %s

source: E119: Not enough arguments for function: %s
ko: E119: �Լ��� ���� ���� �ѱ�: %s
pl: E119: Za ma³o argumentów dla funkcji: %s
zh_tw: E119: ¨ç¦¡ %s ªº¤Þ¼Æ¤Ó¤Ö

source: E120: Using <SID> not in a script context: %s
ko: E120: ��ũ��Ʈ ���ؽ�Ʈ �ۿ��� <SID> ����: %s
pl: E120: U¿ycie <SID> poza kontekstem skryptu: %s
zh_tw: E120: <SID> ¤£¯à¦b script ¥»¤å¥~¨Ï¥Î: %s

source: E725: Calling dict function without Dictionary: %s
ko: E725: Dictionary���� �����Լ��� �ҷ���: %s
pl: E725: Wywo³anie funkcji "dict" bez S³ownika: %s

source: E808: Number or Float required
ko: E808: Number Ȥ�� Float�� �ʿ��մϴ�
pl: E808: Wymagana Liczba lub Zmiennoprzecinkowa

source: add() argument
pl: argument add()

source: E699: Too many arguments
ko: E699: �ʹ� ���� ����
pl: E699: Za du¿o argumentów

source: E785: complete() can only be used in Insert mode
ko: E785: complete()�� �Է� ���忡���� ������ �� �ֽ��ϴ�
pl: E785: complete() mo¿e byæ u¿yte tylko w trybie Wprowadzania

source: E737: Key already exists: %s
ko: E737: Ű�� �̹� ������: %s
pl: E737: Klucz ju¿ istnieje: %s

source: extend() argument
pl: argument extend()

source: map() argument
pl: argument map()

source: filter() argument
pl: argument filter()

source: +-%s%3ld lines:
ko: +-%s%3ld ��:
pl: +-%s%3ld wierszy:
zh_tw: +-%s%3ld ¦æ:

source: E700: Unknown function: %s
ko: E700: �𸣴� �Լ�: %s
pl: E700: Nieznana funkcja: %s

source: called inputrestore() more often than inputsave()
ko: inputrestore()�� inputsave()���� ���� �ҷ������ϴ�
pl: wywo³ano inputrestore() wiêcej razy ni¿ inputsave()
zh_tw: ©I¥s inputrestore() ªº¦¸¼Æ¤ñ inputsave() ÁÙ¦h

source: insert() argument
pl: argument insert()

source: E786: Range not allowed
ko: E786: ������ �������� �ʽ��ϴ�
pl: E786: Zakres niedozwolony

source: E701: Invalid type for len()
ko: E701: len()�� �߸��� ��
pl: E701: Nieprawid³owy typ dla len()

source: E726: Stride is zero
ko: E726: Stride�� 0
pl: E726: Skok to zero

source: E727: Start past end
ko: E727: ������ġ�� ���� ����ħ
pl: E727: Pocz±tek po koñcu

source: <empty>
pl: <pusty>

source: remove() argument
pl: argument remove()

source: E655: Too many symbolic links (cycle?)
ko: E655: �ʹ� ���� �ɺ��� ��ũ (�ݺ���ȯ?)
pl: E655: Za du¿o dowi±zañ symbolicznych (pêtla?)
zh_tw: E655: ¤Ó¦h¼hªº²Å¸¹Ãìµ²(symlink) (´`Àô?)

source: reverse() argument
pl: argument reverse()

source: sort() argument
pl: argument sort()

source: E702: Sort compare function failed
ko: E702: ���� ���� ������ �����߽��ϴ�
pl: E702: Funkcja porównywania w sort nie powiod³a siê

source: (Invalid)
ko: (�߸��Ǿ����ϴ�)
pl: (Niew³a¶ciwe)
zh_tw: (¤£¥¿½T)

source: E677: Error writing temp file
ko: E677: �ӽ� ���� ���� ����
pl: E677: B³±d zapisywania pliku tymczasowego

source: E805: Using a Float as a Number
ko: E805: Float�� Number�� ����
pl: E805: U¿ycie Zmiennoprzecinkowej jako Liczby

source: E703: Using a Funcref as a Number
ko: E703: Funcref�� Number�� ����
pl: E703: U¿ycie Funcref jako Liczby

source: E745: Using a List as a Number
ko: E745: List�� Number�� ����
pl: E745: U¿ycie Listy jako Liczby

source: E728: Using a Dictionary as a Number
ko: E728: Dictionary�� Number�� ����
pl: E728: U¿ycie S³ownika jako Liczby

source: E729: using Funcref as a String
ko: E729: Funcref�� String���� ����
pl: E729: U¿ycie Funcref jako £añcucha

source: E730: using List as a String
ko: E730: List�� String���� ����
pl: E730: U¿ycie Listy jako £añcucha

source: E731: using Dictionary as a String
ko: E731: Dictionary�� String���� ����
pl: E731: U¿ycie S³ownika jako £añcucha

source: E706: Variable type mismatch for: %s
ko: E706: ���� �� �ٸ�: %s
pl: E706: Nieprawid³owy typ zmiennej dla: %s

source: E795: Cannot delete variable %s
ko: E795: ���� %s�� ������ �� �����ϴ�
pl: E795: Nie mogê usun±æ zmiennej %s

source: E704: Funcref variable name must start with a capital: %s
ko: E704: Funcref �������� �빮�ڷ� �����ؾ� ��: %s
pl: E704: Nazwa Funcref musi siê zaczynaæ wielk± liter±: %s

source: E705: Variable name conflicts with existing function: %s
ko: E705: �������� �̹� �ִ� �Լ����� �浹: %s
pl: E705: Nazwa zmiennej jest w konflikcie z istniej±c± funkcj±: %s

source: E741: Value is locked: %s
ko: E741: ���� ��������: %s
pl: E741: Warto¶æ jest zablokowana: %s

source: Unknown
pl: Nieznane
zh_tw: ¥¼ª¾

source: E742: Cannot change value of %s
ko: E742: %s ���� �ٲ� �� �����ϴ�
pl: E742: Nie mogê zmieniæ warto¶ci %s

source: E698: variable nested too deep for making a copy
ko: E698: �����ϱ⿡ ������ �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E698: Zmienna zagnie¿d¿ona zbyt g³êboko by zrobiæ kopiê

source: E123: Undefined function: %s
ko: E123: ���� �� �� �Լ�: %s
pl: E123: Nieznana funkcja: %s
zh_tw: E123: ¨ç¦¡ %s ©|¥¼©w¸q

source: E124: Missing '(': %s
ko: E124: '('�� ����: %s
pl: E124: Brak '(': %s
zh_tw: E124: ¯Ê¤Ö "(": %s

source: E862: Cannot use g: here
pl: E862: Nie mo¿na tutaj u¿yæ g:

source: E125: Illegal argument: %s
ko: E125: �߸��� ����: %s
pl: E125: Niedozwolony argument: %s
zh_tw: E125: °Ñ¼Æ¤£¥¿½T: %s

source: E853: Duplicate argument name: %s
pl: E853: Powtórzona nazwa argumentu: %s
