Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: E328: Menu only exists in another mode
ko: E328: �޴��� �ٸ� ���忡���� �����մϴ�
pl: E328: Menu istnieje tylko w innym trybie
zh_tw: E328: ¿ï³æ¥u¯à¦b¨ä¥¦¼Ò¦¡¤¤¨Ï¥Î

source: E329: No menu "%s"
ko: E329: "%s" �޴� ����
pl: E329: Nie ma menu "%s"

source: E792: Empty menu name
ko: E792: �޴� �̸� ����
pl: E792: Pusta nazwa menu

source: E330: Menu path must not lead to a sub-menu
ko: E330: ���� �޴� �տ��� �޴� ���ΰ� ���� �� �����ϴ�
pl: E330: Trop menu nie mo¿e prowadziæ do podmenu
zh_tw: E330: ¿ï³æ¸ô®|¤£¯à«ü¦V¤l¿ï³æ

source: E331: Must not add menu items directly to menu bar
ko: E331: �޴��ٿ� ���ٷ� �޴� �׸��� ���� ���� �����ϴ�
pl: E331: Nie wolno dodawaæ punktów menu wprost do paska menu
zh_tw: E331: ¤£¯àª½±µ§â¿ï¶µ¥[¨ì¿ï³æ¦C¤¤

source: E332: Separator cannot be part of a menu path
ko: E332: �����ڴ� �޴� ������ �κ��� �� �� �����ϴ�
pl: E332: Separator nie mo¿e byæ czê¶ci± tropu menu
zh_tw: E332: ¤À¹j½u¤£¯à¬O¿ï³æ¸ô®|ªº¤@³¡¥÷

source: --- Menus ---
pl: --- Menu ---
zh_tw: --- ¿ï³æ ---

source: E333: Menu path must lead to a menu item
ko: E333: �޴� �׸� �տ��� �޴� ���ΰ� �־��� �մϴ�
pl: E333: Trop menu musi prowadziæ do punktu menu
zh_tw: E333: ¿ï³æ¸ô®|¥²»Ý«ü¦V¤@­Ó¿ï¶µ

source: E334: Menu not found: %s
ko: E334: �޴��� ã�� �� �����ϴ�: %s
pl: E334: Nie znaleziono menu: %s
zh_tw: E334: [¿ï³æ] §ä¤£¨ì %s

source: E335: Menu not defined for %s mode
ko: E335: %s ���忡 ���� �޴��� ���ǵǾ� ���� �ʽ��ϴ�
pl: E335: Menu nie jest zdefiniowane dla trybu %s
zh_tw: E335: %s ¼Ò¦¡¥¼©w¸q¿ï³æ

source: E336: Menu path must lead to a sub-menu
ko: E336: ���� �޴� �տ� �޴� ���ΰ� �־��� �մϴ�
pl: E336: Trop menu musi prowadziæ do podmenu
zh_tw: E336: ¿ï³æ¸ô®|¥²»Ý«ü¦V¤l¿ï³æ

source: E337: Menu not found - check menu names
ko: E337: �޴��� ã�� �� ���� - �޴� �̸��� Ȯ���Ͻʽÿ�
pl: E337: Nie znaleziono menu - sprawd¼ nazwy menu
zh_tw: E337: §ä¤£¨ì¿ï³æ - ½ÐÀË¬d¿ï³æ¦WºÙ

source: Error detected while processing %s:
ko: %s ������ ���� �߰�:
pl: Wykryto b³±d podczas przetwarzania %s:
zh_tw: ³B²z %s ®Éµo¥Í¿ù»~:

source: line %4ld:
ko: %4ld ��:
pl: wiersz %4ld:
zh_tw: ¦æ %4ld:

source: E354: Invalid register name: '%s'
ko: E354: �߸��� �������� �̸�: '%s'
pl: E354: Niew³a¶ciwa nazwa rejestru: '%s'
zh_tw: E354: ¼È¦s¾¹¦WºÙ¿ù»~: '%s'

source: Messages maintainer: Bram Moolenaar <Bram@vim.org>
ko: �޽��� ������: Bram Moolenaar <Bram@vim.org>
pl: Opiekun komunikatów: Miko³aj Machowski <mikmach@wp.pl>
zh_tw: ¥¿Åé¤¤¤å°T®§ºûÅ@ªÌ: Francis S.Lin <piaip@csie.ntu.edu.tw>, Cecil Sheng <b7506022@csie.ntu.edu.tw>

source: Interrupt:
ko: �ߴ�:
pl: Przerwanie:
zh_tw: ¤w¤¤Â_:

source: Press ENTER or type command to continue
ko: �����Ϸ��� ���� Ȥ�� ������ �Է��Ͻʽÿ�
pl: Naci¶nij ENTER lub wprowad¼ komendê aby kontynuowaæ

source: %s line %<PRId64>
ko: %s �� %<PRId64>
pl: %s wiersz %<PRId64>

source: -- More --
pl: -- Wiêcej --

source: SPACE/d/j: screen/page/line down, b/u/k: up, q: quit
ko: SPACE/d/j: ȭ��/������/���� �Ʒ���, b/u/k: ����, q: ����
pl: SPACE/d/j: ekran/strona/wiersz w dó³, b/u/k: do góry, q: zakoñcz

source: Question
pl: Pytanie
zh_tw: °ÝÃD

source: &Yes &No
ko: ��(&Y) �ƴϿ�(&N)
pl: &Tak &Nie
zh_tw: &Y¬O &N§_

source: &Yes &No &Cancel
ko: ��(&Y) �ƴϿ�(&N) ����(&C)
pl: &Tak &Nie &Zakoñcz
zh_tw: &Y¬O &N§_ &C¨ú®ø

source: &Yes &No Save &All &Discard All &Cancel
ko: ��(&Y) �ƴϿ�(&N) ���� ����(&A) ���� ����(&D) ����(&C)
pl: &Tak &Nie Zapisz &wszystkie &Odrzuæ wszystkie &Zakoñcz
zh_tw: &Y¬O &N§_ &A¥þ³¡¦sÀÉ &D¥þ³¡¤£¦s &C¨ú®ø

source: E766: Insufficient arguments for printf()
ko: E766: printf()�� �Ѿ��� ���� ������ ����
pl: E766: Za ma³o argumentów dla printf()

source: E807: Expected Float argument for printf()
ko: E807: printf()�� �������� Float ����
pl: E807: Spodziewany argument Zmiennoprzecinkowy w printf()

source: E767: Too many arguments to printf()
ko: E767: printf()�� �ʹ� ���� ���� �Ѿ���
pl: E767: Za du¿o argumentów dla printf()

source: W10: Warning: Changing a readonly file
ko: W10: ����: �б� ���� ������ ��ġ�� �ֽ��ϴ�
pl: W10: OSTRZE¯ENIE: Zmiany w pliku tylko do odczytu
zh_tw: W10: ª`·N: §A¥¿¦b­×§ï¤@­Ó°ßÅªÀÉ

source: Type number and <Enter> or click with mouse (empty cancels):
ko: ���� �Է��� <����>�� ���콺 Ŭ�� (���ھ����� ����):
pl: Wpisz numer i <Enter> lub wybierz mysz± (pusta warto¶æ anuluje):

source: Type number and <Enter> (empty cancels):
ko: ���� �Է��� <����> (���ھ����� ����):
pl: Wpisz numer i <Enter> (puste anuluje):

source: 1 more line
pl: 1 wiersz wiêcej
zh_tw: ÁÙ¦³¤@¦æ

source: 1 line less
pl: 1 wiersz mniej
zh_tw: ¤Ö©ó¤@¦æ

source: %<PRId64> more lines
ko: %<PRId64> ���� ���� ��
pl: dodano %<PRId64> wierszy
zh_tw: ÁÙ¦³ %<PRId64> ¦æ

source: %<PRId64> fewer lines
ko: %<PRId64> ���� ���� ��
pl: usuniêto %<PRId64> wierszy
zh_tw: ¥u³Ñ %<PRId64> ¦æ

source: (Interrupted)
ko: (�ߴܵǾ����ϴ�)
pl: (Przerwane)
zh_tw: (¤w¤¤Â_)

source: Beep!
pl: Biiip!

source: Calling shell to execute: "%s"
ko: �����Ϸ��� �� �θ�: "%s"
pl: Wywo³ujê pow³okê do wykonania: "%s"
zh_tw: ©I¥s shell °õ¦æ: "%s"

source: E349: No identifier under cursor
ko: E349: Ŀ�� �ؿ� �ĺ��ڰ� �����ϴ�
pl: E349: Brak identyfikatora pod kursorem
zh_tw: E349: ´å¼Ð³B¨S¦³ÃÑ§O¦r

source: E774: 'operatorfunc' is empty
ko: E774: 'operatorfunc'�� �����ֽ��ϴ�
pl: E774: 'operatorfunc' jest pusta

source: Warning: terminal cannot highlight
ko: ����: �͹̳��� ������ ���¸� ǥ���� �� �����ϴ�
pl: OSTRZE¯ENIE: terminal nie wykonuje pod¶wietlania
zh_tw: ª`·N: §Aªº²×ºÝ¾÷µLªkÅã¥Ü°ª«G«×

source: E348: No string under cursor
ko: E348: Ŀ�� �ؿ� ���ڿ��� �����ϴ�
pl: E348: Brak ci±gu pod kursorem
zh_tw: E348: ´å¼Ð³B¨S¦³¦r¦ê

source: E352: Cannot erase folds with current 'foldmethod'
ko: E352: ������ 'foldmethod'���� ���⸦ ���� �� �����ϴ�
pl: E352: Nie mogê skasowaæ zwiniêcia z bie¿±c± 'foldmethod'
zh_tw: E352: µLªk¦b¥Ø«eªº 'foldmethod' ¤U§R°£ fold

source: E664: changelist is empty
ko: E664: changelist�� �������ϴ�
pl: E664: lista zmian (changelist) jest pusta
zh_tw: E664: ÅÜ§ó¦Cªí¬OªÅªº

source: E662: At start of changelist
pl: E662: Na pocz±tku listy zmian
zh_tw: E662: ¤w¦bÅÜ§ó¦Cªíªº¶}ÀY

source: E663: At end of changelist
pl: E663: Na koñcu listy zmian
zh_tw: E663: ¤w¦bÅÜ§ó¦Cªíªºµ²§À

source: Type :quit<Enter> to exit Vim
ko: VIM�� ��ġ���� :quit<Enter> �Է�
pl: wprowad¼ :quit<Enter> zakoñczenie programu
zh_tw: ­nÂ÷¶} Vim ½Ð¿é¤J :quit<Enter>

source: 1 line %sed 1 time
pl: 1 wiersz %sed 1 raz
zh_tw: ¤@¦æ %s ¹L ¤@¦¸

source: 1 line %sed %d times
pl: 1 wiersz %sed %d razy
zh_tw: ¤@¦æ %s ¹L %d ¦¸

source: %<PRId64> lines %sed 1 time
pl: %<PRId64> wierszy %sed 1 raz
zh_tw: %<PRId64> ¦æ %s ¹L ¤@¦¸

source: %<PRId64> lines %sed %d times
pl: %<PRId64> wierszy %sed %d razy
zh_tw: %<PRId64> ¦æ %s ¹L %d ¦¸

source: %<PRId64> lines to indent...
pl: %<PRId64> wierszy do wciêcia...
zh_tw: ÁY±Æ %<PRId64> ¦æ...

source: 1 line indented
pl: 1 wiersz wciêty
zh_tw: ¤@¦æ¤wÁY±Æ

source: %<PRId64> lines indented
pl: %<PRId64> wierszy wciêtych
zh_tw: ¤wÁY±Æ %<PRId64> ¦æ

source: E748: No previously used register
pl: E748: Brak poprzednio u¿ytego rejestru

source: cannot yank; delete anyway
pl: nie mogê skopiowaæ, mimo to kasujê
zh_tw: µLªk°Å¤U; ª½±µ§R°£

source: 1 line changed
pl: 1 wiersz zmieniono
zh_tw: 1 ¦æ ~ed

source: %<PRId64> lines changed
pl: %<PRId64> wierszy zmieniono
zh_tw: ¤w§ïÅÜ %<PRId64> ¦æ

source: block of 1 line yanked
pl: skopiowano blok 1 wiersza

source: 1 line yanked
pl: 1 wiersz skopiowano
zh_tw: ¤w½Æ»s 1 ¦æ

source: block of %<PRId64> lines yanked
pl: %<PRId64> wierszy skopiowanych

source: %<PRId64> lines yanked
pl: %<PRId64> wierszy skopiowanych
zh_tw: ¤w½Æ»s %<PRId64> ¦æ

source: E353: Nothing in register %s
ko: E353: %s �������Ϳ� �ƹ� �͵� �����ϴ�
pl: E353: Pusty rejestr %s
zh_tw: E353: ¼È¦s¾¹ %s ¸Ì¨S¦³ªF¦è

source: --- Registers ---
pl: --- Rejestry ---
zh_tw: --- ¼È¦s¾¹ ---

source: Illegal register name
pl: Niedozwolona nazwa rejestru
zh_tw: ¤£¥¿½Tªº¼È¦s¾¹¦WºÙ

source: # Registers:
pl: # Rejestry:
zh_tw: # ¼È¦s¾¹:

source: E574: Unknown register type %d
ko: E574: �𸣴� �������� ���� %d
pl: E574: Nieznany typ rejestru %d
zh_tw: E574: ¥¼ª¾ªºµù¥U«¬ºA: %d

source: %<PRId64> Cols;
ko: %<PRId64> ��;
pl: %<PRId64> Kolumn;
zh_tw: %<PRId64> Äæ;

source: Selected %s%<PRId64> of %<PRId64> Lines; %<PRId64> of %<PRId64> Words; %<PRId64> of %<PRId64> Bytes
ko: Selected %s%<PRId64> of %<PRId64> ����; %<PRId64> of %<PRId64> �ܾ�; %<PRId64> of %<PRId64> ����Ʈ
pl: Wybrano %s%<PRId64> z %<PRId64> Wierszy; %<PRId64> z %<PRId64> S³ów; %<PRId64> z %<PRId64> Bajtów
zh_tw: ¿ï¾Ü¤F %s%<PRId64>/%<PRId64> ¦æ; %<PRId64>/%<PRId64> ¦r(Word); %<PRId64>/%<PRId64> ¦r¤¸(Bytes)

source: Selected %s%<PRId64> of %<PRId64> Lines; %<PRId64> of %<PRId64> Words; %<PRId64> of %<PRId64> Chars; %<PRId64> of %<PRId64> Bytes
ko: Selected %s%<PRId64> of %<PRId64> ����; %<PRId64> of %<PRId64> �ܾ�; %<PRId64> of %<PRId64> ����; %<PRId64> of %<PRId64> ����Ʈ
pl: Wybrano %s%<PRId64> z %<PRId64> Wierszy; %<PRId64> z %<PRId64> S³ów; %<PRId64> z %<PRId64> Znaków; %<PRId64> z %<PRId64> Bajtów

source: Col %s of %s; Line %<PRId64> of %<PRId64>; Word %<PRId64> of %<PRId64>; Byte %<PRId64> of %<PRId64>
ko: Col %s of %s; ���� %<PRId64> of %<PRId64>; �ܾ� %<PRId64> of %<PRId64>; ����Ʈ %<PRId64> of %<PRId64>
pl: Kol %s z %s; Wiersz %<PRId64> z %<PRId64>; S³owo %<PRId64> z %<PRId64>; Bajt %<PRId64> z %<PRId64>
zh_tw: Äæ %s/%s; ¦æ %<PRId64>/%<PRId64>; ¦r(Word) %<PRId64>/%<PRId64>; ¦r¤¸(Byte) %<PRId64>/%<PRId64>

source: Col %s of %s; Line %<PRId64> of %<PRId64>; Word %<PRId64> of %<PRId64>; Char %<PRId64> of %<PRId64>; Byte %<PRId64> of %<PRId64>
ko: Col %s of %s; ���� %<PRId64> of %<PRId64>; �ܾ� %<PRId64> of %<PRId64>; ���� %<PRId64> of %<PRId64>; ����Ʈ %<PRId64> of %<PRId64>
pl: Kol %s z %s; Wiersz %<PRId64> z %<PRId64>; S³owo %<PRId64> z %<PRId64>; Znak %<PRId64> z %<PRId64>; Bajt %<PRId64> z %<PRId64>

source: (+%<PRId64> for BOM)
pl: (+%<PRId64> dla BOM)

source: %<%f%h%m%=Page %N
ko: %<%f%h%m%=������ %N
pl: %<%f%h%m%=Strona %N
zh_tw: %<%f%h%m%=²Ä %N ­¶

source: Thanks for flying Vim
ko: ���� ���� �� �ּż� ����ϴ�
pl: Dziêki za lot Vimem
zh_tw: ·PÁÂ±z·R¥Î Vim

source: E518: Unknown option
ko: E518: �𸣴� �ɼ�
pl: E518: Nieznana opcja
zh_tw: E518: ¤£¥¿½Tªº¿ï¶µ

source: E519: Option not supported
ko: E519: �������� �ʴ� �ɼ��Դϴ�
pl: E519: Opcja nie jest wspomagana
zh_tw: E519: ¤£¤ä´©¸Ó¿ï¶µ

source: E520: Not allowed in a modeline
ko: E520: �������ο��� ������ �� �����ϴ�
pl: E520: Niedozwolone w modeline
zh_tw: E520: ¤£¯à¦b Modeline ¸Ì¥X²{

source: E846: Key code not set
pl: E846: Kod klucza nie jest ustawiony

source: E521: Number required after =
ko: E521: = �ڿ� ���ڰ� �ʿ��մϴ�
pl: E521: Po = wymagany jest numer
zh_tw: E521: = «á»Ý­n¦³¼Æ¦r

source: E522: Not found in termcap
ko: E522: termcap���� ã�� �� �����ϴ�
pl: E522: Nie znaleziono w termcap
zh_tw: E522: Termcap ¸Ì­±§ä¤£¨ì

source: E539: Illegal character <%s>
ko: E539: �̻��� ���� <%s>
pl: E539: Niedozwolony znak <%s>
zh_tw: E539: ¤£¥¿½Tªº¦r¤¸ <%s>

source: E529: Cannot set 'term' to empty string
ko: E529: 'term'�� �� ���ڿ��� ������ �� �����ϴ�
pl: E529: Nie mogê ustawiæ 'term' na pusty ci±g
zh_tw: E529: µLªk³]©w 'term' ¬°ªÅ¦r¦ê

source: E589: 'backupext' and 'patchmode' are equal
ko: E589: 'backupext'�� 'patchmode'�� �����մϴ�
pl: E589: 'backupext' i 'patchmode' s± to¿same
zh_tw: E589: 'backupext' ¸ò 'patchmode' ¬O¤@¼Ëªº

source: E834: Conflicts with value of 'listchars'
ko: E834: 'listchars' ���� �浹�� �߻��մϴ�
pl: E834: Konflikty warto¶ci 'listchars'

source: E835: Conflicts with value of 'fillchars'
ko: E835: 'fillchars' ���� �浹�� �߻��մϴ�
pl: E835: Konflikty warto¶ci 'fillchars'

source: E524: Missing colon
ko: E524: �ݷ��� �����ϴ�
pl: E524: Brak dwukropka
zh_tw: E524: ¯Ê¤Ö colon

source: E525: Zero length string
ko: E525: �� ���ڿ��Դϴ�
pl: E525: Ci±g o zerowej d³ugo¶ci
zh_tw: E525: ¹sªø«×¦r¦ê

source: E526: Missing number after <%s>
ko: E526: <%s> �ڿ� ���ڰ� �����ϴ�
pl: E526: Brak numeru po <%s>
zh_tw: E526: <%s> «á¯Ê¤Ö¼Æ¦r

source: E527: Missing comma
ko: E527: �޸��� �����ϴ�
pl: E527: Brak przecinka
zh_tw: E527: ¯Ê¤Ö³r¸¹

source: E528: Must specify a ' value
ko: E528: ' ���� ������ �ּž� �մϴ�
pl: E528: Musi okre¶laæ warto¶æ '
zh_tw: E528: ¥²»Ý«ü©w¤@­Ó ' ­È

source: E595: contains unprintable or wide character
ko: E595: ������ �� ����, Ȥ�� ���̵� ���ڸ� �����ϰ� �ֽ��ϴ�
pl: E595: zawiera niewy¶wietlalny lub szeroki znak
zh_tw: E595: ¤º§tµLªkÅã¥Üªº¦r¤¸

source: E535: Illegal character after <%c>
ko: E535: <%c> �ڿ� �̻��� ����
pl: E535: Niedozwolony znak po <%c>
zh_tw: E535: <%c> «á¦³¤£¥¿½Tªº¦r¤¸

source: E536: comma required
ko: E536: �޸��� �ʿ��մϴ�
pl: E536: wymagany przecinek
zh_tw: E536: »Ý­n³r¸¹

source: E537: 'commentstring' must be empty or contain %s
ko: E537: 'commentstring'�� ���ų� %s��(��) �����ؾ� �մϴ�
pl: E537: 'commentstring' musi byæ pusty lub zawieraæ %s
zh_tw: E537: 'commentstring' ¥²»Ý¬OªÅ¥Õ©Î¥]§t %s

source: E540: Unclosed expression sequence
ko: E540: ������ ���� ǥ���� �迭
pl: E540: Niedomkniêty ci±g wyra¿eñ
zh_tw: E540: ¨S¦³µ²§ôªº¹Bºâ¦¡:

source: E541: too many items
ko: E541: �ʹ� ���� �׸�
pl: E541: zbyt wiele elementów
zh_tw: E541: ¤Ó¦h¶µ¥Ø

source: E542: unbalanced groups
ko: E542: ������ �� ���� �׷�
pl: E542: niezbalansowane grupy
zh_tw: E542: ¤£¹ïºÙªº group

source: E590: A preview window already exists
ko: E590: �̸� ���� â�� �̹� �����մϴ�
pl: E590: okno podgl±du ju¿ istnieje
zh_tw: E590: ¹wµøªºµøµ¡¤w¸g¦s¦b¤F

source: W17: Arabic requires UTF-8, do ':set encoding=utf-8'
ko: W17: Arabic�� UTF-8 ���ڵ� �ʿ�, ':set encoding=utf-8' �ϼ���
pl: W17: Arabski wymaga UTF-8, zrób ':set encoding=utf-8'
zh_tw: W17: Arabic »Ý­n UTF-8, ½Ð°õ¦æ ':set encoding=utf-8'

source: E593: Need at least %d lines
ko: E593: ��� %d ���� �ʿ��մϴ�
pl: E593: Potrzebujê przynajmniej %d wierszy
zh_tw: E593: ¦Ü¤Ö»Ý­n %d ¦æ

source: E594: Need at least %d columns
ko: E594: ��� %d ĭ�� �ʿ��մϴ�
pl: E594: Potrzebujê przynajmniej %d kolumn
zh_tw: E594: ¦Ü¤Ö»Ý­n %d Äæ

source: E355: Unknown option: %s
ko: E355: �𸣴� �ɼ�: %s
pl: E355: Nieznana opcja: %s
zh_tw: E355: ¤£¥¿½Tªº¿ï¶µ: %s

source: E521: Number required: &%s = '%s'
ko: E521: ���ڰ� �ʿ�: &%s = '%s'
pl: E521: Wymagana Liczba: &%s = '%s'

source: --- Terminal codes ---
ko: --- �͹̳� �ڵ� ---
pl: --- Kody terminala ---
zh_tw: --- ²×ºÝ¾÷½X ---

source: --- Global option values ---
ko: --- ���� �ɼ� �� ---
pl: --- Globalne warto¶ci opcji ---
zh_tw: --- Global ¿ï¶µ­È ---

source: --- Local option values ---
ko: --- ���� �ɼ� �� ---
pl: --- Lokalne warto¶ci opcji ---
zh_tw: --- Local ¿ï¶µ­È ---

source: --- Options ---
ko: --- �ɼ� ---
pl: --- Opcje ---
zh_tw: --- ¿ï¶µ ---

source: E356: get_varp ERROR
ko: E356: get_varp ����
pl: E356: B£¡D get_varp
zh_tw: E356: get_varp ¿ù»~

source: E357: 'langmap': Matching character missing for %s
ko: E357: 'langmap': %s�� ���� �´� ���ڰ� �����ϴ�
pl: E357: 'langmap': Brak pasuj±cego znaku dla %s
zh_tw: E357: 'langmap': §ä¤£¨ì %s ¹ïÀ³ªº¦r¤¸

source: E358: 'langmap': Extra characters after semicolon: %s
ko: E358: 'langmap': �����ݷ� �ڿ� ���ڰ� �� ����: %s
pl: E358: 'langmap': Dodatkowe znaki po ¶redniku: %s
zh_tw: E358: 'langmap': ¤À¸¹«á¦³¦h¾lªº¦r¤¸: %s

source: Cannot execute shell
pl: Nie mogê wykonaæ pow³oki
zh_tw: ¤£¯à°õ¦æ shell

source: shell returned
pl: pow³oka zwróci³a
zh_tw: Shell ¤wªð¦^

source: Could not get security context for
pl: Nie mogê uzyskaæ kontekstu bezpieczeñstwa dla

source: Could not set security context for
pl: Nie mo¿na uzyskaæ kontekstu bezpieczeñstwa dla

source: E447: Can't find file "%s" in path
ko: E447: path���� "%s" ������ ã�� �� �����ϴ�
pl: E447: Nie mogê znale¼æ pliku "%s" w tropie
zh_tw: E447: ¦b¸ô®|¤¤§ä¤£¨ìÀÉ®× "%s"

source: E372: Too many %%%c in format string
ko: E372: ���� ���ڿ��� %%%c��(��) �ʹ� �����ϴ�
pl: E372: Zbyt wiele %%%c w ci±gu formatuj±cym
zh_tw: E372: ®æ¦¡¤Æ¦r¦ê¸Ì¦³¤Ó¦h %%%c

source: E373: Unexpected %%%c in format string
ko: E373: ���� ���ڿ��� %%%c��(��) �߸��Ǿ����ϴ�
pl: E373: Nieoczekiwane %%%c w ci±gu formatuj±cym
zh_tw: E373: ®æ¦¡¤Æ¦r¦ê¤£À³¸Ó¥X²{ %%%c

source: E374: Missing ] in format string
ko: E374: ���� ���ڿ��� ]�� �����ϴ�
pl: E374: Brak ] w ci±gu formatuj±cym
zh_tw: E374: ®æ¦¡¤Æ¦r¦ê¸Ì¤Ö¤F ]

source: E375: Unsupported %%%c in format string
ko: E375: ���� ���ڿ��� �������� �ʴ� %%%c��(��) �ֽ��ϴ�
pl: E375: Niewspomagane %%%c w ci±gu formatuj±cym
zh_tw: E375: ®æ¦¡¤Æ¦r¦ê¸Ì¦³¤£¤ä´©ªº %%%c

source: E376: Invalid %%%c in format string prefix
ko: E376: ���� ���ڿ� ���ο� �߸��� %%%c��(��) �ֽ��ϴ�
pl: E376: Niepoprawne %%%c w prefiksie ci±gu formatuj±cego
zh_tw: E376: ®æ¦¡¤Æ¦r¦ê¶}ÀY¸Ì¦³¤£¥¿½Tªº %%%c

source: E377: Invalid %%%c in format string
ko: E377: ���� ���ڿ��� �߸��� %%%c��(��) �ֽ��ϴ�
pl: E377: Niepoprawne %%%c w ci±gu formatuj±cym
zh_tw: E377: ®æ¦¡¤Æ¦r¦ê¸Ì¦³¤£¥¿½Tªº %%%c

source: E378: 'errorformat' contains no pattern
ko: E378: 'errorformat'�� � ���ϵ� �����ϰ� ���� �ʽ��ϴ�
pl: E378: 'errorformat' nie zawiera wzorca
zh_tw: E378: 'errorformat' ¥¼³]©w

source: E379: Missing or empty directory name
ko: E379: �����ų� �� �����丮 �̸�
pl: E379: Pusta nazwa katalogu lub jej brak
zh_tw: E379: §ä¤£¨ì¥Ø¿ý¦WºÙ©Î¬OªÅªº¥Ø¿ý¦WºÙ

source: E553: No more items
ko: E553: �� �̻��� �׸��� �����ϴ�
pl: E553: Nie ma wiêcej elementów
zh_tw: E553: ¨S¦³¨ä¥¦¶µ¥Ø

source: (%d of %d)%s%s:
pl: (%d z %d)%s%s:
zh_tw: (%d / %d)%s%s:

source: (line deleted)
pl: (wiersz skasowany)
zh_tw: (¦æ¤w§R°£)

source: E380: At bottom of quickfix stack
ko: E380: ���Ƚ� ������ �ٴ��Դϴ�
pl: E380: Na dole stosu quickfix
zh_tw: E380: Quickfix °ïÅ|µ²§À

source: E381: At top of quickfix stack
ko: E381: ���Ƚ� ������ �������Դϴ�
pl: E381: Na górze stosu quickfix
zh_tw: E381: Quickfix °ïÅ|³»ºÝ

source: error list %d of %d; %d errors
pl: lista b³êdów %d z %d; %d b³êdów
zh_tw: ¿ù»~¦Cªí %d/%d; ¦@¦³ %d ¶µ¿ù»~

source: E382: Cannot write, 'buftype' option is set
ko: E382: �� �� ����, 'buftype' �ɼ��� �����Ǿ� �ֽ��ϴ�
pl: E382: Nie mogê zapisaæ, opcja 'buftype' jest ustawiona
zh_tw: E382: µLªk¼g¤J¡A'buftype' ¿ï¶µ¤w³]©w

source: E683: File name missing or invalid pattern
ko: E683: ���ϸ� ���� Ȥ�� �߸��� ����
pl: E683: Brak nazwy pliku lub niew³a¶ciwa ¶cie¿ka

source: Cannot open file "%s"
ko: "%s" ������ �� �� �����ϴ�
pl: Nie mogê otworzyæ pliku "%s"

source: E681: Buffer is not loaded
ko: E681: ���۰� �ε����� �ʾҽ��ϴ�
pl: E681: Bufor nie jest za³adowany

source: E777: String or List expected
ko: E777: String�̳� List�� �־��� ��
pl: E777: Oczekiwa³em na ³añcuch lub listê

source: E369: invalid item in %s%%[]
ko: E369: %s%%[]�� �߸��� �׸�
pl: E369: Niew³a¶ciwy element w %s%%[]
zh_tw: E369: ¤£¥¿½Tªº¶µ¥Ø¡G %s%%[]

source: E769: Missing ] after %s[
ko: E769: %s[ �ڿ� ]�� �����ϴ�
pl: E769: Brak ] po %s[

source: E53: Unmatched %s%%(
ko: E53: ���� �ʴ� %s%%(
pl: E53: Niesparowany %s%%(
zh_tw: E53: µL¹ïÀ³ªº %s%%(

source: E54: Unmatched %s(
ko: E54: ���� �ʴ� %s(
pl: E54: Niesparowany %s(
zh_tw: E54: µL¹ïÀ³ªº %s(

source: E55: Unmatched %s)
ko: E55: ���� �ʴ� %s)
pl: E55: Niesparowany %s)
zh_tw: E55: µL¹ïÀ³ªº %s)

source: E66: \z( not allowed here
ko: E66: \z(�� ���⿡�� �������� �ʽ��ϴ�
pl: E66: \z( jest niedozwolone w tym miejscu
zh_tw: E66: \z( ¤£¯à¦b¦¹¥X²{

source: E67: \z1 et al. not allowed here
ko: E67: \z1 ���� ���⿡�� �������� �ʽ��ϴ�
pl: E67: \z1 i podobne s± niedozwolone w tym miejscu
zh_tw: E67: \z1 et al. ¤£¯à¦b¦¹¥X²{

source: E69: Missing ] after %s%%[
ko: E69: %s%%[ �ڿ� ]�� �����ϴ�
pl: E69: Brak ] po %s%%[
zh_tw: E69: %s%%[ «á¯Ê¤Ö ]

source: E70: Empty %s%%[]
ko: E70: �� %s%%[]
pl: E70: Pusty %s%%[]
zh_tw: E70: ªÅªº %s%%[]

source: E339: Pattern too long
ko: E339: ������ �ʹ� ���ϴ�
pl: E339: Zbyt d³ugi wzorzec
zh_tw: E339: ¦W¦r¤Óªø

source: E50: Too many \z(
ko: E50: \z(�� �ʹ� �����ϴ�
pl: E50: Zbyt wiele \z(
zh_tw: E50: ¤Ó¦h \z(

source: E51: Too many %s(
ko: E51: %s(�� �ʹ� �����ϴ�
pl: E51: Zbyt wiele %s(
zh_tw: E51: ¤Ó¦h %s(

source: E52: Unmatched \z(
ko: E52: ���� �ʴ� \z(
pl: E52: Niesparowany \z(
zh_tw: E52: µL¹ïÀ³ªº \z(

source: E59: invalid character after %s@
ko: E59: %s@ �ڿ� �߸��� ����
pl: E59: niedozwolony znak po %s@
zh_tw: E59: «á­±¦³¤£¥¿½Tªº¦r¤¸: %s@

source: E60: Too many complex %s{...}s
ko: E60: %s{...}s�� �ʹ� ����
pl: E60: Zbyt wiele z³o¿onych %s{...}
zh_tw: E60: ¤Ó¦h½ÆÂøªº %s{...}s

source: E61: Nested %s*
pl: E61: Zagnie¿d¿one %s*
zh_tw: E61: ±_ª¬ %s*

source: E62: Nested %s%c
pl: E62: Zagnie¿d¿one %s%c
zh_tw: E62: ±_ª¬ %s%c

source: E63: invalid use of \_
ko: E63: \_�� �� �� ����
pl: E63: Niedozwolone u¿ycie \_
zh_tw: E63: ¤£¥¿½Tªº¨Ï¥Î \_

source: E64: %s%c follows nothing
ko: E64: %s%c �ڿ� �ƹ��͵� �����ϴ�
pl: E64: %s%c po niczym
zh_tw: E64: %s%c ¨S¦³±µªF¦è

source: E65: Illegal back reference
ko: E65: �̻��� ���� ����
pl: E65: Niew³a¶ciwe odwo³anie wsteczne
zh_tw: E65: ¤£¥¿½Tªº¤Ï¦V°Ñ¦Ò

source: E68: Invalid character after \z
ko: E68: \z �ڿ� �̻��� ����
pl: E68: niedopuszczalny znak po \z
zh_tw: E68: «á­±¦³¤£¥¿½Tªº¦r¤¸: \z

source: E678: Invalid character after %s%%[dxouU]
ko: E678: %s%%[dxouU] �ڿ� �̻��� ����
pl: E678: Niedozwolony znak po %s%%[dxouU]

source: E71: Invalid character after %s%%
ko: E71: %s%% �ڿ� �̻��� ����
pl: E71: Niedozwolony znak po %s%%
zh_tw: E71: «á­±¦³¤£¥¿½Tªº¦r¤¸: %s%%

source: E554: Syntax error in %s{...}
ko: E554: %s{...}�� ���� ����
pl: E554: B³±d sk³adni w %s{...}
zh_tw: E554: »yªk¿ù»~: %s{...}

source: External submatches:
ko: �ܺ� submatches:
pl: Zewnêtrzne poddopasowania:
zh_tw: ¥~³¡²Å¦X:

source: E864: \%#= can only be followed by 0, 1, or 2. The automatic engine will be used
pl: E:864: \%#= mo¿e byæ tylko przed 0, 1 lub 2. Zostanie u¿yty silnik automatyczny

source: E865: (NFA) Regexp end encountered prematurely
pl: E865: (NFA) przedwczesny koniec wyra¿enia regularnego

source: E866: (NFA regexp) Misplaced %c
pl: E866: (wyra¿enie regularne NFA) Niepoprawnie umieszczone %c

source: E867: (NFA) Unknown operator '\z%c'
pl: E867: (NFA) Nieznany operator '\z%c'

source: E867: (NFA) Unknown operator '\%%%c'
pl: E867: (NFA) Nieznany operator '\%%%c'

source: E869: (NFA) Unknown operator '\@%c'
pl: E869: (NFA) Nieznany operator '\@%c'

source: E870: (NFA regexp) Error reading repetition limits
pl: E870: (wyra¿enie regularne NFA) B³±d przy odczytywaniu limitów powtórzeñ

source: E871: (NFA regexp) Can't have a multi follow a multi !
pl: E871: (wyra¿enie regularne NFA) wielokrotne nie mo¿e byæ po wielokrotnym!

source: E872: (NFA regexp) Too many '('
pl: E872: (wyra¿enie regularne NFA) Zbyt du¿o '('

source: E879: (NFA regexp) Too many \z(
pl: E879: (wyra¿enie regularne NFA) Za du¿o \z(

source: E873: (NFA regexp) proper termination error
pl: E873: (wyra¿enie regularne NFA) b³±d poprawnego zakoñczenia

source: E874: (NFA) Could not pop the stack !
pl: E874: (NFA) Nie mo¿na zdj±æ elementu ze stosu!

source: E875: (NFA regexp) (While converting from postfix to NFA), too many states left on stack
pl: E875: (wyra¿enie regularne NFA) (w trakcie konwersji postfix do NFA), za wiele stanów na stosie

source: E876: (NFA regexp) Not enough space to store the whole NFA
pl: E876: (wyra¿enie regularne NFA) Nie ma miejsca na ca³e NFA

source: Could not open temporary log file for writing, displaying on stderr ...
pl: Nie mo¿na otworzyæ do zapisu tymczasowego pliku, pokazujê na stderr...

source: (NFA) COULD NOT OPEN %s !
pl: (NFA) NIE MO¯NA OTWORZYÆ %s !

source: Could not open temporary log file for writing
pl: Nie mo¿na otworzyæ do zapisu tymczasowego pliku logowania

source: VREPLACE
ko: ����ġȯ
pl: V-ZAMIANA
zh_tw: V-¨ú¥N

source: REPLACE
ko: �ٲٱ�
pl: ZAMIANA
zh_tw: ¨ú¥N

source: REVERSE
ko: �ݴ�
pl: NEGATYW
zh_tw: ¤ÏÂà

source: INSERT
pl: WPROWADZANIE
zh_tw: ´¡¤J

source: (insert)
pl: (wprowadzanie)
zh_tw: (´¡¤J)

source: (replace)
ko: (�ٲٱ�)
pl: (zamiana)
zh_tw: (¨ú¥N)

source: (vreplace)
ko: (����ġȯ)
pl: (v-zamiana)
zh_tw: (v-¨ú¥N)

source: Hebrew
pl: Hebrajski

source: Arabic
ko: �ƶ�����
pl: Arabski

source: (lang)
pl: (jêzyk)
zh_tw: (»y¨¥)

source: (paste)
pl: (wklejanie)
zh_tw: (¶K¤W)

source: VISUAL
pl: WIZUALNY
zh_tw: ¿ï¨ú

source: VISUAL LINE
pl: WIZUALNY LINIOWY
zh_tw: [¦æ]

source: VISUAL BLOCK
pl: WIZUALNY BLOKOWY
zh_tw: [°Ï¶ô]

source: SELECT
pl: ZAZNACZANIE
zh_tw: ¿ï¨ú

source: SELECT LINE
pl: ZAZNACZANIE LINIOWE
zh_tw: ¿ï¨ú¦æ
