Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: E10: \ should be followed by /, ? or &
ko: E10: /, ? Ȥ�� &�� \ �ڿ� �;� �մϴ�
pl: E10: po \ powinno byæ /, ? lub &
zh_tw: E10: \ «á­±À³¸Ó¦³ / ? ©Î &

source: E11: Invalid in command-line window; <CR> executes, CTRL-C quits
ko: E11: ������ â�� �߸���; <CR> ����, CTRL-C ������
pl: E11: Niedozwolone w oknie wiersza poleceñ; <CR> wykonuje, CTRL-C opuszcza
zh_tw: E11: ¤£¯à¦b©R¥O¦Cµøµ¡¤¤¨Ï¥Î¡C<CR>°õ¦æ¡ACTRL-C Â÷¶}

source: E12: Command not allowed from exrc/vimrc in current dir or tag search
ko: E12: ���� �����丮 �Ǵ� �±� ã�⿡�� exrc/vimrc������ ������ ���� �� �˴ϴ�
pl: E12: Komenda niedozwolona z exrc/vimrc w bie¿±cym szukaniu katalogu lub znacznika
zh_tw: E12: exrc/vimrc ¸Ìªº«ü¥OµLªk°õ¦æ

source: E171: Missing :endif
ko: E171: :endif�� �����ϴ�
pl: E171: Brak :endif
zh_tw: E171: ¯Ê¤Ö :endif

source: E600: Missing :endtry
ko: E600: :endtry�� �����ϴ�
pl: E600: Brak :endtry
zh_tw: E600: ¯Ê¤Ö :endtry

source: E170: Missing :endwhile
ko: E170: :endwhile�� �����ϴ�
pl: E170: Brak :endwhile
zh_tw: E170: ¯Ê¤Ö :endwhile

source: E170: Missing :endfor
ko: E170: :endfor ����
pl: E170: Brak :endfor

source: E588: :endwhile without :while
ko: E588: :while���� :endwhile�� �ֽ��ϴ�
pl: E588: :endwhile bez :while
zh_tw: E588: :endwhile ¯Ê¤Ö¹ïÀ³ªº :while

source: E588: :endfor without :for
ko: E588: :for ���� :endfor
pl: E588: :endfor bez :for

source: E13: File exists (add ! to override)
ko: E13: ������ �ֽ��ϴ� (������� ! ����)
pl: E13: Plik istnieje (wymu¶ poprzez !)
zh_tw: E13: ÀÉ®×¤w¸g¦s¦b (¥i¥Î ! ±j¨î¨ú¥N)

source: E472: Command failed
ko: E472: ������ �����߽��ϴ�
pl: E472: Komenda nie powiod³a siê
zh_tw: E472: ©R¥O°õ¦æ¥¢±Ñ

source: E473: Internal error
ko: E473: ���� ����
pl: E473: B³±d wewnêtrzny
zh_tw: E473: ¤º³¡¿ù»~

source: Interrupted
ko: �ߴܵǾ����ϴ�
pl: Przerwane
zh_tw: ¤w¤¤Â_

source: E14: Invalid address
ko: E14: �߸��� �ּ�
pl: E14: Niew³a¶ciwy adres
zh_tw: E14: ¤£¥¿½Tªº¦ì§}

source: E474: Invalid argument
ko: E474: �߸��� ����
pl: E474: Niew³a¶ciwy argument
zh_tw: E474: ¤£¥¿½Tªº°Ñ¼Æ

source: E475: Invalid argument: %s
ko: E475: �߸��� ����: %s
pl: E475: Niew³a¶ciwy argument: %s
zh_tw: E475: ¤£¥¿½Tªº°Ñ¼Æ: %s

source: E15: Invalid expression: %s
ko: E15: �߸��� ǥ����: %s
pl: E15: Niew³a¶ciwe wyra¿enie: %s
zh_tw: E15: ¤£¥¿½Tªº¹Bºâ¦¡: %s

source: E16: Invalid range
ko: E16: �߸��� ����
pl: E16: Niew³a¶ciwy zakres
zh_tw: E16: ¤£¥¿½Tªº½d³ò

source: E476: Invalid command
ko: E476: �߸��� ����
pl: E476: Niew³a¶ciwa komenda
zh_tw: E476: ¤£¥¿½Tªº©R¥O

source: E17: "%s" is a directory
ko: E17: "%s"��(��) �����丮�Դϴ�
pl: E17: "%s" jest katalogiem
zh_tw: E17: "%s" ¬O¥Ø¿ý

source: E364: Library call failed for "%s()"
ko: E364: ���̺귯�� "%s()" �θ��� ����
pl: E364: Wywo³anie z biblioteki nie powiod³o siê dla "%s()"
zh_tw: E364: ©I¥s¨ç¦¡®w "%s"() ¥¢±Ñ

source: E19: Mark has invalid line number
ko: E19: ��ũ�� �߸��� �� ��ȣ�� ������ �ֽ��ϴ�
pl: E19: Zak³adka ma niew³a¶ciwy numer wiersza
zh_tw: E19: ¼Ð°Oªº¦æ¸¹¿ù»~

source: E20: Mark not set
ko: E20: ��ũ�� �����Ǿ� ���� �ʽ��ϴ�
pl: E20: Zak³adka nienastawiona
zh_tw: E20: ¨S¦³³]©w¼Ð°O

source: E21: Cannot make changes, 'modifiable' is off
ko: E21: �ٲ� �� ����, 'modifiable'�� �����ֽ��ϴ�
pl: E21: Nie mogê wykonaæ zmian, 'modifiable' jest wy³±czone
zh_tw: E21: ¦]¬° 'modifiable' ¿ï¶µ¬OÃö³¬ªº¡A©Ò¥H¤£¯à­×§ï

source: E22: Scripts nested too deep
ko: E22: ��ũ��Ʈ�� �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E22: Zbyt g³êbokie zagnie¿d¿enie skryptów
zh_tw: E22: ±_ª¬»¼°j©I¥s¤Ó¦h¼h

source: E23: No alternate file
ko: E23: �ٸ� ������ �����ϴ�
pl: E23: Brak pliku zamiany
zh_tw: E23: ¨S¦³´À¥NªºÀÉ®×

source: E24: No such abbreviation
ko: E24: �׷� ������ �����ϴ�
pl: E24: Nie ma takiego skrótu
zh_tw: E24: ¨S¦³³o­Ó abbreviation ¹ïÀ³

source: E477: No ! allowed
ko: E477: !�� �������� �ʽ��ϴ�
pl: E477: Niedozwolone !
zh_tw: E477: ¤£¥i¨Ï¥Î '!'

source: E25: GUI cannot be used: Not enabled at compile time
ko: E25: GUI�� ������ �� �����ϴ�: ������ �� ���Ե��� �ʾҽ��ϴ�
pl: E25: GUI nie mo¿e byæ u¿yte: Nie w³±czono podczas kompilacji
zh_tw: E25: ¦]¬°½sÄ¶®É¨S¦³¥[¤J¹Ï«¬¬É­±ªºµ{¦¡½X¡A©Ò¥HµLªk¨Ï¥Î¹Ï«¬¬É­±

source: E28: No such highlight group name: %s
ko: E28: �̷� ���̶���Ʈ �׷� �̸��� �����ϴ�: %s
pl: E28: Brak takiej nazwy grupy pod¶wietlania: %s
zh_tw: E28: ¨S¦³¦W¬° '%s' ªº highlight group

source: E29: No inserted text yet
ko: E29: �Էµ� �ؽ�Ʈ�� ���� �����ϴ�
pl: E29: Nie wprowadzono jeszcze ¿adnego tekstu
zh_tw: E29: ÁÙ¨S¦³´¡¤J¤å¦r¹L

source: E30: No previous command line
ko: E30: ���� ���� ���� �����ϴ�
pl: E30: Nie ma poprzedniego wiersza poleceñ
zh_tw: E30: ¨S¦³«e¤@¶µ©R¥O

source: E31: No such mapping
ko: E31: �׷� ������ �����ϴ�
pl: E31: Nie ma takiego przyporz±dkowania
zh_tw: E31: ¨S¦³³o­Ó mapping ¹ïÀ³

source: E479: No match
ko: E479: ���� �ʽ��ϴ�
pl: E479: Brak dopasowañ
zh_tw: E479: §ä¤£¨ì

source: E480: No match: %s
ko: E480: ���� ����: %s
pl: E480: Brak dopasowañ: %s
zh_tw: E480: §ä¤£¨ì: %s

source: E32: No file name
ko: E32: ���� �̸��� �����ϴ�
pl: E32: Brak nazwy pliku
zh_tw: E32: ¨S¦³ÀÉ¦W

source: E33: No previous substitute regular expression
ko: E33: ���� �ٲٱ� ���� ǥ������ �����ϴ�
pl: E33: Brak poprzedniego podstawieniowego wyra¿enia regularnego
zh_tw: E33: ¨S¦³«e¤@­Ó·j´M/¨ú¥Nªº©R¥O

source: E34: No previous command
ko: E34: ���� ������ �����ϴ�
pl: E34: Brak poprzedniej komendy
zh_tw: E34: ¨S¦³«e¤@­Ó©R¥O

source: E35: No previous regular expression
ko: E35: ���� ����ǥ������ �����ϴ�
pl: E35: Brak poprzedniego wyra¿enia regularnego
zh_tw: E35: ¨S¦³«e¤@­Ó·j´M«ü¥O

source: E481: No range allowed
ko: E481: ������ �������� �ʽ��ϴ�
pl: E481: Zakres niedozwolony
zh_tw: E481: ¤£¥i¨Ï¥Î½d³ò«ü¥O

source: E36: Not enough room
ko: E36: �� ������ �������� �ʽ��ϴ�
pl: E36: Brak miejsca
zh_tw: E36: ¨S¦³¨¬°÷ªºªÅ¶¡

source: E482: Can't create file %s
ko: E482: %s ������ ���� �� �����ϴ�
pl: E482: Nie mogê stworzyæ pliku %s
zh_tw: E482: ¤£¯à«Ø¥ßÀÉ®× %s

source: E483: Can't get temp file name
ko: E483: �ӽ� ���� �̸��� ���� �� �����ϴ�
pl: E483: Nie mogê pobraæ nazwy pliku tymczasowego
zh_tw: E483: µLªk±oª¾¼È¦sÀÉ¦W

source: E484: Can't open file %s
ko: E484: %s ������ �� �� �����ϴ�
pl: E484: Nie mogê otworzyæ pliku %s
zh_tw: E484: µLªk¶}±ÒÀÉ®× %s

source: E485: Can't read file %s
ko: E485: %s ������ ���� �� �����ϴ�
pl: E485: Nie mogê odczytaæ pliku %s
zh_tw: E485: µLªkÅª¨úÀÉ®× %s

source: E37: No write since last change (add ! to override)
ko: E37: ���������� ��ģ �� �������� �ʾҽ��ϴ� (�����Ϸ��� ! ���ϱ�)
pl: E37: Nie zapisano od ostatniej zmiany (wymu¶ przez !)
zh_tw: E37: ¤w§ó§ï¹LÀÉ®×¦ý©|¥¼¦sÀÉ (¥i¥Î ! ±j¨î°õ¦æ)

source: E38: Null argument
ko: E38: �� ����
pl: E38: Zerowy argument
zh_tw: E38: ªÅªº (Null) °Ñ¼Æ

source: E39: Number expected
ko: E39: ���ڰ� �ʿ��մϴ�
pl: E39: Oczekujê liczby
zh_tw: E39: À³¸Ó­n¦³¼Æ¦r

source: E40: Can't open errorfile %s
ko: E40: �������� %s��(��) �� �� �����ϴ�
pl: E40: Nie mogê otworzyæ pliku b³êdów %s
zh_tw: E40: µLªk¶}±Ò¿ù»~ÀÉ®× %s

source: E41: Out of memory!
ko: E41: �޸𸮰� �ٴڳ����ϴ�!
pl: E41: Pamiêæ wyczerpana!
zh_tw: E41: °O¾ÐÅé¤£¨¬!

source: Pattern not found
ko: ������ ã�� �� �����ϴ�
pl: Nie znaleziono wzorca
zh_tw: §ä¤£¨ì

source: E486: Pattern not found: %s
ko: E486: ������ ã�� �� �����ϴ�: %s
pl: E486: Nie znaleziono wzorca: %s
zh_tw: E486: §ä¤£¨ì %s

source: E487: Argument must be positive
ko: E487: ���ڴ� �����̾��� �մϴ�
pl: E487: Argument musi byæ dodatni
zh_tw: E487: °Ñ¼ÆÀ³¸Ó¬O¥¿¼Æ

source: E459: Cannot go back to previous directory
ko: E459: ���� �����丮�� �� �� �����ϴ�
pl: E459: Nie mo¿na przej¶æ do poprzedniego katalogu
zh_tw: E459: µLªk¦^¨ì«e¤@­Ó¥Ø¿ý

source: E42: No Errors
ko: E42: ���� ����
pl: E42: Brak B³êdów
zh_tw: E42: ¨S¦³¿ù»~

source: E776: No location list
ko: E776: ��ġ ���� ����
pl: E776: Brak listy lokacji

source: E43: Damaged match string
ko: E43: ���� �´� ���ڿ�
pl: E43: Popsuty ci±g wzorca
zh_tw: E43: ²Å¦X¦r¦ê¦³°ÝÃD

source: E44: Corrupted regexp program
ko: E44: ���� ����ǥ���� ���α׷�
pl: E44: Zepsuty program wyra¿eñ regularnych
zh_tw: E44: regexp ¦³°ÝÃD

source: E45: 'readonly' option is set (add ! to override)
ko: E45: 'readonly' �ɼ��� �����Ǿ� �ֽ��ϴ� (������� ! ���ϱ�)
pl: E45: opcja 'readonly' jest ustawiona (wymu¶ poprzez !)
zh_tw: E45: ¦³³]©w 'readonly' ¿ï¶µ(°ßÅª) (¥i¥Î ! ±j¨î°õ¦æ)

source: E46: Cannot change read-only variable "%s"
ko: E46: �б� ���� ���� "%s"��(��) �ٲ� �� �����ϴ�
pl: E46: Nie mogê zmieniæ zmiennej tylko do odczytu "%s"

source: E794: Cannot set variable in the sandbox: "%s"
ko: E794: sandbox �ȿ����� ������ ������ �� ����: "%s"
pl: E794: Nie mogê ustawiæ zmiennej w piaskownicy: "%s"

source: E47: Error while reading errorfile
ko: E47: �������� �д� ���߿� ����
pl: E47: B³±d w trakcie czytania pliku b³êdów
zh_tw: E47: Åª¨ú¿ù»~ÀÉ®×¥¢±Ñ

source: E48: Not allowed in sandbox
ko: E48: sandbox������ �������� �ʽ��ϴ�
pl: E48: Niedozwolone w piaskownicy
zh_tw: E48: ¤£¯à¦b sandbox ¸Ì¥X²{

source: E523: Not allowed here
ko: E523: ���⿡�� �������� �ʽ��ϴ�
pl: E523: Niedozwolone w tym miejscu
zh_tw: E523: ³o¸Ì¤£¥i¨Ï¥Î

source: E359: Screen mode setting not supported
ko: E359: ��ũ�� ���� ������ �������� �ʽ��ϴ�
pl: E359: Ustawianie trybu ekranu niewspomagane
zh_tw: E359: ¤£¤ä´©³]©w¿Ã¹õ¼Ò¦¡

source: E49: Invalid scroll size
ko: E49: ��ũ�� ũ�Ⱑ �߸��Ǿ����ϴ�
pl: E49: Niew³a¶ciwa wielko¶æ przewiniêcia
zh_tw: E49: ¿ù»~ªº±²°Ê¤j¤p

source: E91: 'shell' option is empty
ko: E91: 'shell' �ɼ��� �������ϴ�
pl: E91: opcja 'shell' jest pusta
zh_tw: E91: 'E71: ¿ï¶µ 'shell' ¥¼³]©w

source: E255: Couldn't read in sign data!
ko: E255: sign �ڷḦ ���� �� �����ϴ�
pl: E255: Nie mog³em wczytaæ danych znaku!
zh_tw: E255: µLªkÅª¨ú sign data!

source: E72: Close error on swap file
ko: E72: ���� ������ ���� �� �����ϴ�
pl: E72: B³±d podczas zamykania pliku wymiany
zh_tw: E72: ¼È¦sÀÉÃö³¬¿ù»~

source: E73: tag stack empty
ko: E73: �±� ������ �������ϴ�
pl: E73: stos znaczników jest pusty
zh_tw: E73: ¼ÐÅÒ°ïÅ|¤wªÅ

source: E74: Command too complex
ko: E74: ������ �ʹ� �����մϴ�
pl: E74: Komenda jest zbyt skomplikowana
zh_tw: E74: ©R¥O¤Ó½ÆÂø

source: E75: Name too long
ko: E75: �̸��� �ʹ� ���ϴ�
pl: E75: Zbyt d³uga nazwa
zh_tw: E75: ¦W¦r¤Óªø

source: E76: Too many [
ko: E76: [�� �ʹ� �����ϴ�
pl: E76: Zbyt wiele [
zh_tw: E76: ¤Ó¦h [

source: E77: Too many file names
ko: E77: ���� �̸��� �ʹ� �����ϴ�
pl: E77: Zbyt wiele nazw plików
zh_tw: E77: ¤Ó¦hÀÉ¦W

source: E488: Trailing characters
ko: E488: ���� ���ڰ� �� �ֽ��ϴ�
pl: E488: Nadstêpne znaczki
zh_tw: E488: §A¿é¤J¤F¦h¾lªº¦r¤¸

source: E78: Unknown mark
ko: E78: �𸣴� ��ũ
pl: E78: Nieznana zak³adka
zh_tw: E78: µLªk¿ìÃÑªº¼Ð°O

source: E79: Cannot expand wildcards
ko: E79: ���� ���ڸ� Ȯ���� �� �����ϴ�
pl: E79: Nie mog± rozwin±æ znaków wieloznacznych
zh_tw: E79: µLªk®i¶}¸U¥Î¦r¤¸

source: E591: 'winheight' cannot be smaller than 'winminheight'
ko: E591: 'winheight'�� 'winminheight'���� Ŀ�� �մϴ�
pl: E591: 'winheight' nie mo¿e byæ mniejsze ni¿ 'winminheight'
zh_tw: E591: 'winheight' ¤£¯à¤ñ 'winminheight' §ó¤Ö

source: E592: 'winwidth' cannot be smaller than 'winminwidth'
ko: E592: 'winwidth'�� 'winminwidth'���� Ŀ�� �մϴ�
pl: E592: 'winwidth' nie mo¿e byæ mniejsze ni¿ 'winminwidth'
zh_tw: E592: 'winwidth' ¤£¯à¤ñ 'winminwidth' §ó¤Ö

source: E80: Error while writing
ko: E80: ���� �߿� ����
pl: E80: B³±d w trakcie zapisu
zh_tw: E80: ¼g¤J¿ù»~

source: Zero count
pl: Zerowy licznik
zh_tw: ¼Æ¨ì¹s (?)

source: E81: Using <SID> not in a script context
ko: E81: ��ũ��Ʈ ���ؽ�Ʈ �ۿ��� <SID> ����
pl: E81: U¿ycie <SID> poza kontekstem skryptu
zh_tw: E81: <SID> ¤£¯à¦b script ¥»¤å¥~¨Ï¥Î.

source: E685: Internal error: %s
ko: E685: ���� ����: %s
pl: E685: B³±d wewnêtrzny: %s

source: E363: pattern uses more memory than 'maxmempattern'
ko: E363: ������ 'maxmempattern'���� ���� �޸𸮸� �����մϴ�
pl: E363: Wzorzec u¿ywa wiêcej pamiêci ni¿ 'maxmempattern'

source: E749: empty buffer
ko: E749: �� ����
pl: E749: pusty bufor

source: E682: Invalid search pattern or delimiter
ko: E682: �߸��� ã�� ���� Ȥ�� ������
pl: E682: Niew³a¶ciwy wzorzec wyszukiwania lub delimiter

source: E139: File is loaded in another buffer
ko: E139: ������ �ٸ� ���ۿ� �ε��Ǿ� �ֽ��ϴ�
pl: E139: Plik jest za³adowany w innym buforze
zh_tw: E139: ±z¦b¥t¤@­Ó½w½Ä°Ï¤]¸ü¤J¤F³o­ÓÀÉ®×

source: E764: Option '%s' is not set
ko: E764: �ɼ� '%s'��(��) �����Ǿ� ���� �ʽ��ϴ�
pl: E764: Nie ustawiono opcji '%s'

source: E850: Invalid register name
pl: E850: Niew³a¶ciwa nazwa rejestru

source: search hit TOP, continuing at BOTTOM
ko: ó������ ã����, ������ ����
pl: szukanie dobi³o GÓRY; kontynuacja od KOÑCA
zh_tw: ¤w·j´M¨ìÀÉ®×¶}ÀY¡F¦A±qµ²§ÀÄ~Äò·j´M

source: search hit BOTTOM, continuing at TOP
ko: ������ ã����, ó������ ����
pl: szukanie dobi³o KOÑCA; kontynuacja od GÓRY
zh_tw: ¤w·j´M¨ìÀÉ®×µ²§À¡F¦A±q¶}ÀYÄ~Äò·j´M

source: E550: Missing colon
ko: E550: �ݷ��� �����ϴ�
pl: E550: Brak dwukropka
zh_tw: E550: ¯Ê¤Ö colon

source: E551: Illegal component
ko: E551: �̻��� ������Ʈ
pl: E551: Niedozwolona czê¶æ
zh_tw: E551: ¤£¥¿½Tªº¼Ò¦¡

source: E552: digit expected
ko: E552: ���ڰ� �ʿ��մϴ�
pl: E552: oczekiwa³em na cyfrê
zh_tw: E552: À³¸Ó­n¦³¼Æ¦r

source: Page %d
ko: ������ %d
pl: Strona %d
zh_tw: ²Ä %d ­¶

source: No text to be printed
ko: �μ��� �ؽ�Ʈ�� �����ϴ�
pl: Brak tekstu do drukowania
zh_tw: ¨S¦³­n¦C¦Lªº¤å¦r

source: Printing page %d (%d%%)
ko: ������ %d �μ��� (%d%%)
pl: Drukujê stronê %d (%d%%)
zh_tw: ¦C¦L¤¤: ²Ä %d ­¶ (%d%%)

source: Copy %d of %d
ko: ���� %d / %d
pl: Kopia %d z %d
zh_tw: ½Æ»s %d / %d

source: Printed: %s
ko: �μ���: %s
pl: Wydrukowano: %s
zh_tw: ¤w¦C¦L: %s

source: Printing aborted
ko: �μⰡ ���ҵǾ����ϴ�.
pl: Drukowanie odwo³ane
zh_tw: ¤w¨ú®ø¦C¦L

source: E455: Error writing to PostScript output file
ko: E455: ����Ʈ��ũ��Ʈ �������Ͽ� �� �� �����ϴ�.
pl: E455: Nie mo¿na zapisaæ do wyj¶ciowego pliku PostScriptu
zh_tw: E455: µLªk¼g¤J PostScript ¿é¥XÀÉ

source: E624: Can't open file "%s"
ko: E624: "%s" ������ �� �� �����ϴ�
pl: E624: Nie mogê otworzyæ pliku "%s"
zh_tw: E624: µLªk¶}±ÒÀÉ®× "%s"

source: E457: Can't read PostScript resource file "%s"
ko: E457: ����Ʈ��ũ��Ʈ ���ҽ� ���� "%s"��(��) ���� �� �����ϴ�
pl: E457: Nie mo¿na odczytaæ pliku zasobów PostScriptu "%s"
zh_tw: E457: µLªkÅª¨ú PostScript ¸ê·½ÀÉ "%s"

source: E618: file "%s" is not a PostScript resource file
ko: E618: ���� "%s"��(��) ����Ʈ��ũ��Ʈ ���ҽ� ������ �ƴմϴ�
pl: E618: plik "%s" nie jest plikiem zasobów PostScriptu
zh_tw: E618: ÀÉ®× "%s" ¤£¬O PostScript ¸ê·½ÀÉ

source: E619: file "%s" is not a supported PostScript resource file
ko: E619: ���� "%s"��(��) �����Ǵ� ����Ʈ��ũ��Ʈ ���ҽ� ������ �ƴմϴ�
pl: E619: plik "%s" nie jest wspieranym plikiem zasobów PostScriptu
zh_tw: E619: ¤£¤ä´© PostScript ¸ê·½ÀÉ "%s"

source: E621: "%s" resource file has wrong version
ko: E621: "%s" ���ҽ� ������ ������ �߸��Ǿ����ϴ�
pl: E621: "%s" nieprawid³owa wersja pliku zasobów
zh_tw: E621: "%s" ¸ê·½ÀÉª©¥»¿ù»~

source: E673: Incompatible multi-byte encoding and character set.
ko: E673: ȣȯ���� �ʴ� ���߹��� ���ڵ��� ���ڼ�.
pl: E673: Niekompatybilne kodowanie wielobajtowe i zestaw znaków.

source: E674: printmbcharset cannot be empty with multi-byte encoding.
ko: E674: printmbcharset�� ���߹��� ���ڵ����� �ݵ��� �����Ǿ��� �մϴ�.
pl: E674: printmbcharset nie mo¿e byæ pusty przy kodowaniu wielobajtowym.

source: E675: No default font specified for multi-byte printing.
ko: E675: ���߹��� �μ⸦ ���� �۲��� �����Ǿ� ���� �ʽ��ϴ�
pl: E675: Nie okre¶lono domy¶lnej czcionki dla drukowania wielobajtowego.

source: E324: Can't open PostScript output file
ko: E324: ����Ʈ��ũ��Ʈ ���������� �� �� �����ϴ�
pl: E324: Nie mo¿na otworzyæ pliku PostScript do wyj¶cia
zh_tw: E324: µLªk¶}±Ò PostScript ¿é¥XÀÉ

source: E456: Can't open file "%s"
ko: E456: "%s" ������ �� �� �����ϴ�
pl: E456: Nie mogê otworzyæ pliku "%s"
zh_tw: E456: µLªk¶}±ÒÀÉ®× "%s"

source: E456: Can't find PostScript resource file "prolog.ps"
ko: E456: ����Ʈ��ũ��Ʈ ���ҽ� ���� "prolog.ps"�� ã�� �� �����ϴ�
pl: E456: Nie mo¿na znale¼æ pliku zasobów PostScriptu "prolog.ps"
zh_tw: E456: µLªkÅª¨ú PostScript ¸ê·½ÀÉ "prolog.ps"

source: E456: Can't find PostScript resource file "cidfont.ps"
ko: E456: ����Ʈ��ũ��Ʈ ���ҽ� ���� "cidfont.ps"�� ã�� �� �����ϴ�
pl: E456: Nie mo¿na znale¼æ pliku zasobów PostScriptu "cidfont.ps"

source: E456: Can't find PostScript resource file "%s.ps"
ko: E456: ����Ʈ��ũ��Ʈ ���ҽ� ���� "%s.ps"�� ã�� �� �����ϴ�
pl: E456: Nie mo¿na znale¼æ pliku zasobów PostScriptu "%s.ps"
zh_tw: E456: µLªkÅª¨ú PostScript ¸ê·½ÀÉ "%s.ps"

source: E620: Unable to convert to print encoding "%s"
ko: E620: "%s" �μ� ���ڵ����� ��ȯ�� �� �����ϴ�
pl: E620: Nie mo¿na przekonwertowaæ by drukowaæ kodowanie "%s"

source: Sending to printer...
ko: �����ͷ� ������ ��...
pl: Przesy³am do drukarki...
zh_tw: ¶Ç°e¸ê®Æ¨ì¦Lªí¾÷...

source: E365: Failed to print PostScript file
ko: E365: ����Ʈ��ũ��Ʈ ������ �μ��� �� �����ϴ�
pl: E365: Drukowanie pliku PostScript nie powiod³o siê
zh_tw: E365: µLªk¦C¦L PostScript ÀÉ®×

source: Print job sent.
ko: �μ��۾��� �������ϴ�.
pl: Zadanie drukowanie przes³ane.
zh_tw: ¤w°e¥X¦C¦L¤u§@¡C

source: Add a new database
ko: �� �����ͺ��̽� ���ϱ�
pl: Dodaj now± bazê danych
zh_tw: ·s¼W¸ê®Æ®w

source: Query for a pattern
pl: Zapytane o wzorzec
zh_tw: ¿é¤J pattern

source: Show this message
pl: Poka¿ ten komunikat
zh_tw: Åã¥Ü¦¹°T®§

source: Kill a connection
pl: Zabij po³±czenie
zh_tw: µ²§ô³s½u

source: Reinit all connections
ko: ���� ���� �ٽ� �ʱ�ȭ
pl: Ponów wszelkie po³±czenia
zh_tw: ­«³]©Ò¦³³s½u

source: Show connections
pl: Poka¿ po³±czenia
zh_tw: Åã¥Ü³s½u

source: E560: Usage: cs[cope] %s
ko: E560: ������: cs[cope] %s
pl: E560: Zastosowanie: cs[cope] %s
zh_tw: E560: ¥Îªk: cs[cope] %s

source: This cscope command does not support splitting the window.
ko: �� cscope ������ â �����⸦ �������� �ʽ��ϴ�.
pl: Ta komenda cscope nie wspomaga podzielenia okna.
zh_tw: ³o­Ó cscope ©R¥O¤£¤ä´©¤À³Î¿Ã¹õ

source: E562: Usage: cstag <ident>
ko: E562: ������: cstag <ident>
pl: E562: Zastosowanie: cstag <ident>
zh_tw: E562: ¥Îªk: cstag <ÃÑ§O¦rident>

source: E257: cstag: tag not found
ko: E257: cstag: �±׸� ã�� �� �����ϴ�
pl: E257: cstag: nie znaleziono znacznika
zh_tw: E257: cstag: §ä¤£¨ì tag

source: E563: stat(%s) error: %d
ko: E563: stat(%s) ����: %d
pl: E563: stat(%s) b³±d: %d
zh_tw: E563: stat(%s) ¿ù»~: %d

source: E564: %s is not a directory or a valid cscope database
ko: E564: %s��(��) �����丮�� Ȥ�� cscope �����ͺ��̽��� �ƴմϴ�
pl: E564: %s nie jest katalogiem lub poprawn± baz± danych cscope
zh_tw: E564: %s ¤£¬O¥Ø¿ý©Î cscope ¸ê®Æ®w

source: Added cscope database %s
ko: cscope �����ͺ��̽� %s�� ���߽��ϴ�.
pl: Dodano bazê danych cscope %s
zh_tw: ·s¼W cscope ¸ê®Æ®w %s

source: E262: error reading cscope connection %<PRId64>
ko: E262: cscope ���� %<PRId64> �б� ����
pl: E262: b³±d odczytu po³±czenia z cscope %<PRId64>
zh_tw: E262: Åª¨ú cscope ³s½u %<PRId64> ¿ù»~

source: E561: unknown cscope search type
ko: E561: �𸣴� cscope ã�� ����
pl: E561: nieznany typ szukania cscope
zh_tw: E561: ¥¼ª¾ªº cscope ·j´M§ÎºA

source: E566: Could not create cscope pipes
ko: E566: cscope �������� ���� �� �����ϴ�
pl: E566: Nie mog³em stworzyæ potoku do cscope
zh_tw: E566: µLªk«Ø¥ß»P cscope ªº pipe ³s½u

source: E622: Could not fork for cscope
ko: E622: cscope�� fork�� �� �����ϴ�
pl: E622: Nie mog³em utworzyæ rozwidlenia dla cscope
zh_tw: E622: µLªk fork ¥H°õ¦æ cscope

source: cs_create_connection setpgid failed
pl: nie powiod³o siê setpgid cs_create_connection

source: cs_create_connection exec failed
ko: cs_create_connection ������ �����߽��ϴ�
pl: wykonanie cs_create_connection nie powiod³o siê
zh_tw: cs_create_connection °õ¦æ¥¢±Ñ

source: cs_create_connection: fdopen for to_fp failed
ko: cs_create_connection: to_fp�� ���� fdopen ����
pl: cs_create_connection: fdopen dla to_fp nie powiod³o siê
zh_tw: cs_create_connection: fdopen ¥¢±Ñ (to_fp)

source: cs_create_connection: fdopen for fr_fp failed
ko: cs_create_connection: fr_fp�� ���� fdopen ����
pl: cs_create_connection: fdopen dla fr_fp nie powiod³o siê
zh_tw: cs_create_connection: fdopen ¥¢±Ñ (fr_fp)

source: E623: Could not spawn cscope process
ko: E623: cscope ���μ����� spawn�� �� �����ϴ�
pl: E623: Nie mog³em stworzyæ procesu cscope
zh_tw: E623: µLªk°õ¦æ cscope

source: E567: no cscope connections
ko: E567: cscope ������ �����ϴ�
pl: E567: brak po³±czenia z cscope
zh_tw: E567: ¨S¦³ cscope ³s½u

source: E469: invalid cscopequickfix flag %c for %c
pl: E469: nieprawid³owa flaga cscopequickfix %c dla %c
zh_tw: E469: cscopequickfix ªº flac %c (%c) ¤£¥¿½T

source: E259: no matches found for cscope query %s of %s
pl: E259: brak dopasowañ dla zapytania cscope %s o %s
zh_tw: E259: §ä¤£¨ì²Å¦X cscope ªº·j´M %s / %s

source: cscope commands:
ko: cscope ����:
pl: komendy cscope:
zh_tw: cscope ©R¥O:

source: %-5s: %s%*s (Usage: %s)
ko: %-5s: %s%*s (������: %s)
pl: %-5s: %s%*s (U¿ycie: %s)

source: c: Find functions calling this function d: Find functions called by this function e: Find this egrep pattern f: Find this file g: Find this definition i: Find files #including this file s: Find this C symbol t: Find this text string
ko: c: �� �Լ��� �θ��� �Լ��� ã�� d: �� �Լ��� ���� �ҷ����� �Լ��� ã�� e: �� egrep ���� ã�� f: �� ���� ã�� g: �� ���� ã�� i: �� ������ �����ϴ� ���ϵ� ã�� s: �� C �ɺ� ã�� t: �� ���ڿ� ã��
pl: c: znajd¼ funkcje wywo³uj±ce tê funkcjê d: znajd¼ funkcje wywo³ywane przez tê funkcjê e: znajd¼ ten wzorzec egrep f: znajd¼ ten plik g: znajd¼ tê definicjê i: znajd¼ pliki w³±czaj±ce (#include) ten plik s: znajd¼ ten symbol C t: znajd¼ ten ³añcuch znaków

source: E568: duplicate cscope database not added
ko: E568: �ߺ��� cscope �����ͺ��̽��� �������� �ʾҽ��ϴ�
pl: E568: nie dodano duplikatu bazy danych cscope
zh_tw: E568: ­«½Æªº cscope ¸ê®Æ®w¥¼³Q¥[¤J

source: E261: cscope connection %s not found
ko: E261: cscope ���� %s��(��) ã�� �� �����ϴ�
pl: E261: nie ma po³±czenia %s z cscope
zh_tw: E261: §ä¤£¨ì cscope ³s½u %s

source: cscope connection %s closed
ko: cscope ���� %s��(��) �������ϴ�
pl: po³±czenie %s z cscope zosta³o zamkniête
zh_tw: cscope ³s½u %s ¤wÃö³¬

source: E570: fatal error in cs_manage_matches
ko: E570: cs_manage_matches�� �ɰ��� ����
pl: E570: b³±d krytyczny w cs_manage_matches
zh_tw: E570: cs_manage_matches ÄY­«¿ù»~

source: Cscope tag: %s
ko: Cscope �±�: %s
pl: Znacznik cscope: %s
zh_tw: Cscope ¼ÐÅÒ(tag): %s

source: # line
pl: # wiersz
zh_tw: # ¦æ

source: filename / context / line
ko: ���� �̸� / ���ؽ�Ʈ / ��
pl: nazwa pliku / kontekst / wiersz
zh_tw: ÀÉ¦W / ¤º¤å / ¦æ¸¹

source: E609: Cscope error: %s
ko: E609: Cscope ����: %s
pl: E609: B³±d cscope: %s
zh_tw: E609: Csope ¿ù»~: %s

source: All cscope databases reset
ko: ���� cscope �����ͺ��̽� ����
pl: Wszystkie bazy danych cscope prze³adowano
zh_tw: ­«³]©Ò¦³ cscope ¸ê®Æ®w

source: no cscope connections
ko: cscope ������ �����ϴ�
pl: brak po³±czeñ z cscope
zh_tw: ¨S¦³ cscope ³s½u

source: # pid database name prepend path
ko: # pid �����ͺ��̽� �̸� prepend path
pl: # pid nazwa bazy danych przedsionek tropu
zh_tw: # pid ¸ê®Æ®w¦WºÙ prepend path

source: Unknown option argument
ko: �𸣴� �ɼ� ����
pl: Nieznany argument opcji

source: Too many edit arguments
ko: �ʹ� ���� ���� ����
pl: Zbyt wiele argumentów
zh_tw: ¤Ó¦h½s¿è°Ñ¼Æ

source: Argument missing after
ko: �ڿ� ���ڰ� ����
pl: Brak argumentu po
zh_tw: ¯Ê¤Ö¥²­nªº°Ñ¼Æ:

source: Garbage after option argument
ko: �ɼ� ���� �ڿ� ������ ��
pl: ¦miecie po argumencie opcji

source: Too many "+command", "-c command" or "--cmd command" arguments
ko: �ʹ� ���� "+command" "-c command" Ȥ�� "--cmd command" ����
pl: Zbyt wiele argumentów "+komenda", "-c komenda" lub "--cmd komenda"
zh_tw: ¤Ó¦h "+command" ¡B "-c command" ©Î "--cmd command" °Ñ¼Æ

source: Invalid argument for
pl: Niew³a¶ciwy argument dla
zh_tw: ¤£¥¿½Tªº°Ñ¼Æ:

source: %d files to edit
ko: %d ������ ��ġ��
pl: %d plików do edycji
zh_tw: ÁÙ¦³ %d ­ÓÀÉ®×µ¥«Ý½s¿è

source: Attempt to open script file again: "
ko: ��ũ��Ʈ ������ �ٽ� ������ �õ�: "
pl: Próba ponownego otworzenia pliku skryptu: "
zh_tw: ¸Õ¹Ï¦A¦¸¶}±Ò script ÀÉ: "

source: Cannot open for reading: "
ko: �б� ���� �� �� ����: "
pl: Nie mogê otworzyæ do odczytu: "
zh_tw: µLªk¶}±Ò¥HÅª¨ú: "
