Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: E191: Argument must be a letter or forward/backward quote
ko: E191: ���ڴ� ���ڳ� ��/�� �ο� ��ȣ���� �մϴ�
pl: E191: Argument musi byæ liter± albo cudzys³owem w przód/ty³
zh_tw: E191: °Ñ¼Æ¥²¶·¬O­^¤å¦r¥À©Î¦V«e/«áªº¤Þ¸¹

source: E192: Recursive use of :normal too deep
ko: E192: :normal�� ���� ȣ���� �ʹ� ���� �������ϴ�
pl: E192: Rekursywne zastosowanie :normal za g³êbokie
zh_tw: E192: :normal »¼°j¼h¼Æ¹L²`

source: E194: No alternate file name to substitute for '#'
ko: E194: '#'�� ���� ġȯ�� ��ü ���� �̸��� �����ϴ�
pl: E194: Brak nazwy zamiennego pliku do podstawienia pod '#'
zh_tw: E194: ¨S¦³ '#' ¥i´À¥NªºÀÉ¦W

source: E495: no autocommand file name to substitute for "<afile>"
ko: E495: "<afile>"�� ���� ġȯ�� �ڵ����� ���� �̸��� �����ϴ�
pl: E495: brak nazwy pliku autokomend do podstawienia pod "<afile>"
zh_tw: E495: ¨S¦³ Autocommand ÀÉ¦W¥H¨ú¥N "<afile>"

source: E496: no autocommand buffer number to substitute for "<abuf>"
ko: E496: "<abuf>"�� ���� ġȯ�� �ڵ����� ���� ��ȣ�� �����ϴ�
pl: E496: brak numeru bufora autokomend do podstawienia pod "<abuf>"
zh_tw: E496: ¨S¦³ Autocommand ½w½Ä°Ï¦WºÙ¥H¨ú¥N "<abuf>"

source: E497: no autocommand match name to substitute for "<amatch>"
ko: E497: "<amatch>"�� ���� ġȯ�� �ڵ����� ��ġ �̸��� �����ϴ�
pl: E497: brak nazwy dopasowania autokomend pod "<amatch>"
zh_tw: E497: ¨S¦³ Autocommand ²Å¦X¦WºÙ¥H¨ú¥N "<amatch>"

source: E498: no :source file name to substitute for "<sfile>"
ko: E498: "<sfile>"�� ���� ġȯ�� :source ���� �̸��� �����ϴ�
pl: E498: brak nazwy pliku :source do postawienia pod "<sfile>"
zh_tw: E498: ¨S¦³ :source ÀÉ¦W¥H¨ú¥N "<sfile>"

source: E842: no line number to use for "<slnum>"
ko: E842: "<slnum>"�� ������ �� ��ȣ�� �����ϴ�
pl: E842: brak numeru linii by u¿yæ z "<slnum>"

source: E500: Evaluates to an empty string
ko: E500: �� ���ڿ����� ���� ���Ϸ��� �մϴ�
pl: E500: Wynikiem jest pusty ci±g
zh_tw: E500: ¿é¤J¬°ªÅ¦r¦ê

source: E195: Cannot open viminfo file for reading
ko: E195: ���� viminfo ������ �� �� �����ϴ�
pl: E195: Nie mogê otworzyæ pliku viminfo do odczytu
zh_tw: E195: µLªkÅª¨ú viminfo

source: E608: Cannot :throw exceptions with 'Vim' prefix
ko: E608: 'Vim' ���λ��� ���ܸ� :throw�� �� �����ϴ�
pl: E608: Nie mo¿na ':throw' wyj±tków z prefiksem 'Vim'
zh_tw: E608: ¤£¯à :throw ¥Î 'Vim' ¶}ÀYªº¨Ò¥~

source: Exception thrown: %s
ko: ���� thrown: %s
pl: Wyj±tek: %s
zh_tw: ¥á¥X¨Ò¥~¡G %s

source: Exception finished: %s
ko: ���� ������: %s
pl: Wyj±tek zakoñczony: %s
zh_tw: ¨Ò¥~µ²§ô¡G %s

source: Exception discarded: %s
ko: ���� ������: %s
pl: Wyj±tek odrzucony: %s
zh_tw: ¤w¥á±ó¨Ò¥~¡G %s

source: %s, line %<PRId64>
ko: %s, %<PRId64> ��
pl: %s, wiersz %<PRId64>
zh_tw: %s, ¦æ %<PRId64>

source: Exception caught: %s
ko: ���� �߻�: %s
pl: Wyj±tek przechwycony: %s
zh_tw: µo¥Í¨Ò¥~¡G%s

source: %s made pending
ko: %s��(��) pending �Ǿ����ϴ�
pl: %s zosta³ zawieszony
zh_tw: %s ³y¦¨ pending

source: %s resumed
ko: %s��(��) �簳 �Ǿ����ϴ�
pl: %s przywrócony
zh_tw: %s ¤w¦^´_

source: %s discarded
ko: %s��(��) ���������ϴ�
pl: %s odrzucony
zh_tw: %s ¤w¥á±ó

source: Exception
pl: Wyj±tek
zh_tw: ¨Ò¥~

source: Error and interrupt
ko: ������ ���ͷ�Ʈ
pl: B³±d i przerwanie
zh_tw: ¿ù»~»P¤¤Â_

source: Error
pl: B³±d
zh_tw: ¿ù»~

source: Interrupt
ko: ���ͷ�Ʈ
pl: Przerwanie
zh_tw: ¤¤Â_

source: E579: :if nesting too deep
ko: E579: :if�� �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E579: zbyt g³êbokie zagnie¿d¿enie :if
zh_tw: E579: :if ¼h¼Æ¹L²`

source: E580: :endif without :if
ko: E580: :if���� :endif�� �ֽ��ϴ�
pl: E580: :endif bez :if
zh_tw: E580: :endif ¯Ê¤Ö¹ïÀ³ªº :if

source: E581: :else without :if
ko: E581: :if���� :else�� �ֽ��ϴ�
pl: E581: :else bez :if
zh_tw: E581: :else ¯Ê¤Ö¹ïÀ³ªº :if

source: E582: :elseif without :if
ko: E582: :if���� :elseif�� �ֽ��ϴ�
pl: E582: :elseif bez :if
zh_tw: E582: :elseif ¯Ê¤Ö¹ïÀ³ªº :if

source: E583: multiple :else
ko: E583: �������� :else�� �ֽ��ϴ�
pl: E583: wielokrotne :else
zh_tw: E583: ¦h­« :else

source: E584: :elseif after :else
ko: E584: :else �ڿ� :elseif�� �ֽ��ϴ�
pl: E584: :elseif po :else
zh_tw: E584: :elseif ¦b :else ¤§«á

source: E585: :while/:for nesting too deep
ko: E585: :while/:for�� �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E585: zbyt g³êbokie zagnie¿d¿enie :while/:for

source: E586: :continue without :while or :for
ko: E586: :while Ȥ�� :for���� :continue�� �ֽ��ϴ�
pl: E586: :continue bez :while lub :for

source: E587: :break without :while or :for
ko: E587: :while Ȥ�� :for���� :break�� �ֽ��ϴ�
pl: E587: :break bez :while lub :for

source: E732: Using :endfor with :while
ko: E732: :while�� :endfor�� �����Ǿ����ϴ�
pl: E732: U¿ycie :endfor z :while

source: E733: Using :endwhile with :for
ko: E733: :for�� :endwhile�� �����Ǿ����ϴ�
pl: E733: U¿ycie :endwhile z :for

source: E601: :try nesting too deep
ko: E601: :try�� �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E601: zbyt g³êbokie zagnie¿d¿enie :try
zh_tw: E601: :if ¼h¼Æ¹L²`

source: E603: :catch without :try
ko: E603: :try���� :catch�� �ֽ��ϴ�
pl: E603: :catch bez :try
zh_tw: E603: :catch ¨S¦³ :try

source: E604: :catch after :finally
ko: E604: :finally �ڿ� :catch�� �ֽ��ϴ�
pl: E604: :catch za :finally
zh_tw: E604: :catch ¦b :finally ¤§«á

source: E606: :finally without :try
ko: E606: :try���� :finally�� �ֽ��ϴ�
pl: E606: :finally bez :try
zh_tw: E606: :finally ¨S¦³ :try

source: E607: multiple :finally
ko: E607: �������� :finally�� �ֽ��ϴ�
pl: E607: wielokrotne :finally
zh_tw: E607: ¦h­« :finally

source: E602: :endtry without :try
ko: E602: :try���� :endtry�� �ֽ��ϴ�
pl: E602: :endtry bez :try
zh_tw: E602: :endif ¯Ê¤Ö¹ïÀ³ªº :if

source: E193: :endfunction not inside a function
ko: E193: :endfunction�� function ���� �����ϴ�
pl: E193: :endfunction poza funkcj±
zh_tw: E193: :endfunction ¥²¶·¦b¨ç¦¡¤º³¡¨Ï¥Î

source: E788: Not allowed to edit another buffer now
ko: E788: ������ �ٸ� ���۸� ������ �� �����ϴ�
pl: E788: Nie mo¿na teraz edytowaæ innego bufora

source: E811: Not allowed to change buffer information now
ko: E811: ������ ���� ������ �ٲ� �� �����ϴ�
pl: E811: Nie mo¿na teraz zmieniaæ informacji o buforze

source: tagname
pl: nazwa znacznika
zh_tw: ¼ÐÅÒ¦WºÙ

source: kind file
pl: pokrewny plik
zh_tw: ÃþÀÉ®×

source: 'history' option is zero
ko: 'history' �ɼ��� 0�Դϴ�
pl: opcja 'history' jest zerowa
zh_tw: ¿ï¶µ 'history' ¬O¹s

source: # %s History (newest to oldest):
ko: # %s �����丮 (���ͺ��� ������ �� ��):
pl: # %s Historia (od najnowszych po najstarsze):
zh_tw: # %s ¾ú¥v°O¿ý (·s¨ìÂÂ):

source: Command Line
pl: Wiersz poleceñ
zh_tw: ©R¥O¦C

source: Search String
ko: ã�� ���ڿ�
pl: Szukany ci±g
zh_tw: ·j´M¦r¦ê

source: Expression
ko: ǥ��
pl: Wyra¿enie
zh_tw: ¹Bºâ¦¡

source: Input Line
ko: �Է� ��
pl: Wiersz wprowadzeñ
zh_tw: ¿é¤J¦æ

source: E198: cmd_pchar beyond the command length
ko: E198: cmd_pchar�� ���� ���̸� ������ϴ�
pl: E198: cmd_pchar przekracza d³ugo¶æ polecenia
zh_tw: E198: cmd_pchar ¶W¹L©R¥Oªø«×

source: E199: Active window or buffer deleted
ko: E199: Ȱ���� â�̳� ���۰� ���������ϴ�
pl: E199: Aktywny widok lub bufor skasowany
zh_tw: E199: ¤w§R°£±¼§@¥Î¤¤ªºµøµ¡©Î¼È¦s°Ï

source: E854: path too long for completion
pl: E854: ¶cie¿ka za d³uga by uzupe³niæ

source: E343: Invalid path: '**[number]' must be at the end of the path or be followed by '%s'.
ko: E343: �߸��� ����: '**[��ȣ]'�� ������ ���򸷿� ��ġ�ϰų� '%s' �ڿ� �־��� �մϴ�.
pl: E343: Niew³a¶ciwy trop: '**[numer]' musi byæ na koñcu tropu lub po nim musi byæ '%s'.
zh_tw: E343: ¤£¥¿½Tªº¸ô®|: '**[number]' ¥²»Ý­n¦b¸ô®|µ²§À©Î­n±µµÛ '%s'

source: E344: Can't find directory "%s" in cdpath
ko: E344: cdpath���� "%s" �����丮�� ã�� �� �����ϴ�
pl: E344: Nie mogê znale¼æ katalogu "%s" w cdpath
zh_tw: E344: cdpath ¤¤¨S¦³¥Ø¿ý "%s"

source: E345: Can't find file "%s" in path
ko: E345: path���� "%s" ������ ã�� �� �����ϴ�
pl: E345: Nie mogê znale¼æ pliku "%s" w tropie
zh_tw: E345: ¦b¸ô®|¤¤§ä¤£¨ìÀÉ®× "%s"

source: E346: No more directory "%s" found in cdpath
ko: E346: cdpath���� �� �̻��� "%s" �����丮�� ã�� �� �����ϴ�
pl: E346: Katalogu "%s" nie ma wiêcej w cdpath
zh_tw: E346: ¦b¸ô®|¤¤§ä¤£¨ì§ó¦hªºÀÉ®× "%s"

source: E347: No more file "%s" found in path
ko: E347: path���� �� �̻��� "%s" ������ ã�� �� �����ϴ�
pl: E347: Pliku "%s" nie ma wiêcej w tropie
zh_tw: E347: ¦b¸ô®|¤¤§ä¤£¨ì§ó¦hªºÀÉ®× "%s"

source: E812: Autocommands changed buffer or buffer name
ko: E812: Autocommand�� ���۳� �����̸��� �ٲپ����ϴ�
pl: E812: Autokomendy zmieni³y bufor lub jego nazwê

source: Illegal file name
pl: Niedopuszczalna nazwa pliku
zh_tw: ¤£¥¿½TªºÀÉ¦W

source: is a directory
ko: ��(��) �����丮�Դϴ�
pl: jest katalogiem
zh_tw: ¬O¥Ø¿ý

source: is not a file
ko: ��(��) ������ �ƴմϴ�
pl: nie jest plikiem
zh_tw: ¤£¬OÀÉ®×

source: [New File]
pl: [Nowy Plik]
zh_tw: [¥¼©R¦W]

source: [New DIRECTORY]
ko: [�� �����丮]
pl: [Nowy KATALOG]

source: [File too big]
ko: [������ �ʹ� ŭ]
pl: [Za du¿y plik]

source: [Permission Denied]
ko: [���� �� �˴ϴ�]
pl: [Nie dozwolono]
zh_tw: [Åv­­¤£¨¬]

source: E200: *ReadPre autocommands made the file unreadable
ko: E200: *ReadPre �ڵ������� ������ ���� ���ϰ� ���������ϴ�
pl: E200: Autokomendy *ReadPre zrobi³y plik nieodczytywalnym
zh_tw: E200: *ReadPre Autocommand ¨Ïµ{¦¡µLªkÅª¨ú¦¹ÀÉ

source: E201: *ReadPre autocommands must not change current buffer
ko: E201: *ReadPre �ڵ������� ���� ���۸� �ٲٸ� �� �˴ϴ�
pl: E201: Autokomendy *ReadPre nie mog± zmieniaæ bie¿±cego bufora
zh_tw: E201: *Filter* Autocommand ¤£¥i¥H§ó§ï½w½Ä°Ïªº¤º®e

source: Vim: Reading from stdin...
ko: ��: ǥ���Է¿��� �д� ��...
pl: Vim: Wczytywanie ze stdin...
zh_tw: Vim: ±q¼Ð·Ç¿é¤JÅª¨ú...

source: E202: Conversion made file unreadable!
ko: E202: ��ȯ�� ������ ���� ���� �����ϴ�!
pl: E202: Nie mo¿na otworzyæ pliku utworzonego przez przemianê!
zh_tw: E202: Âà´«¿ù»~

source: [character special]
pl: [specjalny znak]

source: [CR missing]
ko: [CR ����]
pl: [brak CR]'
zh_tw: [¯Ê¤ÖCR]'

source: [long lines split]
pl: [d³ugie wiersze rozdzielane]
zh_tw: [¤À³Î¹Lªø¦æ]

source: [NOT converted]
ko: [��ȯ �� �˴ϴ�]
pl: [NIE przemienione]
zh_tw: [¥¼Âà´«]

source: [converted]
ko: [��ȯ �Ǿ����ϴ�]
pl: [przemienione]
zh_tw: [¤wÂà´«]

source: [CONVERSION ERROR in line %<PRId64>]
ko: [%<PRId64> �ٿ��� ��ȯ ����]
pl: [B£¡D W PRZEMIANIE w linii %<PRId64>]

source: [ILLEGAL BYTE in line %<PRId64>]
ko: [%<PRId64> �ٿ� �߸��� ����Ʈ]
pl: [NIEDOZWOLONY BAJT w wierszu %<PRId64>]
zh_tw: [¦æ %<PRId64> ¦³¤£¥¿½Tªº¦ì¤¸]

source: [READ ERRORS]
ko: [�б� ����]
pl: [B£ÊDY W ODCZYCIE]
zh_tw: [Åª¨ú¿ù»~]

source: Can't find temp file for conversion
ko: ��ȯ�ϱ� ���� �ӽ� ������ ã�� �� �����ϴ�
pl: Nie mogê znale¼æ pliku tymczasowego w celu przemiany
zh_tw: §ä¤£¨ìÂà´«¥Îªº¼È¦sÀÉ

source: Conversion with 'charconvert' failed
ko: 'charconvert'�� ������ ��ȯ�� �����߽��ϴ�
pl: Nieudana przemiana z 'charconvert'
zh_tw: ¦r¤¸¶°Âà´«¿ù»~

source: can't read output of 'charconvert'
ko: 'charconvert'�� ���°����� ���� �� �����ϴ�
pl: nie mogê odczytaæ wyj¶cia z 'charconvert'
zh_tw: µLªkÅª¨ú 'charconvert' ªº¿é¥X

source: E676: No matching autocommands for acwrite buffer
ko: E676: acwrite ���ۿ� ���� autocommand�� ã�� �� �����ϴ�
pl: E676: Brak pasuj±cych autokomend dla bufora acwrite

source: E203: Autocommands deleted or unloaded buffer to be written
ko: E203: �� ���۸� �ڵ������� �����ų� �ݾҽ��ϴ�
pl: E203: Autokomendy skasowa³y lub wy³adowa³y bufor przeznaczony do zapisu
zh_tw: E203: Autocommand §R°£©ÎÄÀ©ñ¤F­n¼g¤Jªº½w½Ä°Ï

source: E204: Autocommand changed number of lines in unexpected way
ko: E204: Autocommand�� �߸��� �������� ���� �ٲپ����ϴ�
pl: E204: Autokomenda zmieni³a liczbê wierszy w nieoczekiwany sposób
zh_tw: E204: Autocommand ·N¥~¦a§ïÅÜ¤F¦æ¸¹

source: is not a file or writable device
ko: ���� Ȥ�� �� �� �ִ� ��ġ�� �ƴմϴ�
pl: nie jest plikiem lub zapisywalnym przyrz±dem
zh_tw: ¤£¬OÀÉ®×©Î¥i¼g¤Jªº¸Ë¸m

source: is read-only (add ! to override)
ko: �б� �����Դϴ� (������� ! ���ϱ�)
pl: jest tylko do odczytu (wymu¶ poprzez !)
zh_tw: ¬O°ßÅªÀÉ (½Ð¨Ï¥Î ! ±j¨î°õ¦æ)

source: E506: Can't write to backup file (add ! to override)
ko: E506: ���������� �� �� �����ϴ� (������� ! ���ϱ�)
pl: E506: Nie mogê zapisaæ do pliku zabezpieczenia (wymu¶ przez !)
zh_tw: E506: µLªk¼g¤J³Æ¥÷ÀÉ (½Ð¨Ï¥Î ! ±j¨î°õ¦æ)

source: E507: Close error for backup file (add ! to override)
ko: E507: �������� �ݱ� ���� (������� ! ���ϱ�)
pl: E507: B³±d podczas zamykania pliku zabezpieczenia (wymu¶ przez !)
zh_tw: E507: µLªkÃö³¬³Æ¥÷ÀÉ (½Ð¨Ï¥Î ! ±j¨î°õ¦æ)

source: E508: Can't read file for backup (add ! to override)
ko: E508: ������ ������ ���� �� �����ϴ� (������� ! ���ϱ�)
pl: E508: Nie mogê odczytaæ pliku w celu zabezpieczenia (wymu¶ przez !)
zh_tw: E508: µLªkÅª¨úÀÉ®×¥H¨Ñ³Æ¥÷ (½Ð¨Ï¥Î ! ±j¨î°õ¦æ)

source: E509: Cannot create backup file (add ! to override)
ko: E509: ���������� ���� �� �����ϴ� (������� ! ���ϱ�)
pl: E509: Nie mogê stworzyæ pliku zabezpieczenia (wymu¶ przez !)
zh_tw: E509: µLªk«Ø¥ß³Æ¥÷ÀÉ (½Ð¨Ï¥Î ! ±j¨î°õ¦æ)

source: E510: Can't make backup file (add ! to override)
ko: E510: ���������� ���� �� �����ϴ� (������� ! ���ϱ�)
pl: E510: Nie mogê zrobiæ pliku zabezpieczenia (wymu¶ przez !)
zh_tw: E510: µLªk»s§@³Æ¥÷ÀÉ (½Ð¨Ï¥Î ! ±j¨î°õ¦æ)

source: E214: Can't find temp file for writing
ko: E214: �� �ӽ� ������ ã�� �� �����ϴ�
pl: E214: Nie mogê znale¼æ pliku tymczasowego do zapisania
zh_tw: E214: §ä¤£¨ì¼g¤J¥Îªº¼È¦sÀÉ

source: E213: Cannot convert (add ! to write without conversion)
ko: E213: ��ȯ�� �� �����ϴ� (��ȯ ���� �����Ϸ��� ! ���ϱ�)
pl: E213: Nie mogê przemieniæ (u¿yj ! by zapisaæ bez przemiany)
zh_tw: E213: µLªkÂà´« (½Ð¨Ï¥Î ! ±j¨î¤£Âà´«¼g¤J)

source: E166: Can't open linked file for writing
ko: E166: �� ������ ������ �� �� �����ϴ�
pl: E166: Nie mogê otworzyæ pod³±czonego pliku do zapisu
zh_tw: E166: µLªk¥H¼g¤J¼Ò¦¡¶}±Ò³sµ²ÀÉ®×

source: E212: Can't open file for writing
ko: E212: �� ������ �� �� �����ϴ�
pl: E212: Nie mogê otworzyæ pliku do zapisu
zh_tw: E212: µLªk¥H¼g¤J¼Ò¦¡¶}±Ò

source: E667: Fsync failed
ko: E667: Fsync�� �����߽��ϴ�
pl: E667: Fsync nie powiód³ siê
zh_tw: E667: Fsync ©R¥O°õ¦æ¥¢±Ñ

source: E512: Close failed
ko: E512: �ݱⰡ �����߽��ϴ�
pl: E512: Zamkniêcie siê nie powiod³o
zh_tw: E512: Ãö³¬¥¢±Ñ

source: E513: write error, conversion failed (make 'fenc' empty to override)
ko: E513: ���� ����, ��ȯ ���� (�����Ϸ��� 'fenc'�� ������ ��)
pl: E513: B³±d zapisu, przemiana siê nie powiod³a (opró¿nij 'fenc' aby wymusiæ)

source: E513: write error, conversion failed in line %<PRId64> (make 'fenc' empty to override)
ko: E513: ���� ����, %<PRId64> �ٿ��� ��ȯ ���� (�����Ϸ��� 'fenc'�� ������ ��)
pl: E513: B³±d zapisu, przemiana siê nie powiod³a w wierszu %<PRId64> (opró¿nij 'fenc' by wymusiæ)

source: E514: write error (file system full?)
ko: E514: ���� ���� (���� �ý����� ��á����?)
pl: E514: b³±d w zapisie (mo¿e system plików jest przepe³niony?)
zh_tw: E514: ¼g¤J¿ù»~ (ÀÉ®×¨t²Î¤wº¡¡H)

source: CONVERSION ERROR
ko: ��ȯ ����
pl: B£¡D W PRZEMIANIE
zh_tw: Âà´«¿ù»~

source: in line %<PRId64>;
ko: %<PRId64> �ٿ���;
pl: w wierszu %<PRId64>;

source: [Device]
ko: [��ġ]
pl: [Urz±dzenie]
zh_tw: [¸Ë¸m]

source: [New]
ko: [���ο�]
pl: [Nowy]
zh_tw: [·s]

source: appended
ko: ���߽��ϴ�
pl: do³±czono
zh_tw: ¤wªþ¥[

source: written
ko: ���� �߽��ϴ�
pl: zapisano
zh_tw: ¤w¼g¤J

source: E205: Patchmode: can't save original file
ko: E205: ��ġ ����: ���� ������ ������ �� �����ϴ�
pl: E205: Patchmode: nie mogê zapisaæ oryginalnego pliku
zh_tw: E205: Patch ¼Ò¦¡: µLªkÀx¦s­ì©lÀÉ®×

source: E206: patchmode: can't touch empty original file
ko: E206: ��ġ ����: �� ���� ������ ���� �� �����ϴ�
pl: E206: patchmode: nie mogê stworzyæ pustego oryginalnego pliku
zh_tw: E206: Patch ¼Ò¦¡: µLªkÅÜ§óªÅªº­ì©lÀÉ®×

source: E207: Can't delete backup file
ko: E207: ���� ������ ���� �� �����ϴ�
pl: E207: Nie mogê skasowaæ pliku zabezpieczenia
zh_tw: E207: µLªk§R°£³Æ¥÷ÀÉ

source: WARNING: Original file may be lost or damaged
ko: ����: ���� ������ �������ų� ������ �� �ֽ��ϴ�
pl: OSTRZE¯ENIE: Oryginalny plik mo¿e zostaæ utracony lub uszkodzony
zh_tw: Äµ§i: ­ì©lÀÉ®×¬y¥¢©Î·lÃa

source: don't quit the editor until the file is successfully written!
ko: ������ ���������� ������ ������ �����⸦ ������ ���ʽÿ�!
pl: nie wychod¼ edytora, dopóki plik nie zosta³ poprawnie zapisany!
zh_tw: ¦bÀÉ®×¥¿½T¼g¤J«e½Ð¤ÅÂ÷¶}½s¿è¾¹!

source: [dos format]
pl: [format dos-a]
zh_tw: [dos ®æ¦¡]

source: [mac format]
pl: [format maca]
zh_tw: [mac ®æ¦¡]

source: [unix format]
ko: [���н� ����]
pl: [format unixa]
zh_tw: [unix ®æ¦¡]

source: 1 line,
pl: 1 wiersz,
zh_tw: 1 ¦æ,

source: %<PRId64> lines,
ko: %<PRId64> ��,
pl: %<PRId64> wierszy,
zh_tw: %<PRId64> ¦æ,

source: 1 character
pl: 1 znak
zh_tw: ¤@­Ó¦r¤¸

source: %<PRId64> characters
ko: %<PRId64> ����
pl: %<PRId64> znaków
zh_tw: %<PRId64>­Ó¦r¤¸

source: [Incomplete last line]
ko: [�ҿ����� ������ ��]
pl: [Niekompletny ostatni wiersz]
zh_tw: [µ²§À¦æ¤£§¹¾ã]

source: WARNING: The file has been changed since reading it!!!
ko: ����: ������ ���� �ڿ� �ٲ������ϴ�!!!
pl: OSTRZE¯ENIE: Plik zmieni³ siê od czasu ostatniego odczytu!!!
zh_tw: Äµ§i: ¥»ÀÉ®×¦Û¤W¦¸Åª¤J«á¤wÅÜ°Ê!!!

source: Do you really want to write to it
ko: ������ ���⸦ ���Ͻʴϱ�
pl: Czy naprawdê chcesz go zapisaæ
zh_tw: ½T©w­n¼g¤J¶Ü

source: E208: Error writing to "%s"
ko: E208: "%s"�� ���� ����
pl: E208: B³±d zapisywania do "%s"
zh_tw: E208: ¼g¤JÀÉ®× "%s" ¿ù»~

source: E209: Error closing "%s"
ko: E209: "%s" �ݱ� ����
pl: E209: B³±d w trakcie zamykania "%s"
zh_tw: E209: Ãö³¬ÀÉ®× "%s" ¿ù»~

source: E210: Error reading "%s"
ko: E210: "%s" �б� ����
pl: E210: B³±d odczytu "%s"
zh_tw: E210: Åª¨úÀÉ®× "%s" ¿ù»~

source: E246: FileChangedShell autocommand deleted buffer
ko: E246: FileChangedShell �ڵ������� ���۸� �������ϴ�
pl: E246: Autokomenda FileChangedShell skasowa³a bufor
zh_tw: E246: FileChangedShell autocommand §R°£½w½Ä°Ï

source: E211: File "%s" no longer available
ko: E211: ���� "%s"��(��) �� �̻� ������ �� �����ϴ�
pl: E211: Plik "%s" nie jest d³u¿ej dostêpny

source: W12: Warning: File "%s" has changed and the buffer was changed in Vim as well
ko: W12: ����: ���� "%s"��(��) �ٲ����� ���������� ���� ���۵� �ٲ������ϴ�
pl: W12: OSTRZE¯ENIE: Plik "%s" zmieni³ siê od czasu rozpoczêcia edycji, bufor w Vimie równie¿ zosta³ zmieniony
zh_tw: W12: Äµ§i: ÀÉ®× "%s" ¦Û¤W¦¸Åª¤J«á¤wÅÜ°Ê, ¦Ó¥B½s¿è¤¤ªº½w½Ä°Ï¤]§ó°Ê¤F

source: See ":help W12" for more info.
ko: �� ���� ������ ������ ":help W12"�� �Է��ϼ���.
pl: Zobacz ":help W12" dla dalszych informacji.

source: W11: Warning: File "%s" has changed since editing started
ko: W11: ����: ���� "%s"��(��) ��ġ�� ������ �ڿ� �ٲ������ϴ�
pl: W11: OSTRZE¯ENIE: Plik "%s" zmieni³ siê od czasu rozpoczêcia edycji
zh_tw: W11: Äµ§i: ÀÉ®× "%s" ¦Û¤W¦¸Åª¤J«á¤wÅÜ°Ê

source: See ":help W11" for more info.
ko: �� ���� ������ ������ ":help W11"�� �Է��ϼ���.
pl: Zobacz ":help W11" dla dalszych informacji.
zh_tw: ¶i¤@¨B»¡©ú½Ð¨£ ":help W11"¡C

source: W16: Warning: Mode of file "%s" has changed since editing started
ko: W16: ����: ���� "%s"�� ���°� ��ġ�� ������ �ڿ� �ٲ������ϴ�
pl: W16: OSTRZE¯ENIE: Tryb pliku "%s" zmieni³ siê od czasu rozpoczêcia edycji
zh_tw: W16: Äµ§i: ÀÉ®× "%s" ªºÅv­­»P¤W¦¸Åª¤J®É¤£¤@¼Ë (¦³ÅÜ°Ê¹L)

source: See ":help W16" for more info.
ko: �� ���� ������ ������ ":help W16"�� �Է��ϼ���.
pl: Zobacz ":help W16" dla dalszych informacji.

source: W13: Warning: File "%s" has been created after editing started
ko: W13: ����: ���� "%s"��(��) ��ġ�� ������ �ڿ� ���������ϴ�
pl: W13: OSTRZE¯ENIE: Plik "%s" zosta³ stworzony po rozpoczêciu edycji
zh_tw: W13: Äµ§i: ÀÉ®× "%s" ¦b¶}©l½s¿è«á¤S³Q«Ø¥ß¤F

source: Warning
pl: OSTRZE¯ENIE
zh_tw: Äµ§i

source: &OK &Load File
ko: Ȯ��(&O) ���� �ҷ�����(&L)
pl: &OK &Za³aduj Plik
zh_tw: ½T©w(&O) ¸ü¤JÀÉ®×(&L)

source: E462: Could not prepare for reloading "%s"
ko: E462: "%s"�� ���ε带 �غ��� �� �����ϴ�
pl: E462: Nie mo¿na przygotowaæ prze³adowania "%s"
zh_tw: E462: µLªk·Ç³Æ­«·s¸ü¤J "%s"

source: E321: Could not reload "%s"
ko: E321: "%s"��(��) �ٽ� �ε��� �� �����ϴ�
pl: E321: Nie mo¿na prze³adowaæ "%s"
zh_tw: E321: µLªk­«·s¸ü¤J "%s"

source: --Deleted--
pl: --Skasowano--
zh_tw: --¤w§R°£--

source: auto-removing autocommand: %s <buffer=%d>
ko: autocommand �ڵ�����: %s <buffer=%d>
pl: auto-usuwanie autokomendy: %s <buffer=%d>

source: E367: No such group: "%s"
ko: E367: �̷� �׷� ����: "%s"
pl: E367: Nie ma takiej grupy: "%s"
zh_tw: E367: µL¦¹¸s²Õ: "%s"

source: E215: Illegal character after *: %s
ko: E215: * �ڿ� �̻��� ����: %s
pl: E215: Niedopuszczalny znak po *: %s
zh_tw: E215: * «á­±¦³¤£¥¿½Tªº¦r¤¸: %s

source: E216: No such event: %s
ko: E216: �׷� �̺�Ʈ ����: %s
pl: E216: Nie ma takiego wydarzenia: %s
zh_tw: E216: µL¦¹¨Æ¥ó: %s

source: E216: No such group or event: %s
ko: E216: �׷� �׷��̳� �̺�Ʈ ����: %s
pl: E216: Nie ma takiej grupy lub wydarzenia: %s
zh_tw: E216: µL¦¹¸s²Õ©Î¨Æ¥ó: %s

source: --- Auto-Commands ---
ko: --- �ڵ�-���� ---
pl: --- Autokomendy ---

source: E680: <buffer=%d>: invalid buffer number
ko: E680: <buffer=%d>: �߸��� ���� ��ȣ
pl: E680: <buffer=%d>: niew³a¶ciwy numer bufora

source: E217: Can't execute autocommands for ALL events
ko: E217: ALL �̺�Ʈ�� ���� �ڵ������� ������ �� �����ϴ�
pl: E217: Nie mo¿na wykonywaæ autokomend dla wydarzeñ ALL
zh_tw: E217: µLªk¹ï©Ò¦³¨Æ¥ó°õ¦æ autocommand

source: No matching autocommands
ko: �´� �ڵ������� �����ϴ�
pl: Brak pasuj±cych autokomend
zh_tw: §ä¤£¨ì¹ïÀ³ªº autocommand

source: E218: autocommand nesting too deep
ko: E218: �ڵ������� �ʹ� ���� ��ø�Ǿ����ϴ�
pl: E218: zbyt g³êbokie zagnie¿d¿enie autokomend
zh_tw: E218: autocommand ¼h¼Æ¹L²`

source: %s Auto commands for "%s"
pl: %s Autokomend dla "%s"
zh_tw: %s Auto commands: "%s"

source: Executing %s
ko: %s ������
pl: Wykonujê %s
zh_tw: °õ¦æ %s

source: autocommand %s
ko: �ڵ����� %s
pl: autokomenda %s

source: E219: Missing {.
ko: E219: {�� �����ϴ�.
pl: E219: Brak {.
zh_tw: E219: ¯Ê¤Ö {.

source: E220: Missing }.
ko: E220: }�� �����ϴ�.
pl: E220: Brak }.
zh_tw: E220: ¯Ê¤Ö }.

source: E490: No fold found
ko: E490: fold�� �����ϴ�
pl: E490: Nie znaleziono zwiniêcia
zh_tw: E490: §ä¤£¨ì¥ô¦ó fold

source: E350: Cannot create fold with current 'foldmethod'
ko: E350: ������ 'foldmethod'���� ���⸦ ���� �� �����ϴ�
pl: E350: Nie mo¿na utworzyæ zwiniêcia przy bie¿±cej 'foldmethod'
zh_tw: E350: µLªk¦b¥Ø«eªº 'foldmethod' ¤U«Ø¥ß fold

source: E351: Cannot delete fold with current 'foldmethod'
ko: E351: ������ 'foldmethod'���� ���⸦ ���� �� �����ϴ�
pl: E351: Nie mo¿na skasowaæ zwiniêcia przy bie¿±cej 'foldmethod'
zh_tw: E351: µLªk¦b¥Ø«eªº 'foldmethod' ¤U§R°£ fold

source: +--%3ld lines folded
ko: +--%3ld �� ����
pl: +--%3ld wierszy zwiniêto
zh_tw: +--¤w fold %3ld ¦æ

source: E222: Add to read buffer
ko: E222: ������ ���ۿ� ���ϱ�
pl: E222: Dodaj do bufora odczytu
zh_tw: E222: ¥[¤JÅª¨ú½w½Ä°Ï¤¤

source: E223: recursive mapping
ko: E223: ���� ����
pl: E223: rekursywne przyporz±dkowanie
zh_tw: E223: »¼°j mapping

source: E224: global abbreviation already exists for %s
ko: E224: %s ���� ��� �̹� �����մϴ�
pl: E224: istnieje ju¿ globalny skrót dla %s
zh_tw: E224: %s ¤w¸g¦³¥þ°ì abbreviation ¤F

source: E225: global mapping already exists for %s
ko: E225: %s ���� ������ �̹� �����մϴ�
pl: E225: istnieje ju¿ globalne przyporz±dkowanie dla %s
zh_tw: E225: %s ¤w¸g¦³¥þ°ì mapping ¤F

source: E226: abbreviation already exists for %s
ko: E226: %s ��� �̹� �����մϴ�
pl: E226: istnieje ju¿ skrót dla %s
zh_tw: E226: %s ¤w¸g¦³ abbreviation ¤F

source: E227: mapping already exists for %s
ko: E227: %s ������ �̹� �����մϴ�
pl: E227: istnieje ju¿ przyporz±dkowanie dla %s
zh_tw: E227: %s ªº mapping ¤w¸g¦s¦b

source: No abbreviation found
ko: ��� ã�� �� �����ϴ�
pl: Nie znaleziono skrótu
zh_tw: §ä¤£¨ì abbreviation

source: No mapping found
ko: ������ ã�� �� �����ϴ�
pl: Nie znaleziono przyporz±dkowania
zh_tw: ¨S¦³³o­Ó mapping ¹ïÀ³

source: E228: makemap: Illegal mode
ko: E228: makemap: �̻��� ����
pl: E228: makemap: Niedopuszczalny tryb
zh_tw: E228: makemap: ¤£¥¿½Tªº¼Ò¦¡

source: --No lines in buffer--
ko: --���ۿ� �� ����--
pl: --Brak wierszy w buforze--
zh_tw: --½w½Ä°ÏµL¸ê®Æ--

source: E470: Command aborted
ko: E470: ������ �����Ǿ����ϴ�
pl: E470: Przerwanie komendy
zh_tw: E470: ©R¥O³Q±j¨î¤¤Â_°õ¦æ

source: E471: Argument required
ko: E471: ���ڰ� �ʿ��մϴ�
pl: E471: wymagany argument
zh_tw: E471: »Ý­n«ü¥O°Ñ¼Æ
