Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: E435: Couldn't find tag, just guessing!
ko: E435: �±׸� ã�� �� ������ �̰� �����ϴ�!
pl: E435: Nie znalaz³em znacznika - tylko zgadujê!
zh_tw: E435: §ä¤£¨ì tag, ¥Î²qªº!

source: Duplicate field name: %s
ko: �ߺ��� �ʵ� ��: %s
pl: Powtórzona nazwa pola: %s

source: ' not known. Available builtin terminals are:
pl: ' nieznany. Mo¿liwe typy wbudowanych terminali:
zh_tw: ' µLªk¸ü¤J¡C¥i¥Îªº¤º«Ø²×ºÝ¾÷§Î¦¡¦³:

source: defaulting to '
pl: domy¶lnie jest '
zh_tw: ¹w³]: '

source: E557: Cannot open termcap file
ko: E557: termcap ������ �� �� �����ϴ�
pl: E557: Nie mogê otworzyæ pliku termcap
zh_tw: E557: µLªk¶}±Ò termcap ÀÉ®×

source: E558: Terminal entry not found in terminfo
ko: E558: �͹̳� �׸��� terminfo���� ã�� �� �����ϴ�
pl: E558: Nie ma opisu takiego terminala w terminfo
zh_tw: E558: terminfo ¤¤¨S¦³²×ºÝ¾÷¸ê®Æ¶µ

source: E559: Terminal entry not found in termcap
ko: E559: �͹̳� �׸��� termcap���� ã�� �� �����ϴ�
pl: E559: Nie ma opisu takiego terminala w termcap
zh_tw: E559: termcap ¤¤¨S¦³²×ºÝ¾÷¸ê®Æ¶µ

source: E436: No "%s" entry in termcap
ko: E436: termcap�� "%s" �׸��� �����ϴ�
pl: E436: Brak opisu "%s" w termcap
zh_tw: E436: termcap ¨S¦³ "%s" entry

source: E437: terminal capability "cm" required
ko: E437: �͹̳��� "cm" ������ �����ؾ� �մϴ�
pl: E437: wymagana zdolno¶æ "cm" terminala
zh_tw: E437: ²×ºÝ¾÷»Ý­n "cm" ªº¯à¤O

source: --- Terminal keys ---
ko: --- �͹̳� Ű ---
pl: --- Klawisze terminala ---
zh_tw: --- ²×ºÝ¾÷«öÁä ---

source: Vim: Error reading input, exiting...
ko: ��: �Է� �д� �� ����, ��������...
pl: Vim: B³±d podczas wczytywania wej¶cia, koñczê...
zh_tw: Vim: Åª¨ú¿é¤J¿ù»~¡AÂ÷¶}¤¤...

source: E828: Cannot open undo file for writing: %s
ko: E828: ���� ���� undo�� �� �� �����ϴ�: %s
pl: E828: Nie mogê otworzyæ do zapisu pliku undo: %s

source: E825: Corrupted undo file (%s): %s
ko: E825: ���� undo ���� (%s): %s
pl: E825: Uszkodzony plik undo (%s): %s

source: Cannot write undo file in any directory in 'undodir'
ko: 'undodir'�� �ִ� � �����丮���� undo ������ �� �� �����ϴ�
pl: Nie mo¿na zapisaæ pliku undo w ¿adnym katalogu z 'undodir'

source: Will not overwrite with undo file, cannot read: %s
ko: ���� ���� ��� undo ���Ͽ� ��� �� �����ϴ�: %s
pl: Nie nadpiszê plikiem undo, nie mogê odczytaæ: %s

source: Will not overwrite, this is not an undo file: %s
ko: undo ������ �ƴϾ ��� �� �����ϴ�: %s
pl: Nie nadpiszê, to nie jest plik undo: %s

source: Skipping undo file write, nothing to undo
ko: undo�� ������ ��� undo ���� ������ �ǳʶݴϴ�
pl: Pomijam zapis pliku undo, nic do cofniêcia

source: Writing undo file: %s
ko: undo ���� ���� ��: %s
pl: Zapisujê plik undo: %s

source: E829: write error in undo file: %s
ko: E829: undo ���� ���� ����: %s
pl: E829: B³±d zapisu w pliku undo: %s

source: Not reading undo file, owner differs: %s
ko: �����ڰ� �޶��� undo ������ ���� �ʽ��ϴ�: %s
pl: Nie wczytujê pliku undo, inny w³a¶ciciel: %s

source: Reading undo file: %s
ko: undo ���� �д� ��: %s
pl: Wczytujê plik undo: %s

source: E822: Cannot open undo file for reading: %s
ko: E822: �б� ���� undo ������ �� �� �����ϴ�: %s
pl: E822: Nie mogê otworzyæ pliku undo do odczytu: %s

source: E823: Not an undo file: %s
ko: E823: undo ������ �ƴմϴ�: %s
pl: E823: To nie jest plik undo: %s

source: E824: Incompatible undo file: %s
ko: E824: ȣȯ���� �ʴ� undo ����: %s
pl: E824: Niekompatybilny plik undo: %s

source: File contents changed, cannot use undo info
ko: ���� ������ �ٲ��, undo ������ ������ �� �����ϴ�
pl: Zawarto¶æ pliku siê zmieni³a, nie mogê u¿yæ pliku undo

source: Finished reading undo file %s
ko: undo ���� %s��(��) �о��鿴���ϴ�
pl: Skoñczono wczytywanie pliku undo %s

source: Already at oldest change
ko: �� �̻��� ������ �������ϴ�
pl: Ju¿ w miejscu ostatniej zmiany

source: Already at newest change
ko: �� �̻��� ������ �������ϴ�
pl: Ju¿ w miejscu najnowszej zmiany

source: E830: Undo number %<PRId64> not found
ko: E830: Undo ��ȣ %<PRId64>�� ã�� �� �����ϴ�
pl: E830: Nie znaleziono numeru cofniêcia %<PRId64>

source: E438: u_undo: line numbers wrong
ko: E438: u_undo: �߸��� �� ��ȣ
pl: E438: u_undo: niew³a¶ciwe numery wierszy
zh_tw: E438: u_undo: ¦æ¸¹¿ù»~

source: more line
pl: 1 wiersz wiêcej

source: more lines
pl: wiêcej wierszy

source: line less
pl: 1 wiersz mniej

source: fewer lines
pl: mniej wierszy

source: change
pl: 1 zmiana

source: changes
pl: zmiany

source: before
pl: przed

source: after
pl: za

source: Nothing to undo
ko: ������ �� �����ϴ�
pl: Nie ma zmian do cofniêcia

source: number changes when saved
pl: liczba zmiany kiedy zapisano

source: %<PRId64> seconds ago
pl: %<PRId64> sekund temu

source: E790: undojoin is not allowed after undo
ko: E790: undo �ڿ� undojoin�� �� �� �����ϴ�
pl: E790: undojoin nie jest dozwolone po undo

source: E439: undo list corrupt
ko: E439: undo ������ �������ϴ�
pl: E439: uszkodzona lista cofania
zh_tw: E439: ´_­ì¦Cªí·lÃa

source: E440: undo line missing
ko: E440: undo ���� �����ϴ�
pl: E440: brak wiersza cofania
zh_tw: E440: §ä¤£¨ì­n undo ªº¦æ

source: Included patches:
ko: ���Ե� ��ġ:
pl: Zadane ³aty:
zh_tw: ¤Þ¤J­×¥¿:

source: Extra patches:
ko: ������ ��ġ:
pl: Ekstra ³aty:

source: Modified by
pl: Zmieniony przez
zh_tw: ­×§ïªÌ¬°

source: Compiled
pl: Skompilowany
zh_tw: ½sÄ¶

source: by
pl: przez
zh_tw: ªÌ:

source: Huge version
ko: Huge ����
pl: Olbrzymia wersja
zh_tw: ¶W±jª©¥»

source: without GUI.
ko: GUI ����.
pl: bez GUI.
zh_tw: ¤£¨Ï¥Î¹Ï«¬¬É­±¡C

source: Features included (+) or not (-):
ko: ���� (+: ���Ե�, -: ���� �� ��):
pl: Opcje w³±czone (+) lub nie (-):
zh_tw: ¥Ø«e¥i¨Ï¥Î(+)»P¤£¥i¨Ï¥Î(-)ªº¼Ò²Õ¦Cªí:

source: system vimrc file: "
ko: �ý��� vimrc ����: "
pl: vimrc systemu: "
zh_tw: ¨t²Î vimrc ³]©wÀÉ: "

source: user vimrc file: "
ko: ������ vimrc ����: "
pl: vimrc u¿ytkownika: "
zh_tw: ¨Ï¥ÎªÌ­Ó¤H vimrc ³]©wÀÉ: "

source: 2nd user vimrc file: "
ko: ������ �� ��° vimrc ����: "
pl: 2-gi plik vimrc u¿ytkownika: "
zh_tw: ²Ä¤G²Õ­Ó¤H vimrc ÀÉ®×: "

source: 3rd user vimrc file: "
ko: ������ �� ��° vimrc ����: "
pl: 3-ci plik vimrc u¿ytkownika: "
zh_tw: ²Ä¤T²Õ­Ó¤H vimrc ÀÉ®×: "

source: user exrc file: "
ko: ������ exrc ����: "
pl: exrc u¿ytkownika: "
zh_tw: ¨Ï¥ÎªÌ­Ó¤H exrc ³]©wÀÉ: "

source: 2nd user exrc file: "
ko: ������ �� ��° exrc ����: "
pl: 2-gi plik exrc u¿ytkownika: "
zh_tw: ²Ä¤G²Õ¨Ï¥ÎªÌ exrc ÀÉ®×: "

source: fall-back for $VIM: "
pl: odwet dla $VIM-a: "
zh_tw: $VIM ¹w³]­È: "

source: f-b for $VIMRUNTIME: "
pl: f-b dla $VIMRUNTIME: "
zh_tw: $VIMRUNTIME ¹w³]­È: "

source: Compilation:
pl: Kompilacja:
zh_tw: ½sÄ¶¤è¦¡:

source: Linking:
ko: ��ũ:
pl: Konsolidacja:
zh_tw: Ãìµ²¤è¦¡:

source: DEBUG BUILD
pl: KOMPILACJA DEBUG
zh_tw: °£¿ùª©¥»

source: VIM - Vi IMproved
ko: �� - ������ Vi
pl: VIM - Vi rozbudowany

source: version
pl: wersja
zh_tw: ª©¥»

source: by Bram Moolenaar et al.
pl: Autor: Bram Moolenaar i Inni.
zh_tw: ºûÅ@ªÌ: Bram Moolenaar et al.

source: Vim is open source and freely distributable
ko: ���� �ҽ��� ���� �ְ� ��¥�� �����˴ϴ�
pl: Vim jest open source i rozprowadzany darmowo
zh_tw: Vim ¬°¥i¦Û¥Ñ´²§Gªº¶}©ñ­ì©l½X³nÅé

source: Help poor children in Uganda!
ko: �찣�ٿ� ���� ������ ���̸� �����ּ���!
pl: Pomó¿ biednym dzieciom w Ugandzie!
zh_tw: ½ÐÀ°§U¯Q¤z¹Fªº¥i¼¦«Äµ£!

source: type :help iccf<Enter> for information
ko: �̿� ���� ������ ������ :help iccf<����> �Է�
pl: wprowad¼ :help iccf<Enter> dla informacji o tym
zh_tw: ¶i¤@¨B»¡©ú½Ð¿é¤J :help iccf<Enter>

source: type :q<Enter> to exit
ko: �������� :q<����> �Է�
pl: wprowad¼ :q<Enter> zakoñczenie programu
zh_tw: ­nÂ÷¶}½Ð¿é¤J :q<Enter>

source: type :help<Enter> or <F1> for on-line help
ko: �¶��� �������� ������ :help<����> �Ǵ� <F1> �Է�
pl: wprowad¼ :help<Enter> lub <F1> pomoc na bie¿±co
zh_tw: ½u¤W»¡©ú½Ð¿é¤J :help<Enter>

source: type :help version7<Enter> for version info
ko: �� ������ ������ :help version7<����> �Է�
pl: wprowad¼ :help version7<Enter> dla informacji o wersji
zh_tw: ·sª©¥»¸ê°T½Ð¿é¤J :help version7<Enter>

source: Running in Vi compatible mode
pl: Dzia³am w trybie zgodno¶ci z Vi
zh_tw: Vi ¬Û®e¼Ò¦¡

source: type :set nocp<Enter> for Vim defaults
pl: wprowad¼ :set nocp<Enter> warto¶ci domy¶lne Vim-a
zh_tw: ¦pªG­n§¹¥þ¼ÒÀÀ¶Ç²Î Vi ½Ð¿é¤J :set nocp<Enter>

source: type :help cp-default<Enter> for info on this
pl: wprowad¼ :help cp-default<Enter> dla informacji to tym
zh_tw: ¦pªG»Ý­n¹ï Vi ¬Û®e¼Ò¦¡ªº¶i¤@¨B»¡©ú½Ð¿é¤J :help cp-default<Enter>

source: Sponsor Vim development!
ko: �� ������ �Ŀ��� �ּ���!
pl: Sponsoruj rozwój Vima!
zh_tw: ÃÙ§U Vim ªº¶}µo»P¦¨ªø¡I

source: Become a registered Vim user!
ko: �� �����ڷ� �����ϼ���!
pl: Zostañ zarejestrowanym u¿ytkownikiem Vima!
zh_tw: ¦¨¬° Vim ªºµù¥U¨Ï¥ÎªÌ¡I

source: type :help sponsor<Enter> for information
ko: �̿� ���� ������ ������ :help sponsor<����> �Է�
pl: wprowad¼ :help sponsor<Enter> dla informacji
zh_tw: ¸Ô²Ó»¡©ú½Ð¿é¤J :help sponsor<Enter>

source: type :help register<Enter> for information
ko: �̿� ���� ������ ������ :help register<����> �Է�
pl: wprowad¼ :help register<Enter> dla informacji
zh_tw: ¸Ô²Ó»¡©ú½Ð¿é¤J :help register<Enter>

source: menu Help->Sponsor/Register for information
ko: �̿� ���� ������ ������ �޴� ������->Sponsor/Register
pl: menu Pomoc->Sponsoruj/Zarejestruj siê dla informacji
zh_tw: ¸Ô²Ó»¡©ú½Ð¿ï¨ú¿ï³æªº »²§U»¡©ú->ÃÙ§U/µù¥U

source: Already only one window
ko: �̹� �ϳ��� â�� �ֽ��ϴ�
pl: Ju¿ jest tylko jeden widok
zh_tw: ¤w¸g¥u³Ñ¤@­Óµøµ¡¤F

source: E441: There is no preview window
ko: E441: �̸� ���� â�� �����ϴ�
pl: E441: Nie ma okna podgl±du
zh_tw: E441: ¨S¦³¹wÄýµøµ¡

source: E442: Can't split topleft and botright at the same time
ko: E442: �� ���ʰ� �Ʒ� �������� ���ÿ� ���� �� �����ϴ�
pl: E442: Nie mogê rozdzieliæ lewo-górnego i prawo-dolnego jednocze¶nie
zh_tw: E442: ¤£¯à¦P®É¤À³Îµøµ¡¬°¥ª¤W©M¥k¤U¨¤

source: E443: Cannot rotate when another window is split
ko: E443: �ٸ� â�� �������� ������ ȸ���� �� �����ϴ�
pl: E443: Nie mogê przekrêciæ, gdy inne okno jest rozdzielone
zh_tw: E443: ¦³¨ä¥¦¤À³Îµøµ¡®ÉµLªk±ÛÂà

source: E444: Cannot close last window
ko: E444: ������ â�� ���� �� �����ϴ�
pl: E444: Nie mogê zamkn±æ ostatniego okna
zh_tw: E444: ¤£¯àÃö³¬³Ì«á¤@­Óµøµ¡

source: E813: Cannot close autocmd window
ko: E813: autocmd â�� ���� �� �����ϴ�
pl: E813: Nie mo¿na zamkn±æ okna autocmd

source: E814: Cannot close window, only autocmd window would remain
ko: E814: â�� ���� �� ����, autocmd â�� ����
pl: E814: Nie mo¿na zamkn±æ okna, zosta³oby tylko okno autocmd

source: E445: Other window contains changes
ko: E445: �ٸ� â�� �ٲ������ϴ�
pl: E445: Inne okno zawiera zmiany
zh_tw: E445: ¨ä¥¦µøµ¡¦³§ó°Ê¸ê®Æ

source: E446: No file name under cursor
ko: E446: Ŀ�� �ؿ� ���� �̸��� �����ϴ�
pl: E446: Brak nazwy pliku pod kursorem
zh_tw: E446: ´å¼Ð³B¨S¦³ÀÉ¦W

source: [RO]
ko: [�б� ����]
zh_tw: [°ßÅª]

source: &Ok
ko: Ȯ��(&O)
zh_tw: ½T©w(&O)

source: cmd: %s
ko: ����: %s

source: --cmd argument
ko: --cmd ����

source: -c argument
ko: -c ����

source: [unix]
ko: [���н�]
