Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: E126: Missing :endfunction
ko: E126: :endfunction�� �����ϴ�
pl: E126: Brak :endfunction
zh_tw: E126: ¯Ê¤Ö :endfunction

source: E707: Function name conflicts with variable: %s
ko: E707: �Լ����� �������� �浹: %s
pl: E707: Nazwa funkcji jest w konflikcie ze zmienn±: %s

source: E127: Cannot redefine function %s: It is in use
ko: E127: �Լ� %s��(��) �ٽ� ������ �� �����ϴ�: �������Դϴ�
pl: E127: Nie mogê redefiniowaæ funkcji %s: jest w u¿yciu
zh_tw: E127: ¨ç¦¡ %s ¥¿¦b¨Ï¥Î¤¤¡AµLªk­«·s©w¸q

source: E746: Function name does not match script file name: %s
ko: E746: �Լ����� ��ũ��Ʈ ���ϸ��� �ٸ�: %s
pl: E746: Nazwa funkcji nie pasuje do nazwy skryptu: %s

source: E129: Function name required
ko: E129: �Լ� �̸��� �ʿ��մϴ�
pl: E129: Wymagana jest nazwa funkcji
zh_tw: E129: »Ý­n¨ç¦¡¦WºÙ

source: E131: Cannot delete function %s: It is in use
ko: E131: �Լ� %s��(��) ���� �� �����ϴ�: �������Դϴ�
pl: E131: Nie mogê skasowaæ funkcji %s: jest w u¿yciu
zh_tw: E131: ¨ç¦¡ %s ¥¿¦b¨Ï¥Î¤¤¡AµLªk§R°£

source: E132: Function call depth is higher than 'maxfuncdepth'
ko: E132: �Լ��� �θ� ���̰� 'maxfuncdepth'���� Ů�ϴ�
pl: E132: Zagnie¿d¿enie wywo³añ funkcji ponad 'maxfuncdepth'
zh_tw: E132: ¨ç¦¡»¼°j©I¥s¼h¼Æ¶W¹L 'maxfuncdepth'

source: calling %s
ko: %s �θ��� ��
pl: wywo³ujê %s
zh_tw: ©I¥s %s

source: %s aborted
ko: %s��(��) �����Ǿ����ϴ�
pl: porzucono %s
zh_tw: %s ³Q±j¨î¤¤Â_°õ¦æ

source: %s returning #%<PRId64>
ko: %s��(��) #%<PRId64>��(��) �����־����ϴ�
pl: %s zwraca #%<PRId64>
zh_tw: %s ¶Ç¦^­È #%<PRId64>

source: %s returning %s
ko: %s��(��) %s��(��) �����־����ϴ�
pl: %s zwraca %s

source: continuing in %s
ko: %s���� ����
pl: kontynuacja w %s
zh_tw: Ä~Äò: %s

source: E133: :return not inside a function
ko: E133: :return�� �Լ� �ȿ� ���� �ʽ��ϴ�
pl: E133: :return poza funkcj±
zh_tw: E133: :return ¥²¶·¦b¨ç¦¡¸Ì¨Ï¥Î

source: # global variables:
pl: # zmienne globalne:
zh_tw: # ¥þ°ìÅÜ¼Æ:

source: Last set from
pl: Ostatnie ustawienie przez
zh_tw: ¤W¦¸³]©w:

source: No old files
ko: old ������ �����ϴ�
pl: Brak starych plików

source: <%s>%s%s %d, Hex %02x, Octal %03o
ko: <%s>%s%s %d, ������ %02x, ���� %03o
pl: <%s>%s%s %d, Hex %02x, Oktal %03o
zh_tw: <%s>%s%s %d, ¤Q¤»¶i¦ì %02x, ¤K¶i¦ì %03o

source: > %d, Hex %04x, Octal %o
ko: > %d, ������ %04x, ���� %o
pl: > %d, Hex %04x, Oktal %o
zh_tw: > %d, ¤Q¤»¶i¦ì %04x, ¤K¶i¦ì %o

source: > %d, Hex %08x, Octal %o
ko: > %d, ������ %08x, ���� %o
pl: > %d, Hex %08x, Oktal %o
zh_tw: > %d, ¤Q¤»¶i¦ì %08x, ¤K¶i¦ì %o

source: E134: Move lines into themselves
ko: E134: ���� �� �ڽ����� �̵��Ϸ��� �߽��ϴ�
pl: E134: Przeniesienie wierszy na siebie samych
zh_tw: E134: µLªk§â¦æ²¾¨ì¥¦¦Û¤w¤º

source: 1 line moved
ko: 1 �� �Ű������ϴ�
pl: 1 wiersz przeniesiony
zh_tw: ¤w·h²¾ 1 ¦æ

source: %<PRId64> lines moved
ko: %<PRId64> �� �Ű������ϴ�
pl: %<PRId64> wiersze przeniesione
zh_tw: ¤w·h²¾ %<PRId64> ¦æ

source: %<PRId64> lines filtered
ko: %<PRId64> ���� �ɷ����ϴ�
pl: %<PRId64> wierszy przefiltrowanych
zh_tw: ¤w³B²z %<PRId64> ¦æ

source: E135: *Filter* Autocommands must not change current buffer
ko: E135: *Filter* �ڵ������� ���� ���۸� �ٲپ�� �� �˴ϴ�
pl: E135: Autokomendy *Filter* nie mog± zmieniaæ bie¿±cego bufora
zh_tw: E135: *Filter* Autocommand ¤£¥i¥H§ó§ï½w½Ä°Ïªº¤º®e

source: [No write since last change]
ko: [���������� ��ģ �� ���� �� ��]
pl: [Brak zapisu od czasu ostatniej zmiany]
zh_tw: [§ó·s«á©|¥¼Àx¦s]

source: %sviminfo: %s in line:
ko: %sviminfo: �ٿ� %s:
pl: %sviminfo: %s w wierszu:
zh_tw: %sviminfo: %s ¦b¦æ¤¤:

source: E136: viminfo: Too many errors, skipping rest of file
ko: E136: viminfo: �ʹ� ���� ����, ������ �ǳʶ�
pl: E136: viminfo: Zbyt wiele b³êdów; pomijam resztê pliku
zh_tw: E136: viminfo: ¹L¦h¿ù»~, ©¿²¤ÀÉ®×¨ä¾l³¡¤À

source: Reading viminfo file "%s"%s%s%s
ko: viminfo ���� "%s"%s%s%s��(��) �д� ��
pl: Wczytujê plik viminfo "%s"%s%s%s
zh_tw: Åª¨ú viminfo ÀÉ®× "%s"%s%s%s

source: info
pl: informacja
zh_tw: °T®§

source: marks
ko: ��ũ
pl: zak³adki
zh_tw: ¼Ð°O

source: oldfiles
pl: stare pliki

source: FAILED
pl: NIE POWIOD£O SIÊ
zh_tw: ¥¢±Ñ

source: E137: Viminfo file is not writable: %s
ko: E137: Viminfo ������ ���� ������ �����ϴ�: %s
pl: E137: Plik viminfo jest niezapisywalny: %s
zh_tw: E137: Viminfo ÀÉ®×µLªk¼g¤J: %s

source: E138: Can't write viminfo file %s!
ko: E138: Viminfo ���� %s��(��) �� �� �����ϴ�!
pl: E138: Nie mogê zapisaæ pliku viminfo %s!
zh_tw: E138: µLªk¼g¤J viminfo ÀÉ®× %s !

source: Writing viminfo file "%s"
ko: Viminfo ���� "%s"��(��) ���� ��
pl: Zapisujê plik viminfo "%s"
zh_tw: ¼g¤J viminfo ÀÉ®× "%s" ¤¤

source: # This viminfo file was generated by Vim %s.
ko: # �� viminfo ������ ���� ���� ���Դϴ� Vim %s.
pl: # Ten plik viminfo zosta³ wygenerowany przez Vima %s.
zh_tw: # ¥» viminfo ÀÉ®×¬O¥Ñ Vim %s ©Ò²£¥Í.

source: # You may edit it if you're careful!
ko: # ���ɸ� �Ѵٸ� ��ĥ ���� �ֽ��ϴ�!
pl: # Mo¿esz go ostro¿nie edytowaæ!
zh_tw: # ¦pªG·Q­n¦Û¦æ­×§ï½Ð¯S§O¤p¤ß¡I

source: # Value of 'encoding' when this file was written
ko: # �� ������ �����Ǿ��� ���� 'encoding'�� ��
pl: # Warto¶æ 'encoding' w czasie zapisu tego pliku
zh_tw: # 'encoding' ¦b¦¹ÀÉ«Ø¥ß®Éªº­È

source: Illegal starting char
pl: Niedopuszczalny pocz±tkowy znak
zh_tw: µL®Äªº°_©l¦r¤¸

source: Write partial file?
ko: ���� �Ϻθ� �����ұ���?
pl: Zapisaæ czê¶ciowo plik?
zh_tw: ­n¼g¤J³¡¤ÀÀÉ®×¶Ü¡H

source: E140: Use ! to write partial buffer
ko: E140: ���� �Ϻθ� ������ !�� �����Ͻʽÿ�
pl: E140: Stosuj ! do zapisania czê¶ciowo bufora
zh_tw: E140: ½Ð¨Ï¥Î ! ¥H¼g¤J³¡¤À½w½Ä°Ï

source: Overwrite existing file "%s"?
ko: �̹� �ִ� "%s" ������ �������?
pl: Nadpisaæ istniej±cy plik "%s"?

source: Swap file "%s" exists, overwrite anyway?
ko: ���� ���� "%s"�� �ֽ��ϴ�, �������?
pl: Plik wymiany "%s" istnieje, czy go nadpisaæ?

source: E768: Swap file exists: %s (:silent! overrides)
ko: E768: ���� ���� ����: %s (������� :silent! ����)
pl: E768: Plik wymiany istnieje: %s (wymu¶ poprzez :silent!)

source: E141: No file name for buffer %<PRId64>
ko: E141: ���� %<PRId64>�� ���� �̸��� �����ϴ�
pl: E141: Brak nazwy pliku dla bufora %<PRId64>
zh_tw: E141: ½w½Ä°Ï %<PRId64> ¨S¦³ÀÉ®×¦WºÙ

source: E142: File not written: Writing is disabled by 'write' option
ko: E142: ������ ������ ����: 'write' �ɼǿ� ���� �� ���� �����ϴ�
pl: E142: Plik niezapisany: Zapis jest wy³±czony opcj± 'write'
zh_tw: E142: ÀÉ®×¥¼¼g¤J¡A¦]¬° 'write' ¿ï¶µ³QÃö³¬

source: 'readonly' option is set for "%s". Do you wish to write anyway?
ko: 'readonly' �ɼ��� "%s"�� ���� �����Ǿ� �ֽ��ϴ�. �׷��� ���⸦ ���Ͻʴϱ�?
pl: opcja 'readonly' nastawiona dla "%s". Czy chcesz go pomimo tego zapisaæ?

source: File permissions of "%s" are read-only. It may still be possible to write it. Do you wish to try?
ko: ���� "%s"�� �б������Դϴ�. �׷��� ���Ⱑ ������ ���� �𸨴ϴ�. �� �� �� ������?
pl: Prawa pliku "%s" s± tylko do odczytu. Mimo to byæ mo¿e uda siê zmieniæ ten plik. Chcesz spróbowaæ?

source: E505: "%s" is read-only (add ! to override)
ko: E505: "%s"�� �б� �����Դϴ� (������� ! ���ϱ�)
pl: E505: "%s" jest tylko do odczytu (dodaj ! aby wymusiæ)

source: E143: Autocommands unexpectedly deleted new buffer %s
ko: E143: Autocommand�� �� �ۿ� �� ���� %s��(��) �������ϴ�
pl: E143: Autokomendy nieoczekiwanie skasowa³y nowy bufor %s
zh_tw: E143: Autocommands ·N¥~¦a§R°£·s½w½Ä°Ï %s

source: E144: non-numeric argument to :z
ko: E144: ���ڰ� �ƴ� ���ڰ� :z�� �־������ϴ�
pl: E144: nienumeryczny argument dla :z
zh_tw: E144: :z ¤£±µ¨ü«D¼Æ¦rªº°Ñ¼Æ

source: E145: Shell commands not allowed in rvim
ko: E145: rvim������ �� ������ ������ �� �����ϴ�
pl: E145: Komendy pow³oki s± niedozwolone w rvim
zh_tw: E145: rvim ¤¤¸T¤î¨Ï¥Î shell ©R¥O

source: E146: Regular expressions can't be delimited by letters
ko: E146: ����ǥ������ ���ڷ� ���е� �� �����ϴ�
pl: E146: Wzorce regularne nie mog± byæ rozgraniczane literami
zh_tw: E146: Regular expression µLªk¥Î¦r¥À¤À¹j (?)

source: replace with %s (y/n/a/q/l/^E/^Y)?
ko: %s(��)�� �ٲ� (y/n/a/q/l/^E/^Y)?
pl: zamieñ na %s (y/n/a/q/l/^E/^Y)?
zh_tw: ¨ú¥N¬° %s (y/n/a/q/^E/^Y)?

source: (Interrupted)
ko: (�ߴܵǾ����ϴ�)
pl: (Przerwane)
zh_tw: (¤w¤¤Â_)

source: 1 match
ko: 1�� ã����
pl: 1 pasuje

source: 1 substitution
ko: 1�� �ٲ���
pl: 1 podstawienie
zh_tw: ¨ú¥N¤@²Õ

source: %<PRId64> matches
ko: %<PRId64>�� ã����
pl: %<PRId64> dopasowañ

source: %<PRId64> substitutions
ko: %<PRId64>�� �ٲ���
pl: %<PRId64> podstawieñ
zh_tw: ¨ú¥N %<PRId64> ²Õ

source: on 1 line
ko: �� �ٿ���
pl: w 1 wierszu
zh_tw: ¡A½d³ò¡G¤@¦æ

source: on %<PRId64> lines
ko: %<PRId64> �ٿ���
pl: w %<PRId64> wierszach
zh_tw: ¡A½d³ò¡G %<PRId64> ¦æ

source: E147: Cannot do :global recursive
ko: E147: :global�� ���� ȣ�� �� �� �����ϴ�
pl: E147: Nie mogê wykonaæ :global rekursywnie
zh_tw: E147: :global µLªk»¼°j°õ¦æ

source: E148: Regular expression missing from global
ko: E148: global���� ����ǥ������ �������ϴ�
pl: E148: Brak wzorca regularnego w :global
zh_tw: E148: ¨S¦³¨Ï¥Î¹L Regular expression (?)

source: Pattern found in every line: %s
ko: ���� �ٿ��� ������ ã�ҽ��ϴ�: %s
pl: Wzorzec znaleziono w ka¿dym wierszu: %s
zh_tw: ¨C¤@¦æ³£§ä¤£¨ì: %s

source: Pattern not found: %s
pl: Nie znaleziono wzorca: %s

source: # Last Substitute String: $
ko: # ���������� �ٲ� ���ڿ�: $
pl: # Ostatni podstawiany ci±g: $
zh_tw: # «e¤@²Õ´À¥N¦r¦ê: $

source: E478: Don't panic!
ko: E478: ��Ȳ���� ���ʽÿ�!
pl: E478: Nie panikuj!
zh_tw: E478: ¤£­nÅå·W!

source: E661: Sorry, no '%s' help for %s
ko: E661: �̾��մϴ�, ������ '%s'��(��) %s�� ���� �����ϴ�
pl: E661: Przykro mi, brak '%s' pomocy dla %s
zh_tw: E661: ©êºp, ¨S¦³Ãö©ó %s-%s ªº»¡©ú

source: E149: Sorry, no help for %s
ko: E149: �̾��մϴ�, %s�� ���� �������� �����ϴ�
pl: E149: Przykro mi, ale brak pomocy o %s
zh_tw: E149: ©êºp, ¨S¦³ %s ªº»¡©ú

source: Sorry, help file "%s" not found
ko: �̾��մϴ�, ������ ���� "%s"��(��) ã�� �� �����ϴ�
pl: Przykro mi, nie ma pliku pomocy "%s"
zh_tw: ©êºp, §ä¤£¨ì»¡©úÀÉ "%s"

source: E150: Not a directory: %s
ko: E150: �����丮�� �ƴ�: %s
pl: E150: Nie jest katalogiem: %s
zh_tw: E150: %s ¤£¬O¥Ø¿ý

source: E152: Cannot open %s for writing
ko: E152: ���� ���� %s��(��) �� �� �����ϴ�
pl: E152: Nie mogê otworzyæ %s do zapisu
zh_tw: E152: µLªk¥H¼g¤J¼Ò¦¡¶}±Ò "%s"

source: E153: Unable to open %s for reading
ko: E153: �б� ���� %s��(��) �� �� �����ϴ�
pl: E153: Nie mogê otworzyæ %s do odczytu
zh_tw: E153: µLªkÅª¨úÀÉ®×: %s

source: E670: Mix of help file encodings within a language: %s
ko: E670: �� ������� ���� ���ڵ� ����: %s
pl: E670: Mieszanka kodowañ w pliku pomocy w ramach jêzyka: %s
zh_tw: E670: ¦P¤@»y¨¥ (%s) ¤¤¦³²V¦X¤£¦P¦r¤¸½s½Xªº»¡©úÀÉ

source: E154: Duplicate tag "%s" in file %s/%s
ko: E154: "%s" �±װ� %s/%s ���Ͽ��� �ߺ��Ǿ����ϴ�
pl: E154: Powtórzony znacznik "%s" w pliku %s/%s

source: E160: Unknown sign command: %s
ko: E160: �𸣴� sign ����: %s
pl: E160: Nieznana komenda znaku: %s
zh_tw: E160: ¥¼©w¸qªº sign command: %s

source: E156: Missing sign name
ko: E156: sign �̸��� �����ϴ�
pl: E156: Brak nazwy znaku
zh_tw: E156: ¯Ê¤Ö sign ¦WºÙ

source: E612: Too many signs defined
ko: E612: �ʹ� ���� sign�� ���ǵǾ� �ֽ��ϴ�
pl: E612: Zbyt wiele nazw znaków
zh_tw: E612: ¤w©w¸q¤Ó¦h signs

source: E239: Invalid sign text: %s
ko: E239: �߸��� sign �ؽ�Ʈ: %s
pl: E239: Niew³a¶ciwy tekst znaku: %s
zh_tw: E239: ¤£¥¿½Tªº sign ¤å¦r: %s

source: E155: Unknown sign: %s
ko: E155: �𸣴� sign: %s
pl: E155: Nieznany znak: %s
zh_tw: E155: ¤£¥¿½Tªº sign: %s

source: E159: Missing sign number
ko: E159: sign ��ȣ�� �����ϴ�
pl: E159: Brak numeru znaku
zh_tw: E159: ¯Ê¤Ö sign number

source: E158: Invalid buffer name: %s
ko: E158: �߸��� ���� �̸�: %s
pl: E158: Niew³a¶ciwa nazwa bufora: %s
zh_tw: E158: ½w½Ä°Ï¦WºÙ¿ù»~: %s

source: E157: Invalid sign ID: %<PRId64>
ko: E157: �߸��� sign ID: %<PRId64>
pl: E157: Niew³a¶ciwe ID znaku: %<PRId64>
zh_tw: E157: Sign ID ¿ù»~: %<PRId64>

source: (not supported)
pl: (nie wspomagane)
zh_tw: (¤£¤ä´©)

source: [Deleted]
ko: [���������ϴ�]
pl: [Skasowano]
zh_tw: [¤w§R°£]

source: Entering Debug mode. Type "cont" to continue.
ko: ������ ���·� ���. �����Ϸ��� "cont"�� �Է��Ͻʽÿ�.
pl: Wchodzê w tryb odpluskwiania. Wprowad¼ "cont" aby kontynuowaæ.
zh_tw: ¶i¤J°£¿ù¼Ò¦¡. ¿é¤J "cont" ¥H¦^¨ì¥¿±`¼Ò¦¡.

source: line %<PRId64>: %s
ko: %<PRId64> ��: %s
pl: wiersz %<PRId64>: %s
zh_tw: ¦æ %<PRId64>: %s

source: Breakpoint in "%s%s" line %<PRId64>
ko: ������: "%s%s" %<PRId64> ��
pl: Punkt kontrolny w "%s%s" wiersz %<PRId64>
zh_tw: "%s%s" ¤¤Â_ÂI: ²Ä %<PRId64> ¦æ

source: E161: Breakpoint not found: %s
ko: E161: �������� ã�� �� �����ϴ�: %s
pl: E161: Nie znaleziono punktu kontrolnego: %s
zh_tw: E161: §ä¤£¨ì¤¤Â_ÂI: %s

source: No breakpoints defined
ko: �������� ���ǵǾ� ���� �ʽ��ϴ�
pl: Nie okre¶lono ¿adnych punktów kontrolnych
zh_tw: ¨S¦³©w¸q¤¤Â_ÂI

source: %3d %s %s line %<PRId64>
ko: %3d %s %s %<PRId64> ��
pl: %3d %s %s wiersz %<PRId64>
zh_tw: %3d %s %s ²Ä %<PRId64> ¦æ

source: E750: First use ":profile start {fname}"
ko: E750: ���� ":profile start {fname}"�� �����ϼ���
pl: E750: Pierwsze u¿ycie ":profile start {fname}"

source: Save changes to "%s"?
ko: "%s"�� �ٲ� ������ �����ұ���?
pl: Zachowaæ zmiany w "%s"?

source: Untitled
pl: Bez Tytu³u
zh_tw: ¥¼©R¦W

source: E162: No write since last change for buffer "%s"
ko: E162: ���� "%s"�� ���߿� �ٲ� ������ ������ �ʾҽ��ϴ�
pl: E162: Nie zapisano zmian w buforze "%s"
zh_tw: E162: ¤w§ó§ï¹L½w½Ä°Ï "%s" ¦ý©|¥¼¦sÀÉ (¥i¥Î ! ±j¨î°õ¦æ)

source: Warning: Entered other buffer unexpectedly (check autocommands)
ko: ����: �� �ۿ� �ٸ� ���۷� ������ϴ� (autocommand�� Ȯ���Ͻʽÿ�)
pl: OSTRZE¯ENIE: Nieoczekiwane wej¶cie w inny bufor (sprawd¼ autokomendy)
zh_tw: ª`·N: ¤w¤Á´«¨ì¨ä¥¦½w½Ä°Ï (½ÐÀË¬d Autocommands ¦³µL¿ù»~)

source: E163: There is only one file to edit
ko: E163: ��ĥ ������ �ϳ� �ۿ� �����ϴ�
pl: E163: Tylko jeden plik w edycji
zh_tw: E163: ¥u¦³¤@­ÓÀÉ®×¥i½s¿è

source: E164: Cannot go before first file
ko: E164: ù ��° ���� �������δ� �� �� �����ϴ�
pl: E164: Nie mo¿na przej¶æ przed pierwszy plik
zh_tw: E164: ¤w¸g¦b²Ä¤@­ÓÀÉ®×¤F

source: E165: Cannot go beyond last file
ko: E165: ������ ���� �ڷδ� �� �� �����ϴ�
pl: E165: Nie mo¿na przej¶æ za ostatni plik
zh_tw: E165: ¤w¸g¦b³Ì«á¤@­ÓÀÉ®×¤F

source: E666: compiler not supported: %s
ko: E666: �����Ϸ��� �������� ����: %s
pl: E666: nie wspierany kompilator: %s
zh_tw: E666: ½sÄ¶¾¹¤£¤ä´©: %s

source: Searching for "%s" in "%s"
ko: "%s"��(��) "%s"���� ã�� ��
pl: Szukanie "%s" w "%s"
zh_tw: ·j´M¤¤: "%s" -- "%s"

source: Searching for "%s"
ko: "%s"��(��) ã�� ��
pl: Szukanie "%s"
zh_tw: ·j´M¤¤: "%s"

source: not found in 'runtimepath': "%s"
ko: 'runtimepath'���� ã�� �� ����: "%s"
pl: nie znaleziono w 'runtimepath': "%s"
zh_tw: ¦b 'runtimepath' ¸Ì§ä¤£¨ì "%s"

source: Cannot source a directory: "%s"
ko: �����丮�� source�� �� ����: "%s"
pl: Nie mo¿na wczytaæ katalogu: "%s"
zh_tw: µLªk°õ¦æ¥Ø¿ý¡G "%s"

source: could not source "%s"
ko: "%s"��(��) �ҷ� ���� �� �����ϴ�
pl: nie mog³em wczytaæ "%s"
zh_tw: µLªk°õ¦æ "%s"

source: line %<PRId64>: could not source "%s"
ko: %<PRId64> ��: "%s"��(��) �ҷ� ���� �� �����ϴ�
pl: wiersz: %<PRId64> nie mog³em wczytaæ "%s"
zh_tw: ²Ä %<PRId64> ¦æ: µLªk°õ¦æ "%s"

source: sourcing "%s"
ko: "%s"��(��) �ҷ����̴� ��
pl: wczytywanie "%s"
zh_tw: °õ¦æ "%s" ¤¤

source: line %<PRId64>: sourcing "%s"
ko: %<PRId64> ��: "%s" �ҷ����̴� ��
pl: wiersz %<PRId64>: wczytywanie "%s"
zh_tw: ²Ä %<PRId64> ¦æ: µ²§ô°õ¦æ %s

source: finished sourcing %s
ko: %s �ҷ����̱� ��
pl: skoñczono wczytywanie %s
zh_tw: µ²§ô°õ¦æ %s

source: environment variable
ko: ȯ�� ����
pl: zmienna ¶rodowiskowa

source: error handler
ko: ���� �ڵ鷯
pl: obs³uga b³êdu

source: W15: Warning: Wrong line separator, ^M may be missing
ko: W15: ����: �߸��� �� ������. ^M�� ���� �� �����ϴ�
pl: W15: OSTRZE¯ENIE: Niew³a¶ciwy separator wierszy, pewnie brak ^M
zh_tw: W15: ª`·N: ¿ù»~ªº¦æ¤À¹j¦r¤¸¡A¥i¯à¬O¤Ö¤F ^M

source: E167: :scriptencoding used outside of a sourced file
ko: E167: :scriptencoding�� �ҷ����� ���� �ۿ��� �����Ǿ����ϴ�
pl: E167: u¿yto :scriptencoding poza wczytywanym plikiem
zh_tw: E167: ¦b°õ¦æ script ÀÉ®×¥~¤£¥i¨Ï¥Î :scriptencoding

source: E168: :finish used outside of a sourced file
ko: E168: :finish�� �ҷ����� ���� �ۿ��� �����Ǿ����ϴ�
pl: E168: u¿yto :finish poza wczytywanym plikiem
zh_tw: E168: ¦b°õ¦æ script ÀÉ®×¥~¤£¥i¨Ï¥Î :finish

source: Current %slanguage: "%s"
ko: ���� %s����: "%s"
pl: Bie¿±cy %sjêzyk: "%s"
zh_tw: ¥Ø«eªº %s»y¨¥: "%s"

source: E197: Cannot set language to "%s"
ko: E197: ��� "%s"(��)�� ������ �� �����ϴ�
pl: E197: Nie mogê ustawiæ jêzyka na "%s"
zh_tw: E197: ¤£¯à³]©w»y¨¥¦¨ "%s"

source: Entering Ex mode. Type "visual" to go to Normal mode.
ko: Ex ���·� ��ȯ. Normal ���·� ������ "visual"�� �Է��Ͻʽÿ�.
pl: Wchodzê w tryb Ex. Wprowad¼ "visual" aby przej¶æ do trybu Normal.
zh_tw: ¶i¤J Ex ¼Ò¦¡. ¿é¤J "visua" ¥H¦^¨ì¥¿±`¼Ò¦¡.

source: E501: At end-of-file
ko: E501: ������ �������Դϴ�
pl: E501: Na koñcu pliku
zh_tw: E501: ¤w¨ìÀÉ®×µ²§À

source: E169: Command too recursive
ko: E169: ������ �ʹ� ���� �ٽ� �ݺ��Ǿ����ϴ�
pl: E169: Komenda zbyt rekursywna
zh_tw: E169: ©R¥O»¼°j¼h¼Æ¹L¦h

source: E605: Exception not caught: %s
ko: E605: ���ܰ� �߻����� �ʾҽ��ϴ�: %s
pl: E605: Nie znaleziono wyj±tku: %s
zh_tw: E605: ¥¼ÄdºIªº¨Ò¥~¡G %s

source: End of sourced file
ko: �ҷ����� ������ ������
pl: Koniec wczytywanego pliku
zh_tw: ©R¥OÀÉµ²§ô

source: End of function
ko: �Լ��� ������
pl: Koniec funkcji
zh_tw: ¨ç¦¡µ²§À

source: E464: Ambiguous use of user-defined command
ko: E464: ������ ���� ������ ��ȣ�ϰ� �����ϰ� �ֽ��ϴ�
pl: E464: Niejednoznaczne zastosowanie komendy zdefiniowanej przez u¿ytkownika
zh_tw: E464: ¨Ï¥ÎªÌ©w¸qªº©R¥O·|²V²c

source: E492: Not an editor command
ko: E492: ������ ������ �ƴմϴ�
pl: E492: Nie jest komend± edytora
zh_tw: E492: ¤£¬O½s¿è¾¹ªº©R¥O

source: E493: Backwards range given
ko: E493: �ݴ� ������ �־������ϴ�
pl: E493: Dano wsteczny zakres
zh_tw: E493: «ü©w¤F¦V«e°Ñ¦Òªº½d³ò

source: Backwards range given, OK to swap
ko: �ݴ� ������ �־������ϴ�, ����������
pl: Dano wsteczny zakres; zamiana jest mo¿liwa
zh_tw: «ü©w¤F¦V«e°Ñ¦Òªº½d³ò¡AOK to swap

source: E494: Use w or w>>
ko: E494: w�� w>>�� �����Ͻʽÿ�
pl: E494: Stosuj w lub w>>
zh_tw: E494: ½Ð¨Ï¥Î w ©Î w>>

source: E319: Sorry, the command is not available in this version
ko: E319: �̾��մϴ�, �� ������ ���� �ǿ��� ������ �� �����ϴ�
pl: E319: Przykro mi, ale ta komenda nie jest dostêpna w tej wersji
zh_tw: E319: ©êºp, ¥»©R¥O¦b¦¹ª©¥»¤¤¨S¦³¹ê§@

source: E172: Only one file name allowed
ko: E172: ������ �ϳ��� ���� �̸��� ���� �����մϴ�
pl: E172: Tylko pojedyncza nazwa pliku dozwolona
zh_tw: E172: ¥u¯à¦³¤@­ÓÀÉ

source: 1 more file to edit. Quit anyway?
ko: ��ĥ ������ �� �� �� �ֽ��ϴ�. �׷��� ��������?
pl: 1 wiêcej plik do edycji. Mimo to wyj¶æ?
zh_tw: ÁÙ¦³¤@­ÓÀÉ®×¥¼½s¿è. ½T©w­nÂ÷¶}¡H

source: %d more files to edit. Quit anyway?
ko: ��ĥ ������ %d �� �� �ֽ��ϴ�. �׷��� ��������?
pl: jeszcze %d plików do edycji. Mimo to wyj¶æ?
zh_tw: ÁÙ¦³ %d ­ÓÀÉ®×¥¼½s¿è. ½T©w­nÂ÷¶}¡H

source: E173: 1 more file to edit
ko: E173: ��ĥ ������ �� �� �� �ֽ��ϴ�
pl: E173: 1 wiêcej plik do edycji
zh_tw: E173: ÁÙ¦³¤@­ÓÀÉ®×¥¼½s¿è

source: E173: %<PRId64> more files to edit
ko: E173: ��ĥ ������ %<PRId64> �� �� �ֽ��ϴ�
pl: E173: jeszcze %<PRId64> plików do edycji
zh_tw: E173: ÁÙ¦³ %<PRId64> ­ÓÀÉ®×¥¼½s¿è

source: E174: Command already exists: add ! to replace it
ko: E174: ������ �̹� �����մϴ�: �ٲٷ��� !�� ���ϼ���
pl: E174: Komenda ju¿ istnieje; aby j± przedefiniowaæ stosuj !
zh_tw: E174: ©R¥O¤w¸g¦s¦b, ½Ð¨Ï¥Î ! ±j¨î­«·s©w¸q

source: Name Args Range Complete Definition
ko: �̸� ���� ���� �ϼ� ����
pl: Nazwa Arg. Zak. Gotowo¶æ Definicja
zh_tw: ¦WºÙ °Ñ¼Æ ½d³ò §¹¾ã ©w¸q

source: No user-defined commands found
ko: ������ ���� ������ ã�� �� �����ϴ�
pl: Nie znaleziono komend zdefiniowanych przez u¿ytkownika
zh_tw: §ä¤£¨ì¨Ï¥ÎªÌ©w¸qªº©R¥O

source: E175: No attribute specified
ko: E175: ���õ� �Ӽ��� �����ϴ�
pl: E175: Nie okre¶lono atrybutu
zh_tw: E175: ¨S¦³«ü©wªºÄÝ©Ê

source: E176: Invalid number of arguments
ko: E176: �߸��� ���� ����
pl: E176: Niew³a¶ciwa ilo¶æ argumentów
zh_tw: E176: ¤£¥¿½Tªº°Ñ¼Æ¼Æ¥Ø

source: E177: Count cannot be specified twice
ko: E177: ī��Ʈ�� �� �� �̻� ���õ� �� �����ϴ�
pl: E177: Mno¿nik nie mo¿e byæ podany dwukrotnie
zh_tw: E177: ¤£¯à«ü©w¨â¦¸¼Æ¥Ø

source: E178: Invalid default value for count
ko: E178: �߸��� �⺻ ī��Ʈ ��
pl: E178: Niew³a¶ciwa domy¶lna warto¶æ mno¿nika
zh_tw: E178: ¼Æ¥Øªº¹w³]°Ñ¼Æ¤£¥¿½T

source: E179: argument required for -complete
ko: E179: -complete�� ���ڰ� �ʿ��մϴ�
pl: E179: -complete wymaga argumentu

source: E181: Invalid attribute: %s
ko: E181: �߸��� �Ӽ�: %s
pl: E181: Niew³a¶ciwy atrybut: %s
zh_tw: E181: ¤£¥¿½TªºÄÝ©Ê: %s

source: E182: Invalid command name
ko: E182: �߸��� ���� �̸�
pl: E182: Niew³a¶ciwa nazwa komendy
zh_tw: E182: «ü¥O¦WºÙ¤£¥¿½T

source: E183: User defined commands must start with an uppercase letter
ko: E183: ������ ���� ������ �빮�ڷ� �����ؾ� �մϴ�
pl: E183: Komendy zdefiniowane przez u¿ytkownika musz± rozpoczynaæ siê du¿± liter±
zh_tw: E183: ¨Ï¥ÎªÌ¦Û©w«ü¥O¥²¶·¥H¤j¼g¦r¥À¶}©l

source: E841: Reserved name, cannot be used for user defined command
ko: E841: ������ �̸�, ������ ���� �������� ������ �� �����ϴ�
pl: E841: Nazwa zastrze¿ona, nie mo¿na jej u¿yæ w komendzie u¿ytkownika

source: E184: No such user-defined command: %s
ko: E184: �׷� ������ ���� ���� ����: %s
pl: E184: Nie ma takiej komendy u¿ytkownika: %s
zh_tw: E184: ¨S¦³¨Ï¥ÎªÌ¦Û©wªº©R¥O¡G %s

source: E180: Invalid complete value: %s
ko: E180: �߸��� ������ ��: %s
pl: E180: Niew³a¶ciwa warto¶æ dope³niania: %s
zh_tw: E180: ¤£§¹¾ãªº­È: '%s'

source: E468: Completion argument only allowed for custom completion
ko: E468: �ϼ� ���ڴ� ������ �ϼ������� �����˴ϴ�
pl: E468: Argument depe³niania dozwolony wy³±cznie dla dope³niania u¿ytkownika
zh_tw: E468: ¦Û­q¸É§¹®É¤~¥i¸É§¹°Ñ¼Æ

source: E467: Custom completion requires a function argument
ko: E467: ������ �ϼ��� �Լ� ���ڰ� �ʿ��մϴ�
pl: E467: Dope³nianie u¿ytkownika wymaga funkcji jako argumentu
zh_tw: E467: ¦Û­q¸É§¹»Ý­n¨ç¦¡¬°°Ñ¼Æ

source: E185: Cannot find color scheme '%s'
pl: E185: Nie mogê znale¼æ zestawu kolorów '%s'

source: Greetings, Vim user!
ko: �� �����ڴ�, ȯ���մϴ�!
pl: Witaj u¿ytkowniku Vima!
zh_tw: ¶Ù, Vim ¨Ï¥ÎªÌ¡I

source: E784: Cannot close last tab page
ko: E784: ������ ���� ���� �� �����ϴ�
pl: E784: Nie mogê zamkn±æ ostatniej karty

source: Already only one tab page
ko: �̹� �ϳ��� �Ǹ� �ֽ��ϴ�
pl: Jest ju¿ tylko jedna karta

source: Tab page %d
ko: �� ������ %d
pl: Karta %d

source: No swap file
ko: ���� ������ �����ϴ�
pl: Brak pliku wymiany
zh_tw: µL¼È¦sÀÉ

source: E747: Cannot change directory, buffer is modified (add ! to override)
ko: E747: �����丮�� �ٲ� �� ���� ��, ���۴� ������ (������� ! ���ϱ�)
pl: E747: Nie mogê zmieniæ katalogu, bufor zosta³ zmodyfikowany (dodaj ! aby wymusiæ)

source: E186: No previous directory
ko: E186: ���� �����丮�� �����ϴ�
pl: E186: Nie ma poprzedniego katalogu
zh_tw: E186: ¨S¦³«e¤@­Ó¥Ø¿ý

source: E187: Unknown
ko: E187: ����
pl: E187: Nieznany
zh_tw: E187: µLªk¿ìÃÑªº¼Ð°O

source: E465: :winsize requires two number arguments
ko: E465: :winsize�� �ΰ��� ���ڰ� �ʿ��մϴ�
pl: E465: :winsize wymaga dwóch argumentów numerycznych
zh_tw: E465: :winsize »Ý­n¨â­Ó°Ñ¼Æ

source: E188: Obtaining window position not implemented for this platform
ko: E188: �� �÷����� ���� â ��ġ ���� ������ �������� �ʾҽ��ϴ�
pl: E188: Pozyskiwanie pozycji okna nie jest zaimplementowane dla tego systemu
zh_tw: E188: ¦b±zªº¥­¥x¤WµLªkÀò±oµøµ¡¦ì¸m

source: E466: :winpos requires two number arguments
ko: E466: :winpos���� �ΰ��� ���ڰ� �ʿ��մϴ�
pl: E466: :winpos wymaga dwóch argumentów numerycznych
zh_tw: E466: :winpos »Ý­n¨â­Ó°Ñ¼Æ

source: E739: Cannot create directory: %s
ko: E739: �����丮 ���� ����: %s
pl: E739: Nie mogê utworzyæ katalogu: %s

source: E189: "%s" exists (add ! to override)
ko: E189: "%s"��(��) �����մϴ� (������� ! ���ϱ�)
pl: E189: "%s" istnieje (wymu¶ poprzez !)
zh_tw: E189: "%s" ¤w¦s¦b (½Ð¥Î ! ±j¨î°õ¦æ)

source: E190: Cannot open "%s" for writing
ko: E190: ���� ���� "%s"��(��) �� �� �����ϴ�
pl: E190: Nie mogê otworzyæ "%s" do zapisu
zh_tw: E190: µLªk¥H¼g¤J¼Ò¦¡¶}±Ò "%s"
