Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: SELECT BLOCK
pl: ZAZNACZANIE BLOKOWE
zh_tw: ¿ï¨ú°Ï¶ô

source: recording
pl: zapis
zh_tw: °O¿ý¤¤

source: E383: Invalid search string: %s
ko: E383: �߸��� ã�� ���ڿ�: %s
pl: E383: Niew³a¶ciwy ci±g do szukania: %s
zh_tw: E383: ¿ù»~ªº·j´M¦r¦ê: %s

source: E384: search hit TOP without match for: %s
ko: E384: ó������ �´� ���ڿ��� �����ϴ�: %s
pl: E384: szukanie dobi³o GÓRY bez znalezienia: %s
zh_tw: E384: ¤w·j´M¨ìÀÉ®×¶}ÀY¤´§ä¤£¨ì %s

source: E385: search hit BOTTOM without match for: %s
ko: E385: ������ �´� ���ڿ��� �����ϴ�: %s
pl: E385: szukanie dobi³o KOÑCA bez znalezienia : %s
zh_tw: E385: ¤w·j´M¨ìÀÉ®×µ²§À¤´§ä¤£¨ì %s

source: E386: Expected '?' or '/' after ';'
ko: E386: ';' �ڿ��� '?'�� '/'�� �;� �մϴ�
pl: E386: Oczekujê '?' lub '/' po ';'
zh_tw: E386: ¦b ';' «á­±À³¸Ó¦³ '?' ©Î '/'

source: (includes previously listed match)
ko: (������ �¾Ҵ� ���� ����)
pl: (zawiera poprzednio wymienione dopasowanie)
zh_tw: (¥]¬A«e¦¸¦C¥X²Å¦X¶µ)

source: --- Included files
pl: --- Zawarte pliki
zh_tw: --- ¤Þ¤JÀÉ®×

source: not found
pl: nie znaleziono
zh_tw: §ä¤£¨ì

source: in path ---
pl: w tropie ---

source: (Already listed)
pl: (Ju¿ wymienione)
zh_tw: (¤w¦C¥X)

source: NOT FOUND
ko: �� ã����
pl: NIE ZNALEZIONO
zh_tw: §ä¤£¨ì

source: Scanning included file: %s
ko: ���Ե� ���� ã�� ��: %s
pl: Przegl±d w³±czonego pliku: %s
zh_tw: ·j´M¤Þ¤JÀÉ®×: %s

source: Searching included file %s
ko: ���Ե� ���� %s ã�� ��
pl: Przeszukiwanie w³±czonego pliku %s

source: E387: Match is on current line
ko: E387: �´� �� ���� �ٿ� �ֽ��ϴ�
pl: E387: Wzorzec pasuje w bie¿±cym wierszu
zh_tw: E387: ¥Ø«e©Ò¦b¦æ¤¤¦³¤@¤Ç°t

source: All included files were found
ko: ���� ���Ե� ������ ã�ҽ��ϴ�
pl: Wszelkie w³±czane pliki odnaleziono
zh_tw: ©Ò¦³¤Þ¤JÀÉ®×³£¤w§ä¨ì

source: No included files
ko: ���Ե� ������ �����ϴ�
pl: Brak w³±czanych plików
zh_tw: ¨S¦³¤Þ¤JÀÉ®×

source: E388: Couldn't find definition
ko: E388: ���Ǹ� ã�� �� �����ϴ�
pl: E388: Nie znalaz³em definicji
zh_tw: E388: §ä¤£¨ì©w¸q

source: E389: Couldn't find pattern
ko: E389: ������ ã�� �� �����ϴ�
pl: E389: Nie znalaz³em wzorca
zh_tw: E389: §ä¤£¨ì pattern

source: Substitute
pl: Podstawienie

source: # Last %sSearch Pattern: ~
pl: # Ostatni %sWyszukiwany wzorzec: ~

source: E759: Format error in spell file
ko: E759: spell ���� ���� ����
pl: E759: Nieprawid³owy format pliku sprawdzania pisowni

source: E758: Truncated spell file
ko: E758: �߸� spell ����
pl: E758: Obciêty plik sprawdzania pisowni

source: Trailing text in %s line %d: %s
pl: Zbêdny tekst w %s wiersz %d: %s

source: Affix name too long in %s line %d: %s
pl: Za d³uga nazwa afiksu w %s wiersz %d: %s

source: E761: Format error in affix file FOL, LOW or UPP
ko: E761: affix ���� FOL, LOW Ȥ�� UPP�� ���� ����
pl: E761: B³±d formatu w pliku afiksów FOL, LOW lub UPP

source: E762: Character in FOL, LOW or UPP is out of range
ko: E762: FOL, LOW Ȥ�� UPP�� ���ڰ� ������ ���
pl: E762: Znak w FOL, LOW lub UPP jest poza zasiêgiem

source: Compressing word tree...
ko: �ܾ� Ʈ�� ������...
pl: Kompresja drzewa s³ów...

source: E756: Spell checking is not enabled
ko: E756: ������ �˻簡 Ȱ��ȭ�Ǿ� ���� �ʽ��ϴ�
pl: E756: Sprawdzanie pisowni nie jest w³±czone

source: Warning: Cannot find word list "%s.%s.spl" or "%s.ascii.spl"
ko: ����: �ܾ� ���� "%s.%s.spl" Ȥ�� "%s.ascii.spl"�� ã�� �� �����ϴ�
pl: Ostrze¿enie: Nie mogê znale¼æ listy s³ów "%s.%s.spl" lub "%s.ascii.spl"

source: Reading spell file "%s"
ko: spell ���� "%s"��(��) �а� �ֽ��ϴ�
pl: Odczytujê plik sprawdzania pisowni "%s"

source: E757: This does not look like a spell file
ko: E757: spell ������ �ƴ� �� �����ϴ�
pl: E757: To nie wygl±da na plik sprawdzania pisowni

source: E771: Old spell file, needs to be updated
ko: E771: ������ spell ����, ������ �ʿ��մϴ�
pl: E771: Stary plik sprawdzania pisowni, wymagane uaktualnienie

source: E772: Spell file is for newer version of Vim
ko: E772: Spell ������ �� ������ Vim���Դϴ�
pl: E772: Plik sprawdzania pisowni dla nowszej wersji Vima

source: E770: Unsupported section in spell file
ko: E770: spell ���Ͽ� �������� �ʴ� ����
pl: E770: Niewspierana sekcja w pliku sprawdzania pisowni

source: Warning: region %s not supported
ko: ����: %s ������ �������� �ʽ��ϴ�
pl: Ostrze¿enie: region %s nie jest wspierany

source: Reading affix file %s ...
ko: affix ���� %s �д� ��
pl: Czytam plik afiksów %s ...

source: Conversion failure for word in %s line %d: %s
ko: %s ���� %d�� �ִ� �ܾ� ��ȯ ����: %s
pl: Konwersja nie powiod³a siê dla wyrazu w %s wierszu %d: %s

source: Conversion in %s not supported: from %s to %s
ko: %s�� ��ȯ�� �������� �ʽ��ϴ�: %s���� %s��
pl: Konwersja w %s nie jest wspierana: od %s do %s

source: Invalid value for FLAG in %s line %d: %s
ko: %s ���� %d�� FLAG�� ���� �߸��� ��: %s
pl: Nieprawid³owa warto¶æ FLAG w %s wierz %d: %s

source: FLAG after using flags in %s line %d: %s
ko: %s ���� %d�� �÷��װ� ������ �� FLAG: %s
pl: FLAG po u¿yciu flag w %s wiersz %d: %s

source: Defining COMPOUNDFORBIDFLAG after PFX item may give wrong results in %s line %d
ko: %s ���� %d�� PFX �ڿ� COMPOUNDFORBIDFLAG�� ������ ���� �߸��� ������ �ʷ��� �� �ֽ��ϴ�
pl: Definiowanie COMPOUNDFORBIDFLAG po PFX mo¿e skutkowaæ z³ym wynikiem w %s wiersz %d

source: Defining COMPOUNDPERMITFLAG after PFX item may give wrong results in %s line %d
ko: %s ���� %d�� PFX �ڿ� COMPOUNDPERMITFLAG�� ������ ���� �߸��� ������ �ʷ��� �� �ֽ��ϴ�
pl: Definiowanie COMPOUNDPERMITFLAG po PFX mo¿e skutkowaæ z³ym wynikiem w %s wiersz %d

source: Wrong COMPOUNDRULES value in %s line %d: %s
ko: %s ���� %d�� �߸��� COMPOUNDRULES ��: %s
pl: Z³a warto¶æ COMPOUNDRULES w %s wiersz %d: %s

source: Wrong COMPOUNDWORDMAX value in %s line %d: %s
ko: %s ���� %d�� �߸��� COMPOUNDWORDMAX ��: %s
pl: Z³a warto¶æ COMPOUNDWORDMAX w %s wiersz %d: %s

source: Wrong COMPOUNDMIN value in %s line %d: %s
ko: %s ���� %d�� �߸��� COMPOUNDMIN ��: %s
pl: Z³a warto¶æ COMPOUNDMIM w %s wiersz %d: %s

source: Wrong COMPOUNDSYLMAX value in %s line %d: %s
ko: %s ���� %d�� �߸��� COMPOUNDSYLMAX ��: %s
pl: Z³a warto¶æ COMPOUNDSYLMAX w %s wiersz %d: %s

source: Wrong CHECKCOMPOUNDPATTERN value in %s line %d: %s
ko: %s ���� %d�� �߸��� CHECKCOMPOUNDPATTERN ��: %s
pl: Z³a warto¶æ CHECKCOMPOUNDPATTERN w %s wiersz %d: %s

source: Different combining flag in continued affix block in %s line %d: %s
ko: %s ���� %d�� ���ӵ� affix ���Ͽ� �ٸ� ���� �÷���: %s
pl: Ró¿ne flagi z³o¿eñ w kontynuowanym bloku afiksu w %s wiersz %d: %s

source: Duplicate affix in %s line %d: %s
ko: %s ���� %d�� �ߺ��� affix: %s
pl: Powtórzony afiks w %s wiersz %d: %s

source: Affix also used for BAD/RARE/KEEPCASE/NEEDAFFIX/NEEDCOMPOUND/NOSUGGEST in %s line %d: %s
ko: %s ���� %d�� BAD/RARE/KEEPCASE/NEEDAFFIX/NEEDCOMPOUND/NOSUGGEST�� ���ؼ��� affix�� ������: %s
pl: Afiks u¿yty tak¿e dla BAD/RARE/KEEPCASE/NEEDAFFIX/NEEDCOMPOUND/NOSUGGEST w %s wiersz %d: %s

source: Expected Y or N in %s line %d: %s
ko: %s ���� %d�� Y�� N�� ������: %s
pl: Oczekiwano Y lub N w %s wierszu %d: %s

source: Broken condition in %s line %d: %s
ko: %s ���� %d�� ������ ����: %s
pl: B³êdny warunek w %s wiersz %d: %s

source: Expected REP(SAL) count in %s line %d
ko: %s ���� %d�� REP(SAL) ī��Ʈ�� ������
pl: Oczekiwano ilo¶ci REP(SAL) w %s wierszu %d

source: Expected MAP count in %s line %d
ko: %s ���� %d�� MAP ī��Ʈ�� ������
pl: Oczekiwano ilo¶ci MAP w %s wierszu %d

source: Duplicate character in MAP in %s line %d
ko: %s ���� %d�� MAP�� �ߺ��� ����
pl: Powtórzony znak w MAP w %s wierszu %d

source: Unrecognized or duplicate item in %s line %d: %s
ko: %s ���� %d�� �𸣴� Ȥ�� �ߺ��� �׸�: %s
pl: Nieznany lub powtórzony element w %s wierszu %d: %s

source: Missing FOL/LOW/UPP line in %s
ko: %s�� FOL/LOW/UPP�� ������ ����
pl: Brak wiersza FOL/LOW/UPP w %s

source: COMPOUNDSYLMAX used without SYLLABLE
ko: COMPOUNDSYLMAX�� SYLLABLE���� ������
pl: COMPOUNDSYLMAX u¿yty bez SYLLABLE

source: Too many postponed prefixes
ko: postponed ���λ簡 �ʹ� �����ϴ�
pl: Zbyt wiele opó¼nionych prefiksów

source: Too many compound flags
ko: compound �÷��װ� �ʹ� �����ϴ�
pl: Zbyt wiele flag z³o¿eñ

source: Too many postponed prefixes and/or compound flags
ko: postponed ���λ���(��) compound �÷��װ� �ʹ� �����ϴ�
pl: Zbyt wiele opó¼nionych prefiksów i/lub flag z³o¿eñ

source: Missing SOFO%s line in %s
ko: SOFO%s�� ������ ������ %s�� �ֽ��ϴ�
pl: Brak wiersza SOFO%s wiersz w %s

source: Both SAL and SOFO lines in %s
ko: %s�� SAL�� SOFO ������ �� �� �ֽ��ϴ�
pl: Wiersze SAL i SOFO w %s

source: Flag is not a number in %s line %d: %s
ko: %s ���� %d�� ���ڰ� �ƴ� �÷���: %s
pl: Flaga nie jest liczb± w %s wiersz %d: %s

source: Illegal flag in %s line %d: %s
ko: %s ���� %d�� �߸��� �÷���: %s
pl: Nieprawid³owa flaga w %s wiersz %d: %s

source: %s value differs from what is used in another .aff file
ko: %s ���� �ٸ� .aff ���Ͽ��� ������ �Ͱ� �ٸ��ϴ�
pl: Warto¶æ %s ró¿ni siê od tej u¿ytej w innym pliku .aff

source: Reading dictionary file %s ...
ko: ���� ���� %s �д� �� ...
pl: Czytam plik s³ownika %s ...

source: E760: No word count in %s
ko: E760: %s�� �ܾ� ī��Ʈ�� �����ϴ�
pl: E760: Brak ilo¶ci s³ów w %s

source: line %6d, word %6d - %s
ko: ���� %6d, �ܾ� %6d - %s
pl: wiersz %6d, s³owo %6d - %s

source: Duplicate word in %s line %d: %s
ko: %s ���� %d�� �ߺ��� �ܾ�: %s
pl: Powtórzony wyraz w %s wierszu %d: %s

source: First duplicate word in %s line %d: %s
ko: %s ���� %d�� ó�� �ߺ��� �ܾ�: %s
pl: Pierwszy powtórzony wyraz w %s wiersz %d: %s

source: %d duplicate word(s) in %s
ko: %d���� �ߺ��� �ܾ %s�� �ֽ��ϴ�
pl: %d powtórzony(ch) wyraz(ów) w %s

source: Ignored %d word(s) with non-ASCII characters in %s
ko: ���õ� %d���� �ƽ�Ű���ڿ��� �ƴ� �ܾ %s�� �ֽ��ϴ�
pl: Zignorowa³em %d s³ów ze znakami nie ASCII w %s

source: Reading word file %s ...
ko: �ܾ� ���� %s �д� �� ...
pl: Odczytujê plik wyrazów %s ...

source: Duplicate /encoding= line ignored in %s line %d: %s
ko: %s ���� %d�� �ߺ��� /encoding= ���� ���õ�: %s
pl: Zignorowano powtórzony wiersz /encoding= w %s wierszu %d: %s

source: /encoding= line after word ignored in %s line %d: %s
ko: %s ���� %d�� �ܾ� ���� /encoding= ���� ���õ�: %s
pl: Zignorowano wiersz /encoding= po wyrazie w %s wierszu %d: %s

source: Duplicate /regions= line ignored in %s line %d: %s
ko: %s ���� %d�� �ߺ��� /regions= ���� ���õ�: %s
pl: Powtórzony wiersz /regions= zignorowano w %s wierszu %d: %s

source: Too many regions in %s line %d: %s
ko: %s ���� %d�� �ʹ� ���� ����: %s
pl: Za du¿o regionów w %s wiersz %d: %s

source: / line ignored in %s line %d: %s
ko: %s ���� %d�� / ���� ���õ�: %s
pl: wiersz / zignorowano w %s wierszu %d: %s

source: Invalid region nr in %s line %d: %s
ko: %s ���� %d�� �߸��� ���� ��ȣ: %s
pl: Nieprawid³owy numer regionu w %s wierszu %d: %s

source: Unrecognized flags in %s line %d: %s
ko: %s ���� %d�� �𸣴� �÷���: %s
pl: Nieznane flagi w %s wiersz %d: %s

source: Ignored %d words with non-ASCII characters
ko: �ƽ�Ű ���ڿ��� �ƴ� %d���� �ܾ ���õǾ����ϴ�
pl: Zignorowa³em %d s³ów ze znakami nie ASCII

source: Compressed %d of %d nodes; %d (%d%%) remaining
ko: %d/%d ���尡 ������; %d (%d%%)�� ����
pl: Skompresowano %d z %d wêz³ów; pozostaje %d (%d%%)

source: Reading back spell file...
ko: ������ ������ �д� ��...
pl: Odczytujê plik sprawdzania pisowni...

source: Performing soundfolding...
ko: soundfold ������...
pl: Wykonujê kompresjê d¼wiêkow±...

source: Number of words after soundfolding: %<PRId64>
ko: soundfold ���� ���� �ܾ� ��: %<PRId64>
pl: Liczba s³ów po kompresji d¼wiêkowej: %<PRId64>

source: Total number of words: %d
ko: �� �ܾ� ��: %d
pl: Ca³kowita liczba s³ów: %d

source: Writing suggestion file %s ...
ko: %s ���� ������ ���� �� ...
pl: Zapisujê plik sugestii %s ...

source: Estimated runtime memory use: %d bytes
ko: ������ ��Ÿ�� �޸��� ���뷮: %d ����Ʈ
pl: Oczekiwane zu¿ycie pamiêci: %d bajtów

source: E751: Output file name must not have region name
ko: E751: ���� ���ϸ��� ���� �̸��� �޶��� �մϴ�
pl: E751: Nazwa pliku wynikowego nie mo¿e byæ nazw± regionu

source: E754: Only up to 8 regions supported
ko: E754: �ִ� 8���� ������ �����˴ϴ�
pl: E754: Wspieram tylko 8 regionów

source: E755: Invalid region in %s
ko: E755: %s�� �߸��� ����
pl: E755: Nieprawid³owy region w %s

source: Warning: both compounding and NOBREAK specified
ko: ����: compound�� NOBREAK �� �� ���õ�
pl: Ostrze¿enie: okre¶lono zarówno z³o¿enia jak i NOBREAK

source: Writing spell file %s ...
ko: spell ���� %s ���� �� ...
pl: Zapisujê plik sprawdzania pisowni %s ...

source: Done!
pl: Zrobione!

source: E765: 'spellfile' does not have %<PRId64> entries
ko: E765: 'spellfile'�� %<PRId64> �׸��� �����ϴ�
pl: E765: 'spellfile' nie posiada wpisów %<PRId64>

source: E763: Word characters differ between spell files
ko: E763: �ܾ spell ���� ���� �ٸ��ϴ�
pl: E763: Znaki wyrazów ró¿ni± siê miêdzy plikami sprawdzania pisowni

source: Sorry, no suggestions
ko: �˼�, ������ �� �����ϴ�
pl: Przykro mi, brak podpowiedzi

source: Sorry, only %<PRId64> suggestions
ko: �˼�, %<PRId64>���� ����
pl: Przykro mi, tylko %<PRId64> podpowiedzi

source: Change "%.*s" to:
pl: Zmieñ "%.*s" na:

source: E752: No previous spell replacement
ko: E752: ö�ڰ� �ٲ����� �����ϴ�
pl: E752: Brak poprzednich podmian sprawdzania pisowni

source: E753: Not found: %s
ko: E753: ã�� �� ����: %s
pl: E753: Nie znaleziono: %s

source: E778: This does not look like a .sug file: %s
ko: E778: .sug ������ �ƴ� �� ����: %s
pl: E778: Ten plik nie wygl±da na plik .sug: %s

source: E779: Old .sug file, needs to be updated: %s
ko: E779: ������ .sug ����, ���� �ʿ�: %s
pl: E779: Stary plik .sug, konieczne jest uaktualnienie: %s

source: E780: .sug file is for newer version of Vim: %s
ko: E780: .sug ������ �� ������ Vim����: %s
pl: E780: Plik .sug dla nowszej wersji Vima: %s

source: E781: .sug file doesn't match .spl file: %s
ko: E781: .sug ������ .spl ���ϰ� ���� ����: %s
pl: E781: Plik .sug nie pasuje do pliku .spl: %s

source: E782: error while reading .sug file: %s
ko: E782: .sug ���� �б� ����: %s
pl: E782: B³±d w czasie odczytu pliku .sug: %s

source: E783: duplicate char in MAP entry
ko: E783: MAP �׸��� �ߺ��� ����
pl: E783: Podwojony znak we wpisie MAP

source: No Syntax items defined for this buffer
ko: �� ���ۿ� ���� ���ǵ� ���� �׸��� �����ϴ�
pl: Brak elementów sk³adni okre¶lonych dla tego bufora
zh_tw: ³o­Ó½w½Ä°Ï¨S¦³©w¸q¥ô¦ó»yªk

source: E390: Illegal argument: %s
ko: E390: �߸��� ����: %s
pl: E390: Niedozwolony argument: %s
zh_tw: E390: °Ñ¼Æ¤£¥¿½T: %s

source: E391: No such syntax cluster: %s
ko: E391: �̷� ���� Ŭ�����ʹ� �����ϴ�: %s
pl: E391: Nie ma takiego klastra sk³adni: %s
zh_tw: E391: µL¦¹ syntax cluster: "%s"

source: syncing on C-style comments
ko: C-���� �ּ����� ��������
pl: synchronizacja komentarzy w stylu C
zh_tw: C»y¨¥¦¡µù¸Ñ¦P¨B¤Æ¤¤

source: no syncing
pl: brak synchronizacji
zh_tw: ¨S¦³¦P¨B¤Æ

source: syncing starts
pl: pocz±tek synchronizacji
zh_tw: ¦P¨B¤Æ¶}©l

source: lines before top line
pl: wierszy przed górn± lini±
zh_tw: ¦æ¸¹¶W¥X½d³ò

source: --- Syntax sync items ---
ko: --- Syntax sync �׸��� ---
pl: --- Elementy synchronizacji sk³adni ---
zh_tw: --- »yªk¦P¨Bª«¥ó (Syntax sync items) ---

source: syncing on items
pl: synchronizujê na elementach
zh_tw: ¦P¨B¤Æ¤¤:

source: --- Syntax items ---
ko: --- Syntax �׸� ---
pl: --- Elementy sk³adni ---
zh_tw: --- »yªk¶µ¥Ø ---

source: E392: No such syntax cluster: %s
ko: E392: �̷� ���� Ŭ�����ʹ� �����ϴ�: %s
pl: E392: Nie ma takiego klastra sk³adni: %s
zh_tw: E392: µL¦¹ syntax cluster: "%s"

source: minimal
pl: minimalnie
zh_tw: ³Ì¤p

source: maximal
pl: maksymalnie
zh_tw: ³Ì¤j

source: ; match
pl: ; pasuje
zh_tw: ; ²Å¦X

source: line breaks
pl: znaków nowego wiersza
zh_tw: Â_¦æ

source: E395: contains argument not accepted here
ko: E395: contains ���ڴ� ���⿡ �� �� �����ϴ�
pl: E395: argument contains niedozwolony w tym miejscu
zh_tw: E395: ¨Ï¥Î¤F¤£¥¿½Tªº°Ñ¼Æ

source: E844: invalid cchar value
ko: E844: �߸��� cchar ��
pl: E844: Niew³a¶ciwa warto¶æ cchar

source: E393: group[t]here not accepted here
ko: E393: group[t]here�� ���⿡�� ������ �� �����ϴ�
pl: E393: group[t]here niedozwolone w tym miejscu
zh_tw: E393: ¨Ï¥Î¤F¤£¥¿½Tªº°Ñ¼Æ

source: E394: Didn't find region item for %s
ko: E394: %s�� ���� region �׸��� ã�� ���߽��ϴ�
pl: E394: Nie znalaz³em elementów regionu dla %s
zh_tw: E394: §ä¤£¨ì %s ªº region item

source: E397: Filename required
ko: E397: �����̸��� �ʿ��մϴ�
pl: E397: Wymagana nazwa pliku
zh_tw: E397: »Ý­nÀÉ®×¦WºÙ

source: E847: Too many syntax includes
pl: E847: Za du¿o w³±czonych sk³adni

source: E789: Missing ']': %s
ko: E789: ']' ����: %s
pl: E789: Brak ']': %s

source: E398: Missing '=': %s
ko: E398: '=' ����: %s
pl: E398: Brak '=': %s
zh_tw: E398: ¯Ê¤Ö "=": %s

source: E399: Not enough arguments: syntax region %s
ko: E399: ����ġ ���� ����: ���� ���� %s
pl: E399: Za ma³o argumentów: syntax region %s
zh_tw: E399: syntax region %s ªº¤Þ¼Æ¤Ó¤Ö

source: E848: Too many syntax clusters
pl: E848: Za du¿o klastrów sk³adni

source: E400: No cluster specified
ko: E400: Ŭ�����Ͱ� ���õ��� �ʾҽ��ϴ�
pl: E400: Brak specyfikacji klastra
zh_tw: E400: ¨S¦³«ü©wªºÄÝ©Ê

source: E401: Pattern delimiter not found: %s
ko: E401: ���� �����ڸ� ã�� �� �����ϴ�: %s
pl: E401: Brak ogranicznika wzorca: %s
zh_tw: E401: §ä¤£¨ì¤À¹j²Å¸¹: %s

source: E402: Garbage after pattern: %s
ko: E402: ���� �ڿ� ������: %s
pl: E402: ¦mieci po wzorcu: %s
zh_tw: E402: '%s' «á­±ªºªF¦èµLªk¿ëÃÑ

source: E403: syntax sync: line continuations pattern specified twice
ko: E403: syntax sync: �� ���� ������ �� �� �����Ǿ����ϴ�
pl: E403: syntax sync: wielokrotnie podane wzorce kontynuacji wiersza
zh_tw: E403: »yªk¦P¨B: ³s±µ¦æ²Å¸¹³Q«ü©w¤F¨â¦¸

source: E404: Illegal arguments: %s
ko: E404: ���������� ����: %s
pl: E404: Niedozwolone argumenty: %s
zh_tw: E404: °Ñ¼Æ¤£¥¿½T: %s

source: E405: Missing equal sign: %s
ko: E405: ���� ��ȣ�� ������: %s
pl: E405: Brak znaku równo¶ci: %s
zh_tw: E405: ¯Ê¤Ö¬Ûµ¥²Å¸¹: %s

source: E406: Empty argument: %s
ko: E406: �� ����: %s
pl: E406: Pusty argument: %s
zh_tw: E406: ªÅ¥Õ°Ñ¼Æ: %s

source: E407: %s not allowed here
ko: E407: %s��(��) ���⿡�� �������� �ʽ��ϴ�
pl: E407: %s jest niedozwolone w tym miejscu
zh_tw: E407: %s ¤£¯à¦b¦¹¥X²{

source: E408: %s must be first in contains list
ko: E408: %s��(��) contains ������ ù ��°���� �մϴ�
pl: E408: %s musi byæ pierwsze w li¶cie contains
zh_tw: E408: %s ¥²¶·¬O¦Cªí¸Ìªº²Ä¤@­Ó

source: E409: Unknown group name: %s
ko: E409: �𸣴� �׷� �̸�: %s
pl: E409: Nieznana nazwa grupy: %s
zh_tw: E409: ¤£¥¿½Tªº¸s²Õ¦WºÙ: %s

source: E410: Invalid :syntax subcommand: %s
ko: E410: �߸��� :syntax ���� ����: %s
pl: E410: Niew³a¶ciwa podkomenda :syntax : %s
zh_tw: E410: ¤£¥¿½Tªº :syntax ¤l©R¥O: %s

source: TOTAL COUNT MATCH SLOWEST AVERAGE NAME PATTERN
pl: WSZYTKO ILO¦Æ PASUJE NAJWOLN. ¦REDNIO NAZWA WZORZEC

source: E679: recursive loop loading syncolor.vim
ko: E679: syncolor.vim �ݺ� �ε�
pl: E679: rekursywna pêtla wczytuj±ca syncolor.vim

source: E411: highlight group not found: %s
ko: E411: ���̶���Ʈ �׷��� ã�� �� �����ϴ�: %s
pl: E411: nie znaleziono grupy pod¶wietlania: %s
zh_tw: E411: §ä¤£¨ì highlight group: %s

source: E412: Not enough arguments: ":highlight link %s"
ko: E412: ����ġ ���� ����: ":highlight link %s"
pl: E412: Zbyt ma³o argumentów: ":highlight link %s"
zh_tw: E412: °Ñ¼Æ¤Ó¤Ö: ":highlight link %s"

source: E413: Too many arguments: ":highlight link %s"
ko: E413: �ʹ� ���� ����: ":highlight link %s"
pl: E413: Zbyt wiele argumentów: ":highlight link %s"
zh_tw: E413: °Ñ¼Æ¹L¦h: ":highlight link %s"

source: E414: group has settings, highlight link ignored
ko: E414: group�� �������� �ֽ��ϴ�, highlight link ���õ�
pl: E414: grupa ma ustawienia; zignorowane pod³±czenie pod¶wietlania
zh_tw: E414: ¤w³]©w¸s²Õ, ©¿²¤ highlight link

source: E415: unexpected equal sign: %s
ko: E415: ������ ���� ��ȣ: %s
pl: E415: nieoczekiwany znak równo¶ci: %s
zh_tw: E415: ¤£¸Ó¦³ªºµ¥¸¹: %s

source: E416: missing equal sign: %s
ko: E416: ���� ��ȣ�� ������: %s
pl: E416: brak znaku równo¶ci: %s
zh_tw: E416: ¯Ê¤Ö¬Ûµ¥²Å¸¹: %s

source: E417: missing argument: %s
ko: E417: ���ڰ� ������: %s
pl: E417: brak argumentu: %s
zh_tw: E417: ¯Ê¤Ö°Ñ¼Æ: %s

source: E418: Illegal value: %s
ko: E418: ���������� ��: %s
pl: E418: Niedozwolona warto¶æ: %s
zh_tw: E418: ¤£¦Xªkªº­È: %s

source: E419: FG color unknown
ko: E419: �𸣴� FG ����
pl: E419: Kolor FG nieznany
zh_tw: E419: ¿ù»~ªº«e´ºÃC¦â

source: E420: BG color unknown
ko: E420: �𸣴� BG ����
pl: E420: Kolor BG nieznany
zh_tw: E420: ¿ù»~ªº­I´ºÃC¦â

source: E421: Color name or number not recognized: %s
ko: E421: �� �̸��̳� ���ڸ� �ν��� �� ����: %s
pl: E421: Nazwa lub liczba koloru nierozpoznana: %s
zh_tw: E421: ¿ù»~ªºÃC¦â¦WºÙ©Î¼Æ­È: %s

source: E422: terminal code too long: %s
ko: E422: �͹̳� �ڵ尡 �ʹ� ��: %s
pl: E422: za d³ugi kod terminala: %s
zh_tw: E422: ²×ºÝ¾÷½X¤Óªø: %s

source: E423: Illegal argument: %s
ko: E423: �߸��� ����: %s
pl: E423: Niedozwolony argument: %s
zh_tw: E423: °Ñ¼Æ¤£¥¿½T: %s

source: E424: Too many different highlighting attributes in use
ko: E424: �ʹ� ���� �ٸ� ���̶���Ʈ �Ӽ��� �����ǰ� �ֽ��ϴ�
pl: E424: Zbyt wiele ró¿nych atrybutów podkre¶lania w u¿yciu
zh_tw: E424: ¨Ï¥Î¤F¹L¦h¬Û²§ªº°ª«G«×ÄÝ©Ê

source: E669: Unprintable character in group name
ko: E669: �׷� �̸��� ������ �� ���� ���ڰ� �ֽ��ϴ�
pl: E669: Niedrukowalny znak w nazwie grupy
zh_tw: E669: ¸s²Õ¦WºÙ¤¤¦³µLªk¦C¦Lªº¦r¤¸

source: W18: Invalid character in group name
ko: W18: �׷� �̸��� �̻��� ����
pl: W18: nieprawid³owy znak w nazwie grupy
zh_tw: W18: ¸s²Õ¦WºÙ¤¤¦³¤£¥¿½Tªº¦r¤¸

source: E849: Too many highlight and syntax groups
pl: E849: Za du¿o grup pod¶wietlania i sk³adni

source: E555: at bottom of tag stack
ko: E555: �±� ������ ���Դϴ�
pl: E555: na dole stosu znaczników
zh_tw: E555: ¼ÐÅÒ(tag)°ïÅ|µ²§À

source: E556: at top of tag stack
ko: E556: �±� ������ ó���Դϴ�
pl: E556: na górze stosu znaczników
zh_tw: E556: ¼ÐÅÒ(tag)°ïÅ|¶}ÀY

source: E425: Cannot go before first matching tag
ko: E425: ù ��° �´� �±� �������δ� �� �� �����ϴ�
pl: E425: Nie mo¿na przej¶æ przed pierwszy pasuj±cy znacznik
zh_tw: E425: ¤w¸g¦b³Ì«e­±ªº¼ÐÅÒ(tag)¤F

source: E426: tag not found: %s
ko: E426: �±׸� ã�� �� ����: %s
pl: E426: nie znaleziono znacznika: %s
zh_tw: E426: §ä¤£¨ì¼ÐÅÒ(tag): %s

source: # pri kind tag
pl: # pri rodzaj znacznik

source: file
pl: plik
zh_tw: ÀÉ®×

source: E427: There is only one matching tag
ko: E427: �´� �±װ� �ϳ� �ۿ� �����ϴ�
pl: E427: Pasuje tylko jeden znacznik
zh_tw: E427: ¥u¦³¦¹¶µ²Å¦X

source: E428: Cannot go beyond last matching tag
ko: E428: ������ �´� �±� �ڷδ� �� �� �����ϴ�
pl: E428: Nie mo¿na przej¶æ za ostatni pasuj±cy znacznik
zh_tw: E428: ¤v¸g¦b³Ì«á¤@­Ó²Å¦Xªº tag ¤F

source: File "%s" does not exist
ko: ���� "%s"��(��) �������� �ʽ��ϴ�
pl: Plik "%s" nie istnieje
zh_tw: ÀÉ®× "%s" ¤£¦s¦b

source: tag %d of %d%s
pl: znacznik %d z %d%s
zh_tw: §ä¨ì tag: %d/%d%s

source: or more
pl: lub wiêcej
zh_tw: ©Î§ó¦h

source: Using tag with different case!
pl: U¿ywam znacznika o odmiennej wielko¶ci liter!
zh_tw: ¥H¤£¦P¤j¤p¼g¨Ó¨Ï¥Î tag!

source: E429: File "%s" does not exist
ko: E429: ���� "%s"��(��) �������� �ʽ��ϴ�
pl: E429: Plik "%s" nie istnieje
zh_tw: E429: ÀÉ®× "%s" ¤£¦s¦b

source: # TO tag FROM line in file/text
pl: # DO znacznik OD wiersza w pliku/tek¶cie
zh_tw: # ¨ì tag ±q ¦æ ¦b ÀÉ®×/¤å¦r

source: Searching tags file %s
ko: �±� ���� %s ã�� ��
pl: Szukam w pliku znaczników %s
zh_tw: ·j´M tag ÀÉ®× "%s"

source: Ignoring long line in tags file
ko: �±� ������ �ʹ� �� ������ �����մϴ�
pl: Ignorujê d³ugie wiersze w pliku znaczników

source: E431: Format error in tags file "%s"
ko: E431: �±� ���� "%s"�� ���� ������ �ֽ��ϴ�
pl: E431: B³±d formatu w pliku znaczników "%s"
zh_tw: E431: Tag ÀÉ "%s" ®æ¦¡¿ù»~

source: Before byte %<PRId64>
pl: Przed bajtem %<PRId64>
zh_tw: ¦b %<PRId64> ¦ì¤¸¤§«e

source: E432: Tags file not sorted: %s
ko: E432: �±� ������ ���ĵǾ� ���� ����: %s
pl: E432: Plik znaczników nieuporz±dkowany: %s
zh_tw: E432: Tag ÀÉ®×¥¼±Æ§Ç: %s

source: E433: No tags file
ko: E433: �±� ������ �����ϴ�
pl: E433: Brak pliku znaczników
zh_tw: E433: ¨S¦³ tag ÀÉ

source: E434: Can't find tag pattern
ko: E434: �±� ������ ã�� �� �����ϴ�
pl: E434: Nie mogê znale¼æ wzorca znacznika
zh_tw: E434: §ä¤£¨ì tag
