Repository: neovim/neovim
Catalog: src/nvim/po/*.po
Languages: ko, pl, zh_tw

source: Cannot open for script output: "
ko: ��ũ��Ʈ ������ �� �� ����: "
pl: Nie mogê otworzyæ dla wyj¶cia skryptu: "
zh_tw: µLªk¶}±Ò¬° script ¿é¥X: "

source: Vim: Warning: Output is not to a terminal
ko: ��: ����: �͹̳η� ������ �� �����ϴ�
pl: Vim: OSTRZE¯ENIE: Wyj¶cie nie jest terminalem
zh_tw: Vim: ª`·N: ¿é¥X¤£¬O²×ºÝ¾÷(¿Ã¹õ)

source: Vim: Warning: Input is not from a terminal
ko: ��: ����: �͹̳η� ���� �Է¹��� �� �����ϴ�
pl: Vim: OSTRZE¯ENIE: Wej¶cie nie pochodzi z terminala
zh_tw: Vim: ª`·N: ¿é¤J¤£¬O²×ºÝ¾÷(Áä½L)

source: pre-vimrc command line
ko: pre-vimrc ���� ��
pl: linia poleceñ pre-vimrc
zh_tw: vimrc «e©R¥O¦C

source: E282: Cannot read from "%s"
ko: E282: "%s"���� ���� �� �����ϴ�
pl: E282: Nie mogê czytaæ z "%s"
zh_tw: E282: µLªkÅª¨úÀÉ®× "%s"

source: More info with: "vim -h"
ko: �� ���� ������ ���Ͻø�: "vim -h"
pl: Dalsze informacje poprzez: "vim -h"
zh_tw: ¬d¸ß§ó¦h¸ê°T½Ð°õ¦æ: "vim -h"

source: [file ..] edit specified file(s)
ko: [���� ..] �־��� ���� ��ġ��
pl: [plik ..] edytuj zadane pliki
zh_tw: [ÀÉ®× ..] ½s¿è«ü©wªºÀÉ®×

source: - read text from stdin
ko: - ǥ���Է¿��� �ؽ�Ʈ �б�
pl: - czytaj tekst ze stdin
zh_tw: - ±q¼Ð·Ç¿é¤J(stdin)Åª¨úÀÉ®×

source: -t tag edit file where tag is defined
ko: -t tag �±װ� ���ǵ� ��ġ���� ���� ��ġ��
pl: -t znacznik edytuj plik, w którym dany znacznik jest zdefiniowany
zh_tw: -t tag ½s¿è®É¨Ï¥Î«ü©wªº tag

source: -q [errorfile] edit file with first error
ko: -q [��������] ù ��° ������ �� ���� ��ġ��
pl: -q [errorfile] edytuj plik, zawieraj±cy pierwszy b³±d
zh_tw: -q [errorfile] ½s¿è®É¸ü¤J²Ä¤@­Ó¿ù»~

source: usage:
pl: u¿ycie:
zh_tw: ¥Îªk:

source: vim [arguments]
ko: vim [����]
pl: vim [argumenty]
zh_tw: vim [°Ñ¼Æ]

source: or:
ko: Ȥ��:
pl: lub:
zh_tw: ©Î:

source: Arguments:
pl: Argumenty:
zh_tw: °Ñ¼Æ:

source: -- Only file names after this
ko: -- �� �ڿ��� ���� �̸���
pl: -- Tylko nazwy plików po tym
zh_tw: -- ¥u¦³¦b³o¤§«áªºÀÉ®×

source: --literal Don't expand wildcards
ko: --literal ���ϵ�ī�带 Ȯ������ ����
pl: --literal Nie rozwijaj znaków specjalnych
zh_tw: --literal ¤£®i¶}¸U¥Î¦r¤¸

source: -v Vi mode (like "vi")
ko: -v Vi ���� ("vi"�� ����)
pl: -v Tryb vi (jak "vi")
zh_tw: -v Vi ¼Ò¦¡ (¦P "vi")

source: -e Ex mode (like "ex")
ko: -e Ex ���� ("ex"�� ����)
pl: -e Tryb ex (jak "ex")
zh_tw: -e Ex ¼Ò¦¡ (¦P "ex")

source: -E Improved Ex mode
pl: -E Usprawniony tryb Ex

source: -s Silent (batch) mode (only for "ex")
ko: -s ������ (��ġ) ���� ("ex"��)
pl: -s Cichy tryb (t³a) (tylko dla "ex")
zh_tw: -s ¦wÀR (batch) ¼Ò¦¡ (¥u¯à»P "ex" ¤@°_¨Ï¥Î)

source: -d Diff mode (like "vimdiff")
ko: -d Diff ���� ("vimdiff"�� ����)
pl: -d Tryb ró¿nic (jak "vimdiff")
zh_tw: -d Diff ¼Ò¦¡ (¦P "vimdiff", ¥i¨³³t¤ñ¸û¨âÀÉ®×¤£¦P³B)

source: -y Easy mode (like "evim", modeless)
ko: -y ���� ���� ("evim"�� ����, modeless)
pl: -y Tryb ³atwy (jak "evim", bez trybów)
zh_tw: -y Â²©ö¼Ò¦¡ (¦P "evim", modeless)

source: -R Readonly mode (like "view")
ko: -R �б� ���� ���� ("view"�� ����)
pl: -R Tryb wy³±cznie do odczytu (jak "view")
zh_tw: -R °ßÅª¼Ò¦¡ (¦P "view")

source: -Z Restricted mode (like "rvim")
ko: -Z ���ѵ� ���� ("rvim"�� ����)
pl: -Z Tryb ograniczenia (jak "rvim")
zh_tw: -Z ­­¨î¼Ò¦¡ (¦P "rvim")

source: -m Modifications (writing files) not allowed
ko: -m ����(���� ����)�� �������� ����
pl: -m Modyfikacje (zapisywanie plików) niedozwolone
zh_tw: -m ¤£¥i­×§ï (¼g¤JÀÉ®×)

source: -M Modifications in text not allowed
ko: -M �ؽ�Ʈ ������ �������� ����
pl: -M Zakaz modyfikacji tekstu
zh_tw: -M ¤£¥i­×§ï¤å¦r

source: -b Binary mode
ko: -b ���� ����
pl: -b Tryb binarny
zh_tw: -b ¤G¶i¦ì¼Ò¦¡

source: -l Lisp mode
ko: -l ������ ����
pl: -l Tryb lisp
zh_tw: -l Lisp ¼Ò¦¡

source: -C Compatible with Vi: 'compatible'
ko: -C Vi ȣȯ: 'compatible'
pl: -C B±d¼ zgodny z Vi: 'compatible'
zh_tw: -C 'compatible' ¶Ç²Î Vi ¬Û®e¼Ò¦¡

source: -N Not fully Vi compatible: 'nocompatible'
ko: -N Vi�� ȣȯ���� ����: 'nocompatible'
pl: -N B±d¼ niezupe³nie zgodny z Vi: 'nocompatible'
zh_tw: -N 'nocompatible' ¤£§¹¥þ»P¶Ç²Î Vi ¬Û®e¡A¥i¨Ï¥Î Vim ¥[±j¯à¤O

source: -V[N][fname] Be verbose [level N] [log messages to fname]
pl: -V[N][nazwap] Gadatliwy [poziom N] [zapisuj wiadomo¶ci do nazwap]

source: -D Debugging mode
ko: -D ������ ����
pl: -D Tryb odpluskwiania
zh_tw: -D °£¿ù¼Ò¦¡

source: -n No swap file, use memory only
ko: -n ���� ���� ���� �޸𸮸� ����
pl: -n Zamiast pliku wymiany, u¿ywaj tylko pamiêci
zh_tw: -n ¤£¨Ï¥Î¼È¦sÀÉ, ¥u¨Ï¥Î°O¾ÐÅé

source: -r List swap files and exit
ko: -r ���� ���� ������ ǥ���� �� ������
pl: -r Wylicz pliki wymiany i zakoñcz
zh_tw: -r ¦C¥X¼È¦sÀÉ«áÂ÷¶}

source: -r (with file name) Recover crashed session
ko: -r (���� �̸��� �Բ�) �ļյǾ��� ���� ����
pl: -r (z nazw± pliku) Odtwórz za³aman± sesjê
zh_tw: -r (¥[ÀÉ¦W) ­×´_¤W¦¸·l·´ªº¸ê®Æ(Recover crashed session)

source: -L Same as -r
ko: -L -r�� ����
pl: -L To¿same z -r
zh_tw: -L ¦P -r

source: -A start in Arabic mode
ko: -A Arabic ������ ����
pl: -A rozpocznij w trybie arabskim
zh_tw: -A ±Ò°Ê¬° Arabic ¼Ò¦¡

source: -H Start in Hebrew mode
ko: -H Hebrew ������ ����
pl: -H rozpocznij w trybie hebrajskim
zh_tw: -H ±Ò°Ê¬° Hebrew ¼Ò¦¡

source: -F Start in Farsi mode
ko: -F Farsi ������ ����
pl: -F rozpocznij w trybie farsi
zh_tw: -F ±Ò°Ê¬° Farsi ¼Ò¦¡

source: -T <terminal> Set terminal type to <terminal>
ko: -T <terminal> �͹̳� ������ <terminal>�� ����
pl: -T <terminal> Ustaw typ terminala na <terminal>
zh_tw: -T <terminal> ³]©w²×ºÝ¾÷¬° <terminal>

source: -u <vimrc> Use <vimrc> instead of any .vimrc
ko: -u <vimrc> .vimrc ���� <vimrc>�� ����
pl: -u <vimrc> U¿yj <vimrc> zamiast jakiegokolwiek .vimrc
zh_tw: -u <vimrc> ¨Ï¥Î <vimrc> ¨ú¥N¥ô¦ó .vimrc

source: --noplugin Don't load plugin scripts
ko: --noplugin �÷����� ��ũ��Ʈ�� �ҷ������� ����
pl: --noplugin Nie ³aduj skryptów wtyczek
zh_tw: --noplugin ¤£¸ü¤J¥ô¦ó plugin

source: -p[N] Open N tab pages (default: one for each file)
ko: -p[N] N���� �� ���� (�⺻: ���Ϻ��� �ϳ�)
pl: -p[N] Otwórz N kart (domy¶lnie: po jednej dla ka¿dego pliku)

source: -o[N] Open N windows (default: one for each file)
ko: -o[N] N���� â ���� (�⺻: ���Ϻ��� �ϳ�)
pl: -o[N] Otwórz N okien (domy¶lnie: po jednym dla ka¿dego pliku)
zh_tw: -o[N] ¶}±Ò N ­Óµøµ¡ (¹w³]¬O¨C­ÓÀÉ®×¤@­Ó)

source: -O[N] Like -o but split vertically
ko: -O[N] -o�� ������ â�� �������� ������
pl: -O[N] tak samo jak -o tylko dziel okno pionowo
zh_tw: -O[N] ¦P -o ¦ý¨Ï¥Î««ª½¤À³Î

source: + Start at end of file
pl: + Zacznij na koñcu pliku
zh_tw: + ±Ò°Ê«á¸õ¨ìÀÉ®×µ²§À

source: +<lnum> Start at line <lnum>
ko: +<lnum> <lnum> �ٿ��� ����
pl: +<lnum> Zacznij w wierszu <lnum>
zh_tw: +<lnum> ±Ò°Ê«á¸õ¨ì²Ä <lnum> ¦æ

source: --cmd <command> Execute <command> before loading any vimrc file
ko: --cmd <����> vimrc ������ �б� ���� <����>�� ����
pl: -cmd <command> Wykonaj komendê <command> przed za³adowaniem jakiegokolwiek pliku vimrc
zh_tw: --cmd <command> ¸ü¤J¥ô¦ó vimrc «e°õ¦æ <command>

source: -c <command> Execute <command> after loading the first file
ko: -c <����> ù° ������ ���� �� <����>�� ����
pl: -c <command> Wykonaj komendê <command> po za³adowaniu pierwszego pliku
zh_tw: -c <command> ¸ü¤J²Ä¤@­ÓÀÉ®×«á°õ¦æ <command>

source: -S <session> Source file <session> after loading the first file
ko: -S <����> ù° ������ ���� �� <����> ���� �ҷ� ���̱�
pl: -S <sesja> Wczytaj plik <sesja> po za³adowaniu pierwszego pliku
zh_tw: -S <session> ¸ü¤J²Ä¤@­ÓÀÉ®×«á¸ü¤J Session ÀÉ <session>

source: -s <scriptin> Read Normal mode commands from file <scriptin>
ko: -s <scriptin> <scriptin> ���Ͽ��� Normal ���� ���� �б�
pl: -s <scriptin> Wczytuj komendy trybu normalnego z pliku <scriptin>
zh_tw: -s <scriptin> ±q <scriptin> Åª¤J¤@¯ë¼Ò¦¡©R¥O

source: -w <scriptout> Append all typed commands to file <scriptout>
ko: -w <scriptout> ���� �Էµ� ������ <scriptout> ���Ͽ� �߰�
pl: -w <scriptout> Do³±cz wszystkie wprowadzane komendy do pliku <scriptout>
zh_tw: -w <scriptout> ¹ïÀÉ®× <scriptout> ªþ¥[(append)©Ò¦³¿é¤Jªº©R¥O

source: -W <scriptout> Write all typed commands to file <scriptout>
ko: -W <scriptout> ���� �Էµ� ������ <scriptout> ���Ͽ� ����
pl: -W <scriptout> Zapisuj wszystkie wprowadzane komendy do pliku <scriptout>
zh_tw: -W <scriptout> ¹ïÀÉ®× <scriptout> ¼g¤J©Ò¦³¿é¤Jªº©R¥O

source: --startuptime <file> Write startup timing messages to <file>
ko: --startuptime <file> startup timing �޽����� <file>�� ����
pl: --startuptime <plik> Zapisz wiadomo¶ci o d³ugo¶ci startu do <plik>

source: -i <viminfo> Use <viminfo> instead of .viminfo
ko: -i <viminfo> .viminfo ���� <viminfo>�� ����
pl: -i <viminfo> U¿ywaj <viminfo> zamiast .viminfo
zh_tw: -i <viminfo> ¨Ï¥Î <viminfo> ¦Ó«D .viminfo

source: -h or --help Print Help (this message) and exit
ko: -h Ȥ�� --help ������(�� �޽���)�� ������ �� ������
pl: -h lub --help wy¶wietl Pomoc (czyli tê wiadomo¶æ) i zakoñcz
zh_tw: -h ©Î --help ¦L¥X»¡©ú(¤]´N¬O¥»°T®§)«áÂ÷¶}

source: --version Print version information and exit
ko: --version �� ������ ������ �� ������
pl: --version wy¶wietl informacjê o wersji i zakoñcz
zh_tw: --version ¦L¥Xª©¥»¸ê°T«áÂ÷¶}

source: No marks set
ko: ������ ��ũ�� �����ϴ�
pl: Brak zak³adek
zh_tw: ¨S¦³³]©w¼Ð°O (mark)

source: E283: No marks matching "%s"
ko: E283: "%s"�� �´� ��ũ�� �����ϴ�
pl: E283: ¯adna zak³adka nie pasuje do "%s"
zh_tw: E283: §ä¤£¨ì²Å¦X "%s" ªº¼Ð°O(mark)

source: mark line col file/text
ko: ��ũ ���� col ����/�ؽ�Ʈ
pl: zak³. wiersz kol plik/tekst
zh_tw: ¼Ð°O ¦æ¸¹ Äæ ÀÉ®×/¤å¦r

source: jump line col file/text
ko: ���� ���� col ����/�ؽ�Ʈ
pl: skok wiersz kol plik/tekst
zh_tw: jump ¦æ¸¹ Äæ ÀÉ®×/¤å¦r

source: change line col text
pl: zmieñ wrsz. kol tekst
zh_tw: §ïÅÜ ¦æ¸¹ Äæ ¤å¦r

source: # File marks:
ko: # ���� ��ũ:
pl: # Zak³adki w plikach:
zh_tw: # ÀÉ®×¼Ð°O:

source: # Jumplist (newest first):
pl: # Lista odniesieñ (pocz±wszy od najnowszych):
zh_tw: # Jumplist (¥Ñ·s¨ìÂÂ):

source: # History of marks within files (newest to oldest):
ko: # ���ϳ��� ��ũ �����丮 (���ͺ��� ������ ��):
pl: # Historia zak³adek w plikach (od najnowszych po najstarsze):
zh_tw: # ÀÉ®×¤º Mark °O¿ý (¥Ñ·s¨ìÂÂ):

source: Missing '>'
ko: '>'�� �����ϴ�
pl: Brak '>'
zh_tw: ¯Ê¤Ö¹ïÀ³ªº '>'

source: E293: block was not locked
ko: E293: ������ �������� �ʾҽ��ϴ�
pl: E293: blok nie by³ zablokowany
zh_tw: E293: °Ï¶ô¥¼³QÂê©w

source: E294: Seek error in swap file read
ko: E294: ���� ������ �б� ���� Ư�� ��ġ�� �� �� �����ϴ�
pl: E294: B³±d w trakcie czytania pliku wymiany
zh_tw: E294: ¼È¦sÀÉÅª¨ú¿ù»~

source: E295: Read error in swap file
ko: E295: ���� ������ ���� �� �����ϴ�
pl: E295: B³±d odczytu pliku wymiany
zh_tw: E295: ¼È¦sÀÉÅª¨ú¿ù»~

source: E296: Seek error in swap file write
ko: E296: ���� ������ ���� ���� Ư�� ��ġ�� �� �� �����ϴ�
pl: E296: B³±d szukania w pliku wymiany
zh_tw: E296: ¼È¦sÀÉ¼g¤J¿ù»~

source: E297: Write error in swap file
ko: E297: ���� ������ �� �� �����ϴ�
pl: E297: B³±d zapisu w pliku wymiany
zh_tw: E297: ¼È¦sÀÉ¼g¤J¿ù»~

source: E300: Swap file already exists (symlink attack?)
ko: E300: ���� ������ �̹� �����մϴ� (symlink ����?)
pl: E300: Plik wymiany ju¿ istnieje (atak symlink?)
zh_tw: E300: ¼È¦sÀÉ¤w¸g¦s¦b! (¤p¤ß²Å¸¹³sµ²ªº¦w¥þº|¬}!?)

source: E298: Didn't get block nr 0?
ko: E298: ���� ��ȣ 0�� ���� ���߳���?
pl: E298: Nie otrzyma³em bloku nr 0?
zh_tw: E298: §ä¤£¨ì°Ï¶ô 0?

source: E298: Didn't get block nr 1?
ko: E298: ���� ��ȣ 1�� ���� ���߳���?
pl: E298: Nie otrzyma³em bloku nr 1?
zh_tw: E298: §ä¤£¨ì°Ï¶ô 1?

source: E298: Didn't get block nr 2?
ko: E298: ���� ��ȣ 2�� ���� ���߳���?
pl: E298: Nie otrzyma³em bloku nr 2?
zh_tw: E298: §ä¤£¨ì°Ï¶ô 2?

source: E301: Oops, lost the swap file!!!
ko: E301: ����, ���� ������ �Ҿ����Ƚ��ϴ�!!!
pl: E301: Ojej, zgubi³em plik wymiany!!!
zh_tw: E301: ¾¾¾¾, ¼È¦sÀÉ¤£¨£¤F!!!

source: E302: Could not rename swap file
ko: E302: ���� ���� �̸��� �ٲ� �� �����ϴ�
pl: E302: Nie mog³em zmieniæ nazwy pliku wymiany
zh_tw: E302: µLªk§ïÅÜ¼È¦sÀÉªº¦WºÙ

source: E303: Unable to open swap file for "%s", recovery impossible
ko: E303: "%s"�� ���� ������ �� �� ��� ������ �Ұ����մϴ�
pl: E303: Nie mogê otworzyæ pliku wymiany dla "%s"; odtworzenie niemo¿liwe
zh_tw: E303: µLªk¶}±Ò¼È¦sÀÉ "%s", ¤£¥i¯à­×´_¤F

source: E304: ml_upd_block0(): Didn't get block 0??
ko: E304: ml_upd_block0(): ���� 0�� ���� ���߳���??
pl: E304: ml_upd_block(): Nie otrzyma³em bloku 0??

source: E305: No swap file found for %s
ko: E305: %s�� ���� ������ ã�� �� �����ϴ�
pl: E305: Nie znaleziono pliku wymiany dla %s
zh_tw: E305: §ä¤£¨ì %s ªº¼È¦sÀÉ

source: Enter number of swap file to use (0 to quit):
ko: ������ ���� ���� ��ȣ�� �Է��Ͻʽÿ� (0�� ������):
pl: Wprowad¼ numer pliku wymiany, którego u¿yæ (0 by wyj¶æ):
zh_tw: ½Ð¿ï¾Ü§A­n¨Ï¥Îªº¼È¦sÀÉ («ö0 Â÷¶}):

source: E306: Cannot open %s
ko: E306: %s��(��) �� �� �����ϴ�
pl: E306: Nie mogê otworzyæ %s
zh_tw: E306: µLªk¶}±Ò %s

source: Unable to read block 0 from
pl: Nie mogê odczytaæ bloku 0 z
zh_tw: µLªkÅª¨ú°Ï¶ô 0:

source: Maybe no changes were made or Vim did not update the swap file.
ko: � ������ �����ų� ���� ���� ������ �������� ���� �� �����ϴ�.
pl: Mo¿e nie wykonano zmian albo Vim nie zaktualizowa³ pliku wymiany.
zh_tw: ¥i¯à¬O§A¨S°µ¹L¥ô¦ó­×§ï©Î¬O Vim ÁÙ¨Ó¤£¤Î§ó·s¼È¦sÀÉ.

source: cannot be used with this version of Vim.
pl: nie mo¿e byæ stosowany z t± wersj± Vima.
zh_tw: µLªk¦b¥»ª©¥»ªº Vim ¤¤¨Ï¥Î.

source: Use Vim version 3.0.
ko: �� 3.0 ���� �����Ͻʽÿ�.
pl: U¿yj Vima w wersji 3.0.
zh_tw: ¨Ï¥Î Vim 3.0¡C

source: E307: %s does not look like a Vim swap file
ko: E307: %s��(��) �� ���� ������ �ƴ� �� �����ϴ�
pl: E307: %s nie wygl±da na plik wymiany Vima
zh_tw: E307: %s ¬Ý°_¨Ó¤£¹³¬O Vim ¼È¦sÀÉ

source: cannot be used on this computer.
ko: �� ��ǻ�Ϳ����� ������ �� �����ϴ�.
pl: nie mo¿e byæ stosowany na tym komputerze.
zh_tw: µLªk¦b³o»O¹q¸£¤W¨Ï¥Î.

source: The file was created on
pl: Ten plik zosta³ stworzony na
zh_tw: ¥»ÀÉ®×«Ø¥ß©ó

source: , or the file has been damaged.
pl: , lub plik zosta³ uszkodzony.
zh_tw: , ©Î¬O³oÀÉ®×¤w¸g·l·´¡C

source: has been damaged (page size is smaller than minimum value).
pl: zosta³ uszkodzony (wielko¶æ strony jest mniejsza ni¿ najmniejsza warto¶æ).

source: Using swap file "%s"
ko: ���� ���� "%s"��(��) �����մϴ�
pl: U¿ywam pliku wymiany "%s"
zh_tw: ¨Ï¥Î¼È¦sÀÉ "%s"

source: Original file "%s"
ko: ���� ���� "%s"
pl: Oryginalny plik "%s"
zh_tw: ­ì©lÀÉ "%s"

source: E308: Warning: Original file may have been changed
ko: E308: ����: ���� ������ �ٲ������ϴ�
pl: E308: OSTRZE¯ENIE: Oryginalny plik móg³ byæ zmieniony
zh_tw: E308: Äµ§i: ­ì©lÀÉ®×¥i¯à¤w¸g­×§ï¹L¤F

source: E309: Unable to read block 1 from %s
ko: E309: %s�� ���� 1�� ���� �� �����ϴ�
pl: E309: Nie mogê odczytaæ bloku 1 z %s
zh_tw: E309: µLªk±q %s Åª¨ú°Ï¶ô 1

source: ???MANY LINES MISSING
ko: ???���� ���� �Ҿ�����
pl: ???BRAKUJE WIELU WIERSZY
zh_tw: ???¯Ê¤Ö¤Ó¦h¦æ

source: ???LINE COUNT WRONG
ko: ???�� ��ȣ�� �߸��Ǿ����ϴ�
pl: ???LICZNIK WIERSZY NIEZGODNY
zh_tw: ???¦æ¸¹¿ù»~

source: ???EMPTY BLOCK
pl: ???PUSTY BLOK
zh_tw: ???ªÅªº BLOCK

source: ???LINES MISSING
ko: ???���� �Ҿ�����
pl: ???BRAKUJE WIERSZY
zh_tw: ???§ä¤£¨ì¤@¨Ç¦æ

source: E310: Block 1 ID wrong (%s not a .swp file?)
ko: E310: ���� 1�� ID�� �߸��Ǿ����ϴ� (%s��(��) .swp ������ �ƴѰ�?)
pl: E310: Niew³a¶ciwe ID bloku 1 (mo¿e %s nie jest plikiem .swp?)
zh_tw: E310: °Ï¶ô 1 ID ¿ù»~ (%s ¤£¬O¼È¦sÀÉ?)

source: ???BLOCK MISSING
ko: ???���� �Ҿ�����
pl: ???BRAK BLOKU
zh_tw: ???§ä¤£¨ìBLOCK

source: ??? from here until ???END lines may be messed up
ko: ??? �������� ???�������� ���� �������ϴ�
pl: ??? od tego miejsca po ???KONIEC wiersze mog± byæ pomieszane
zh_tw: ??? ±q³o¸Ì¨ì ???END ªº¤º®e¥i¯à¦³°ÝÃD

source: ??? from here until ???END lines may have been inserted/deleted
ko: ??? �������� ???�������� ���� �������ų� ������ ���� �� �����ϴ�
pl: ??? od tego miejsca po ???KONIEC wiersze mog± byæ w³o¿one/skasowane
zh_tw: ??? ±q³o¸Ì¨ì ???END ªº¤º®e¥i¯à³Q§R°£/´¡¤J¹L

source: ???END
pl: ???KONIEC

source: E311: Recovery Interrupted
ko: E311: ���� �ߴܵǾ����ϴ�
pl: E311: Przerwanie odtwarzania
zh_tw: E311: ­×´_¤w¤¤Â_

source: E312: Errors detected while recovering; look for lines starting with ???
ko: E312: ���� ���� ���� �������ϴ�; ???�� �����ϴ� ���� ã�ƺ��ʽÿ�
pl: E312: Wykryto b³êdy podczas odtwarzania; od których wierszy zacz±æ ???
zh_tw: E312: ­×´_®Éµo¥Í¿ù»~; ½Ðª`·N¶}ÀY¬° ??? ªº¦æ

source: See ":help E312" for more information.
ko: �� ���� ������ ������ ":help E312"�� �Է��ϼ���.
pl: Zobacz ":help E312" dla dalszych informacji.
zh_tw: ¸Ô²Ó»¡©ú½Ð¨£ ":help E312"

source: Recovery completed. You should check if everything is OK.
ko: ������ �������ϴ�. ���� �� ������ �� Ȯ���� ���ž߸� �մϴ�.
pl: Odtwarzanie zakoñczono. Powiniene¶ sprawdziæ czy wszystko jest w porz±dku.
zh_tw: ´_­ì§¹¦¨. ½Ð½T©w¤@¤Á¥¿±`.

source: (You might want to write out this file under another name
ko: (��¼�� �ٸ� �̸����� �����ϰ� ������ ���� �𸣰ڽ��ϴ�
pl: (Mo¿esz chcieæ zapisaæ ten plik pod inn± nazw±
zh_tw: (§A¥i¯à·|·Q­n§â³o­ÓÀÉ®×¥t¦s§OªºÀÉ¦W¡A

source: and run diff with the original file to check for changes)
ko: �׸��� �ٲ� ������ Ȯ���Ϸ��� ���� ���Ͽ� ���� diff�� �����ϼ���)
pl: i wykonaæ diff z oryginalnym plikiem aby sprawdziæ zmiany)

source: Recovery completed. Buffer contents equals file contents.
ko: ������ �������ϴ�. ������ ������ ���� ������ �����ϴ�.
pl: Odzyskiwanie zakoñczone. Zawarto¶æ bufora jest równa zawarto¶ci pliku.

source: You may want to delete the .swp file now.
ko: ���� .swp ������ �����ŵ� �˴ϴ�.
pl: Mo¿esz teraz chcieæ usun±æ plik .swp.

source: Swap files found:
ko: ���� ������ ã����:
pl: Znalezione pliki wymiany:
zh_tw: §ä¨ì¥H¤Uªº¼È¦sÀÉ:

source: In current directory:
ko: ���� �����丮��:
pl: W bie¿±cym katalogu:
zh_tw: ¦b¥Ø«eªº¥Ø¿ý:

source: Using specified name:
ko: ���õ� �̸��� ����:
pl: U¿ywam podanej nazwy:

source: In directory
pl: W katalogu
zh_tw: ¦b¥Ø¿ý

source: -- none --
pl: -- ¿aden --
zh_tw: -- µL --

source: owned by:
pl: posiadany przez:
zh_tw: ¾Ö¦³ªÌ:

source: dated:
pl: data:
zh_tw: ¤é´Á:

source: dated:
pl: data:
zh_tw: ¤é´Á:

source: [from Vim version 3.0]
pl: [po Vimie wersja 3.0]
zh_tw: [±q Vim ª©¥» 3.0]

source: [does not look like a Vim swap file]
ko: [�� ���� ���Ϸ� ������ �ʽ��ϴ�]
pl: [nie wygl±da na plik wymiany Vima]
zh_tw: [¤£¹³ Vim ªº¼È¦sÀÉ]

source: file name:
pl: nazwa pliku:
zh_tw: ÀÉ¦W:

source: modified:
pl: zmieniono:
zh_tw: ­×§ï¹L:

source: YES
pl: TAK
zh_tw: ¬O

source: no
ko: �ƴϿ�
pl: nie

source: user name:
pl: u¿ytkownik:
zh_tw: ¨Ï¥ÎªÌ:

source: host name:
ko: ȣ��Ʈ �̸�:
pl: nazwa hosta:
zh_tw: ¥D¾÷¦WºÙ:

source: host name:
ko: ȣ��Ʈ �̸�:
pl: nazwa hosta:
zh_tw: ¥D¾÷¦WºÙ:

source: process ID:
ko: ���μ��� ID:
pl: ID procesu:

source: (still running)
pl: (dalej dzia³a)
zh_tw: (°õ¦æ¤¤)

source: [not usable on this computer]
ko: [�� ��ǻ�Ϳ����� ������ �� ����]
pl: [nie do u¿ytku na tym komputerze]
zh_tw: [µLªk¦b¥»¹q¸£¤W¨Ï¥Î]

source: [cannot be read]
pl: [nieodczytywalny]
zh_tw: [µLªkÅª¨ú]

source: [cannot be opened]
pl: [nieotwieralny]
zh_tw: [µLªk¶}±Ò]

source: E313: Cannot preserve, there is no swap file
ko: E313: ������ �� �����ϴ�, ���� ������ �����ϴ�
pl: E313: Nie mogê zabezpieczyæ, bo brak pliku wymiany
zh_tw: E313: µLªk«O¯d, ¤£¨Ï¥Î¼È¦sÀÉ

source: File preserved
ko: ������ �����Ǿ����ϴ�
pl: Plik zabezpieczono
zh_tw: ÀÉ®×¤w«O¯d

source: E314: Preserve failed
ko: E314: ���� ������ �����߽��ϴ�
pl: E314: Nieudane zabezpieczenie
zh_tw: E314: «O¯d¥¢±Ñ

source: E315: ml_get: invalid lnum: %<PRId64>
ko: E315: ml_get: �߸��� lnum: %<PRId64>
pl: E315: ml_get: niew³a¶ciwy lnum: %<PRId64>
zh_tw: E315: ml_get: ¿ù»~ªº lnum: %<PRId64>

source: E316: ml_get: cannot find line %<PRId64>
ko: E316: ml_get: %<PRId64> ���� ã�� �� �����ϴ�
pl: E316: ml_get: nie znaleziono wiersza %<PRId64>
zh_tw: E316: ml_get: §ä¤£¨ì²Ä %<PRId64> ¦æ

source: E317: pointer block id wrong 3
ko: E317: �߸��� ������ ���� id 3
pl: E317: niepoprawne id wska¼nika bloku 3
zh_tw: E317: «ü¼Ð°Ï¶ô id ¿ù»~ 3

source: stack_idx should be 0
ko: stack_idx�� 0���߸� �մϴ�
pl: stack_idx powinien byæ 0
zh_tw: stack_idx À³¸Ó¬O 0

source: E318: Updated too many blocks?
ko: E318: �ʹ� ���� ������ ���ŵǾ�����?
pl: E318: Zaktualizowano zbyt wiele bloków?
zh_tw: E318: §ó·s¤Ó¦h°Ï¶ô?

source: E317: pointer block id wrong 4
ko: E317: �߸��� ������ ���� id 4
pl: E317: niepoprawne id wska¼nika bloku 4
zh_tw: E317: «ü¼Ð°Ï¶ô id ¿ù»~ 4

source: deleted block 1?
pl: blok nr 1 skasowany?
zh_tw: §R°£°Ï¶ô 1?

source: E320: Cannot find line %<PRId64>
ko: E320: %<PRId64> ���� ã�� �� �����ϴ�
pl: E320: Nie mogê znale¼æ wiersza %<PRId64>
zh_tw: E320: §ä¤£¨ì²Ä %<PRId64> ¦æ

source: E317: pointer block id wrong
ko: E317: �߸��� ������ ���� id
pl: E317: niepoprawne id bloku odniesienia
zh_tw: E317: «ü¼Ð°Ï¶ô id ¿ù»~

source: pe_line_count is zero
ko: pe_line_count�� 0�Դϴ�
pl: pe_line_count wynosi zero
zh_tw: pe_line_count ¬°¹s

source: E322: line number out of range: %<PRId64> past the end
ko: E322: �� ��ȣ�� ������ ������ϴ�: ���򸷿��� %<PRId64> ��ŭ
pl: E322: numer wiersza poza zakresem: %<PRId64> jest poza koñcem
zh_tw: E322: ¦æ¸¹¶W¥X½d³ò: %<PRId64> ¶W¹Lµ²§À

source: E323: line count wrong in block %<PRId64>
ko: E323: ���� %<PRId64>�� �� ������ Ʋ�Ƚ��ϴ�
pl: E323: liczba wierszy niepoprawna w bloku %<PRId64>
zh_tw: E323: °Ï¶ô %<PRId64> ¦æ¼Æ¿ù»~

source: Stack size increases
ko: ���� ũ�� ����
pl: Wielko¶æ stosu wzrasta
zh_tw: °ïÅ|¤j¤p¼W¥[

source: E317: pointer block id wrong 2
ko: E317: �߸��� ������ ���� id 2
pl: E317: niepoprawne id bloku odniesienia 2
zh_tw: E317: «ü¼Ð°Ï¶ô id ¿ù 2

source: E773: Symlink loop for "%s"
pl: E773: Pêtla dowi±zañ dla "%s"

source: E325: ATTENTION
ko: E325: �ָ�
pl: E325: UWAGA
zh_tw: E325: ª`·N

source: Found a swap file by the name "
pl: Znalaz³em plik wymiany o nazwie "
zh_tw: §ä¨ì¼È¦sÀÉ "

source: While opening file "
pl: Podczas otwierania pliku "
zh_tw: ¦b¶}±ÒÀÉ®× "

source: NEWER than swap file!
pl: NOWSZE od pliku wymiany!
zh_tw: ¤ñ¼È¦sÀÉ§ó·s!

source: Quit, or continue with caution.
pl: Zakoñcz lub ostro¿nie kontynuuj.

source: (2) An edit session for this file crashed.
pl: (2) Sesja edycji dla pliku za³ama³a siê.

source: If this is the case, use ":recover" or "vim -r
ko: ���� �׷��ٸ� ":recover" Ȥ�� "vim -r
pl: Je¶li tak, to u¿yj ":recover" lub "vim -r
zh_tw: ¦pªG¬O³o¼Ë, ½Ð¥Î ":recover" ©Î "vim -r

source: " to recover the changes (see ":help recovery").
ko: " �� �����Ͽ� �����Ͻʽÿ� (":help recovery" ����).
pl: " aby odzyskaæ zmiany (zobacz ":help recovery)").
zh_tw: " ¨Ó±Ï¦^­×§ï¸ê®Æ (¸Ô²Ó»¡©ú½Ð¬Ý ":help recovery").

source: If you did this already, delete the swap file "
ko: �̹� �����ϼ̾��ٸ� �������� "
pl: Je¶li ju¿ to zrobi³e¶, usuñ plik wymiany "
zh_tw: ¦pªG¸Ó±Ïªº³£¤w¸g±Ï¤F, ½Ðª½±µ§R°£¦¹¼È¦sÀÉ "

source: " to avoid this message.
ko: " ��(��) �����ž� �� �޽����� �������ϴ�.
pl: " aby unikn±æ tej wiadomo¶ci.
zh_tw: " ¥HÁ×§K¦A¬Ý¨ì¦¹°T®§.

source: Swap file "
pl: Plik wymiany "
zh_tw: ¼È¦sÀÉ "

source: " already exists!
ko: "�� �̹� �����մϴ�!
pl: " ju¿ istnieje!
zh_tw: " ¤w¸g¦s¦b¤F!

source: VIM - ATTENTION
pl: VIM - UWAGA
zh_tw: VIM - ª`·N

source: Swap file already exists!
ko: ���� ������ �̹� �����մϴ�!
pl: Plik wymiany ju¿ istnieje!
zh_tw: ¼È¦sÀÉ¤w¸g¦s¦b!

source: &Open Read-Only &Edit anyway &Recover &Quit &Abort
ko: �б� �������� ����(&O) �׳� ��ġ��(&E) ����(&R) ������(&Q) �򸮱�(&A)
pl: &Otwórz Read-Only &Edytuj pomimo O&dtwórz &Zakoñcz &Porzuæ
zh_tw: ¥H°ßÅª¤è¦¡¶}±Ò(&O) ª½±µ½s¿è(&E) ­×´_(&R) Â÷¶}(&Q) ¸õ¥X(&A)

source: &Open Read-Only &Edit anyway &Recover &Delete it &Quit &Abort
ko: �б� �������� ����(&O) ������ ����(&E) ����(&R) ����(&D) ������(&Q) �򸮱�(&A)
pl: &Otwórz Read-Only &Edytuj pomimo O&dtwórz &Usuñ &Zakoñcz &Porzuæ

source: E326: Too many swap files found
ko: E326: �ʹ� ���� ���� ������ �߰ߵǾ����ϴ�
pl: E326: Znaleziono zbyt wiele plików wymiany
zh_tw: E326: §ä¨ì¤Ó¦h¼È¦sÀÉ

source: E342: Out of memory! (allocating %<PRIu64> bytes)
ko: E342: �޸��� ����! (%<PRIu64> ����Ʈ�� �Ҵ�)
pl: E342: Brak pamiêci! (rezerwacja %<PRIu64> bajtów)
zh_tw: E342: °O¾ÐÅé¤£¨¬! (¹Á¸Õ°t¸m %<PRIu64> ¦ì¤¸²Õ)

source: E327: Part of menu-item path is not sub-menu
ko: E327: �޴� �׸� ������ �κ��� ���� �޴��� �ƴմϴ�
pl: E327: Czê¶æ tropu punktu menu nie okre¶la podmenu
zh_tw: E327: ³¡¥÷¿ï¶µ¸ô®|¤£¬O¤l¿ï³æ
