Repository: neovim/neovim
Catalog: src/po/*.po
Languages: sk

source: (lang)
sk: (jazyk)

source: (paste)
sk: (vlo¾i»)

source: VISUAL
sk: VIZUÁLNE

source: VISUAL LINE
sk: VIZUÁLNY RIADOK

source: VISUAL BLOCK
sk: VIZUÁLNY BLOK

source: SELECT
sk: ZHODY

source: SELECT LINE
sk: OZNAÈ RIADOK

source: SELECT BLOCK
sk: OZNAÈ BLOK

source: recording
sk: nahrávam

source: E383: Invalid search string: %s
sk: E383: Neprípustný hµadaný re»azec: %s

source: E384: search hit TOP without match for: %s
sk: E384: hµadanie dosiahlo zaèiatok bez nájdenia %s

source: E385: search hit BOTTOM without match for: %s
sk: E385: hµadanie dosiahlo koniec bez nájdenia %s

source: E386: Expected '?' or '/' after ';'
sk: E386: Po ';' oèakávam '?' alebo '/'

source: (includes previously listed match)
sk: (vrátane u¾ vypísaných zhôd)

source: --- Included files
sk: --- Vlo¾ené súbory

source: not found
sk: nenájdené

source: in path ---
sk: v ceste ---

source: (Already listed)
sk: (U¾ vypísané)

source: NOT FOUND
sk: NENÁJDENÉ

source: Scanning included file: %s
sk: Prehµadávam vlo¾ené súbory: %s

source: E387: Match is on current line
sk: E387: Zhoda je na aktuálnom riadku

source: All included files were found
sk: V¹etky vlo¾ené súbory boli nájdené

source: No included files
sk: ®iadne vlo¾ené súbory

source: E388: Couldn't find definition
sk: E388: Nedá sa nájs» definícia

source: E389: Couldn't find pattern
sk: E389: Nedá sa nájs» vzor

source: E759: Format error in spell file
sk: E759: Chyba formátovania v spell súbore (kontrola pravopisu)

source: E758: Truncated spell file
sk: E758: Odseknutý spell súbor (kontrola pravopisu)

source: Trailing text in %s line %d: %s
sk: Prebytoèný text v %s na riadku %d: %s

source: Affix name too long in %s line %d: %s
sk: Prípona príli¶ dlhá v %s riadok %d: %s

source: E761: Format error in affix file FOL, LOW or UPP
sk: E761: Chyba formátovania v súbore prípon FOL, LOW alebo UPP (NASLEDUJE, MALÉ alebo VE¥KÉ)

source: E762: Character in FOL, LOW or UPP is out of range
sk: E762: Znak v FOL, LOW alebo UPP (NASLEDUJE, MALÉ alebo VE¥KÉ) je mimo rozsah

source: Compressing word tree...
sk: Robím kompresiu stromu slov...

source: E756: Spell checking is not enabled
sk: E756: Kontrola pravopisu nie je zapnutá

source: Warning: Cannot find word list "%s.%s.spl" or "%s.ascii.spl"
sk: Varovanie: Nemo¾no nájs» zoznam slov "%s.%s.spl" alebo "%s.ascii.spl"

source: Reading spell file "%s"
sk: Èítam slovníkový súbor "%s"

source: E757: This does not look like a spell file
sk: E757: Toto sa nezdá by» slovníkovým súborom

source: E771: Old spell file, needs to be updated
sk: E771: Starý slovníkový súbor, potrebuje by» zaktualizovaný

source: E772: Spell file is for newer version of Vim
sk: E772: Slovníkový súbor je pre nov¹iu verziu Vim

source: E770: Unsupported section in spell file
sk: E770: Nepodporovaná sekcia v slovníkovom súbore

source: Warning: region %s not supported
sk: Varovanie: región %s nie je podporovaný

source: Reading affix file %s ...
sk: Naèítavam súbor s príponami %s ...

source: Conversion failure for word in %s line %d: %s
sk: Konverzia slova zlyhala v %s riadok %d: %s

source: Conversion in %s not supported: from %s to %s
sk: Konverzia v %s nie je podporovaná: z %s do %s

source: Conversion in %s not supported
sk: Konverzia v %s nie je podporovaná

source: Invalid value for FLAG in %s line %d: %s
sk: Neplatná hodnota pre príznak (FLAG) v %s riadok %d: %s

source: FLAG after using flags in %s line %d: %s
sk: Príznak (FLAG) po pou¾ití príznakov v %s riadok %d: %s

source: Character used for SLASH must be ASCII; in %s line %d: %s
sk: Znak pou¾itý pre SLASH musí by» ASCII; v %s riadok %d: %s

source: Wrong COMPOUNDMAX value in %s line %d: %s
sk: Zlá hodnota COMPOUNDMAX v %s riadok %d: %s

source: Wrong COMPOUNDMIN value in %s line %d: %s
sk: Zlá hodnota COMPOUNDMIN v %s riadok %d: %s

source: Wrong COMPOUNDSYLMAX value in %s line %d: %s
sk: Zlá hodnota COMPOUNDSYLMAX v %s riadok %d: %s

source: Different combining flag in continued affix block in %s line %d: %s
sk: Rozdielna kombinácia príznakov v nasledujúcom bloku prípon v %s riadok %d: %s

source: Duplicate affix in %s line %d: %s
sk: Duplicitná prípona v %s riadok %d: %s

source: Affix also used for BAD/RAR/KEP/NEEDAFFIX/NEEDCOMPOUND in %s line %d: %s
sk: Prípona pou¾itá aj pre BAD/RAR/KEP/NEEDAFFIX/NEEDCOMPOUND in %s line %d: %s

source: Expected Y or N in %s line %d: %s
sk: Oèakávane Y alebo N v %s riadok %d: %s

source: Broken condition in %s line %d: %s
sk: Naru¹ená podmienka v %s riadok %d: %s

source: Expected REP count in %s line %d
sk: Oèakávam poèet REP v %s riadok %d

source: Expected MAP count in %s line %d
sk: Oèakávam poèet MAP v %s riadok %d

source: Duplicate character in MAP in %s line %d
sk: Opakovaný znak v MAP v %s riadok %d

source: Unrecognized or duplicate item in %s line %d: %s
sk: Nerozpoznaná alebo opakujúca sa polo¾ka v %s riadok %d: %s

source: Missing FOL/LOW/UPP line in %s
sk: Chýbajúci riadok FOL/LOW/UPP v %s

source: COMPOUNDSYLMAX used without SYLLABLE
sk: COMPOUNDSYLMAX pou¾itý bez SYLLABLE

source: Too many postponed prefixes
sk: Príli¹ mnoho odlo¾ených prípon

source: Too many compound flags
sk: Príli¹ mnoho upravovacích príznakov

source: Too many postponed prefixes and/or compound flags
sk: Príli¹ mnoho odlo¾ených prípon a/alebo upravovacích príznakov

source: Missing SOFO%s line in %s
sk: Chýba SOFO%s riadok v %s

source: Both SAL and SOFO lines in %s
sk: SAL a SOFO riadky zároveò v %s

source: Flag is not a number in %s line %d: %s
sk: Príznak nie je èíslo v %s na riadku %d: %s

source: Illegal flag in %s line %d: %s
sk: Neprípustný príznak v %s riadok %d: %s

source: %s value differs from what is used in another .aff file
sk: Hodnota %s sa odli¹uje od hodnoty pou¾itej v inom .aff súbore

source: Reading dictionary file %s ...
sk: Naèítavam slovník %s ...

source: E760: No word count in %s
sk: E760: Chýajúci poèet slov v %s

source: line %6d, word %6d - %s
sk: riadok %6d, slovo %6d - %s

source: Duplicate word in %s line %d: %s
sk: Opakujúce sa slovo v %s riadok %d: %s

source: First duplicate word in %s line %d: %s
sk: Prvé duplicitné slovo v %s riadok %d: %s

source: %d duplicate word(s) in %s
sk: %d duplicitné slovo(á) v %s

source: Ignored %d word(s) with non-ASCII characters in %s
sk: Ignorovaných %d slov s nepísmennými znakmi v %s

source: Reading word file %s ...
sk: Naèítavam súbor so slovami %s ...

source: Duplicate /encoding= line ignored in %s line %d: %s
sk: Duplicitný riadok /encoding= v %s riadok %d ignorovaný: %s

source: /encoding= line after word ignored in %s line %d: %s
sk: /encoding= riadok nasledujúci po slove v %s riadok %d ignorovaný: %s

source: Duplicate /regions= line ignored in %s line %d: %s
sk: Duplicitný riadok /regions= v %s riadok %d ignorovaný: %s

source: Too many regions in %s line %d: %s
sk: Príli¹ mnoho regiónov v %s riadok %d: %s

source: / line ignored in %s line %d: %s
sk: Riadok / v %s riadok %d ignorovaný: %s

source: Invalid region nr in %s line %d: %s
sk: Pou¾íté chybné èíslo regiónu v %s riadok %d: %s

source: Unrecognized flags in %s line %d: %s
sk: Nerozpoznaný príznak v %s riadok %d: %s

source: Ignored %d words with non-ASCII characters
sk: Ignorovaných %d slov s nepísmennými znakmi

source: Compressed %d of %d nodes; %d%% remaining
sk: Skomprimovaných %d z %d uzlov; %d%% zostáva

source: E751: Output file name must not have region name
sk: E751: Výstupné meno súboru nesmie ma» názov regiónu

source: E754: Only up to 8 regions supported
sk: E754: Podporovaných max. 8 regiónov

source: E755: Invalid region in %s
sk: E755: Chybný región v %s

source: Warning: both compounding and NOBREAK specified
sk: Varovanie: ¹pecifikované spájanie a nezalamovanie

source: Writing spell file %s ...
sk: Ukládám slovníkový súbor %s ...

source: Done!
sk: Hotovo!

source: Estimated runtime memory use: %d bytes
sk: Veµkos» pou¾ívanej pamäte: %d bajtov

source: E765: 'spellfile' does not have %ld entries
sk: E765: 'spellfile' nemá %ld polo¾iek

source: E763: Word characters differ between spell files
sk: E763: Znaky slov sa odli¹ujú medzi slovníkovými súbormi

source: Sorry, no suggestions
sk: Prepáète, ¾iadne návrhy

source: Sorry, only %ld suggestions
sk: Prepáète, iba %ld návrhov

source: Change "%.*s" to:
sk: Zmeni» "%.*s" na:

source: E752: No previous spell replacement
sk: E752: ®iadny predchádzajúce nahradenie podµa slovníka

source: E753: Not found: %s
sk: E753: Nenájdené: %s

source: E783: duplicate char in MAP entry
sk: E783: duplicitný znak v MAP polo¾ke

source: E390: Illegal argument: %s
sk: E390: Neprípustný argument: %s

source: E391: No such syntax cluster: %s
sk: E391: Syntaktická zostava %s neexistuje

source: No Syntax items defined for this buffer
sk: Pre tento buffer nie sú definované ¾iadne polo¾ky syntaxe

source: syncing on C-style comments
sk: synchronizujem podµa komentárov jazyka C

source: no syncing
sk: ¾iadne synchronizácie

source: syncing starts
sk: synchronizácia zaèína

source: lines before top line
sk: riadkov pred zaèiatkom

source: --- Syntax sync items ---
sk: --- Polo¾ky synchronizácie syntaxe ---

source: syncing on items
sk: synchronizujem polo¾ky

source: --- Syntax items ---
sk: --- Polo¾ky syntaxe ---

source: E392: No such syntax cluster: %s
sk: E392: Syntaktická zostava %s neexistuje

source: minimal
sk: minimálne

source: maximal
sk: maximálne

source: ; match
sk: ; zhoda

source: line breaks
sk: zalomení riadkov

source: E395: contains argument not accepted here
sk: E395: obsahuje argumenty, ktoré tu nie sú povolené

source: E396: containedin argument not accepted here
sk: E396: obsahuje argumenty, ktoré tu nie sú povolené

source: E393: group[t]here not accepted here
sk: E393: group[t]here nesmie by» na tomto mieste

source: E394: Didn't find region item for %s
sk: E394: Pre %s chýba polo¾ka regiónu

source: E397: Filename required
sk: E397: Vy¾adovaný názov súboru

source: E789: Missing ']': %s
sk: E789: Chýba ']': %s

source: E398: Missing '=': %s
sk: E398: Chýba '=': %s

source: E399: Not enough arguments: syntax region %s
sk: E399: Príli¹ málo argumentov: oblas» syntaxe %s

source: E400: No cluster specified
sk: E400: Nebola zadaná ¾iadna zostava

source: E401: Pattern delimiter not found: %s
sk: E401: Oddeµovaè vzoru %s nenájdený

source: E402: Garbage after pattern: %s
sk: E402: Chyba za vzorom: %s

source: E403: syntax sync: line continuations pattern specified twice
sk: E403: synchronizácia syntaxe: vzor pokraèovania riadkov zadaný dvakrát

source: E404: Illegal arguments: %s
sk: E404: Chybné argumenty: %s

source: E405: Missing equal sign: %s
sk: E405: Chýba znamienko rovná sa: %s

source: E406: Empty argument: %s
sk: E406: Prázdny argument: %s

source: E407: %s not allowed here
sk: E407: %s tu nie je povolené

source: E408: %s must be first in contains list
sk: E408: %s musí by» prvý v 'contains' zozname

source: E409: Unknown group name: %s
sk: E409: Neznámy názov skupiny: %s

source: E410: Invalid :syntax subcommand: %s
sk: E410: Chybný podradený príkaz :syntax : %s

source: E679: recursive loop loading syncolor.vim
sk: E679: rekurzívna sluèka pri naèítavaní syncolor.vim

source: E411: highlight group not found: %s
sk: E411: skupina zvýraznenia %s nebola nájdená

source: E412: Not enough arguments: ":highlight link %s"
sk: E412: Príli¹ málo argumentov: ":highlight link %s"

source: E413: Too many arguments: ":highlight link %s"
sk: E413: Príli¹ mnoho argumentov: ":highlight link %s"

source: E414: group has settings, highlight link ignored
sk: E414: skupina je nastavená, odkaz na zvýrazòovaciu skupinu ignorovaný

source: E415: unexpected equal sign: %s
sk: E415: neoèakávané znamienko rovná sa: %s

source: E416: missing equal sign: %s
sk: E416: chýba znamienko rovná sa: %s

source: E417: missing argument: %s
sk: E417: chýba argument: %s

source: E418: Illegal value: %s
sk: E418: Neprípustná hodnota: %s

source: E419: FG color unknown
sk: E419: farba popredia nie je známa

source: E420: BG color unknown
sk: E420: farba pozadia nie je známa

source: E421: Color name or number not recognized: %s
sk: E421: Názov alebo èíslo farby nebolo rozpoznané: %s

source: E422: terminal code too long: %s
sk: E422: terminálový kód je príli¹ dlhý: %s

source: E423: Illegal argument: %s
sk: E423: Neprípustný argument: %s

source: E424: Too many different highlighting attributes in use
sk: E424: Pou¾ívaných príli¹ veµa odli¹ných zvýrazòovacích vlastností

source: E669: Unprintable character in group name
sk: E669: Netlaèitelný znak v mene skupiny

source: W18: Invalid character in group name
sk: W18: Chybný znak v mene skupiny

source: E555: at bottom of tag stack
sk: E555: na konci zoznamu tagov

source: E556: at top of tag stack
sk: E556: na zaèiatku zoznamu tagov

source: E425: Cannot go before first matching tag
sk: E425: Nedá sa skoèi» pred prvý vyhovujúci tag

source: E426: tag not found: %s
sk: E426: tag %s nenájdený

source: # pri kind tag
sk: # pri typ tag

source: file
sk: súbor

source: E427: There is only one matching tag
sk: E427: Vyhovuje iba jeden tag

source: E428: Cannot go beyond last matching tag
sk: E428: Za posledný vyhovujúci tag sa nedá preskoèi»

source: File "%s" does not exist
sk: Súbor "%s" neexistuje

source: tag %d of %d%s
sk: tag %d z %d%s

source: or more
sk: alebo viac

source: Using tag with different case!
sk: Pou¾ívam tag s písmom inej veµkosti!

source: E429: File "%s" does not exist
sk: E429: Súbor "%s" neexistuje

source: # TO tag FROM line in file/text
sk: # CIE¥ tag ©TART riadok v súbore/texte

source: Searching tags file %s
sk: Prehµadávam súbor tagov %s

source: E430: Tag file path truncated for %s
sk: E430: Cesta k súboru tagov %s bola orezaná

source: E431: Format error in tags file "%s"
sk: E431: Chyba formátovania v súbore tagov "%s"

source: Before byte %ld
sk: Pred bajtom %ld

source: E432: Tags file not sorted: %s
sk: E432: Obsah súboru tagov %s nie je zoradený

source: E433: No tags file
sk: E433: ®iadny súbor tagov

source: E434: Can't find tag pattern
sk: E434: Nedá sa nájs» vzor tagov

source: E435: Couldn't find tag, just guessing!
sk: E435: Tag sa nedá nájs», iba hádam!

source: ' not known. Available builtin terminals are:
sk: ' nie je známy. Dostupné vstavané terminály:

source: defaulting to '
sk: nastavujem na '

source: E557: Cannot open termcap file
sk: E557: Nedá sa otvori» termcap súbor

source: E558: Terminal entry not found in terminfo
sk: E558: Terminfo neobsahuje polo¾ku pre tento terminál

source: E559: Terminal entry not found in termcap
sk: E559: Termcap neobsahuje polo¾ku pre tento terminál

source: E436: No "%s" entry in termcap
sk: E436: Termcap neobsahuje polo¾ku "%s"

source: E437: terminal capability "cm" required
sk: E437: Terminál musí ma» schopnos» "cm" (schopnos» pohybu kurzora)

source: --- Terminal keys ---
sk: --- Klávesy terminálu ---

source: new shell started
sk: spustený nový shell

source: Vim: Error reading input, exiting...
sk: Vim: Chyba pri èítaní vstupu, konèím...

source: No undo possible; continue anyway
sk: Odstránenie zmien nie je mo¾né; chcete napriek tomu pokraèova»

source: E438: u_undo: line numbers wrong
sk: E438: u_undo: èísla riadkov sú chybné

source: 1 change
sk: 1 zmena

source: %ld changes
sk: %ld zmien

source: E439: undo list corrupt
sk: E439: záznam o zmenách po¹kodený

source: E440: undo line missing
sk: E440: chýba opravný riadok

source: MS-Windows 16/32-bit GUI version
sk: 16/32 bitová GUI verzia pre MS Windows

source: MS-Windows 32-bit GUI version
sk: 32 bitová GUI verzia pre MS Windows

source: in Win32s mode
sk: vo Win32 re¾ime

source: with OLE support
sk: s OLE podporou

source: MS-Windows 32-bit console version
sk: 32 bitová verzia pre MS Windows konzolu

source: MS-Windows 16-bit version
sk: 16 bitová verzia pre MS Windows

source: 32-bit MS-DOS version
sk: 32 bitová verzia pre MS-DOS

source: 16-bit MS-DOS version
sk: 16 bitová MS-DOS verzia

source: MacOS X (unix) version
sk: MacOS X (unix) verzia

source: MacOS X version
sk: MacOS X verzia

source: MacOS version
sk: MacOS verzia

source: RISC OS version
sk: RISC OS verzia

source: Included patches:
sk: Pou¾ité záplaty:

source: Modified by
sk: Zmenil

source: Compiled
sk: Prelo¾ená

source: Huge version
sk: Maximálna verzia

source: Big version
sk: Veµká verzia

source: Normal version
sk: Normálna verzia

source: Small version
sk: Malá verzia

source: Tiny version
sk: Minimálna verzia

source: without GUI.
sk: bez grafického rozhrania.

source: with GTK2-GNOME GUI.
sk: s grafickým rozhraním GTK2-GNOME.

source: with GTK-GNOME GUI.
sk: s grafickým rozhraním GTK-GNOME.

source: with GTK2 GUI.
sk: s grafickým rozhraním GTK2.

source: with GTK GUI.
sk: s grafickým rozhraním GTK.

source: with X11-Motif GUI.
sk: s grafickým rozhraním X11-Motif.

source: with X11-neXtaw GUI.
sk: s grafickým rozhraním X11-neXtaw.

source: with X11-Athena GUI.
sk: s grafickým rozhraním X11-Athena.

source: with Photon GUI.
sk: s grafickým rozhraním Photon.

source: with GUI.
sk: s grafickým rozhraním.

source: with Carbon GUI.
sk: s grafickým rozhraním Carbon.

source: with Cocoa GUI.
sk: s grafickým rozhraním Cocoa.

source: with (classic) GUI.
sk: s klasickým grafickým rozhraním.

source: with KDE GUI.
sk: s grafickým rozhraním KDE.

source: Features included (+) or not (-):
sk: Vlastnosti zahrnuté (+) a nezahrnuté (-):

source: system vimrc file: "
sk: systémový vimrc súbor: "

source: user vimrc file: "
sk: u¾ívateµský vimrc súbor: "

source: 2nd user vimrc file: "
sk: druhý u¾ívateµský vimrc súbor: "

source: 3rd user vimrc file: "
sk: tretí u¾ívateµský vimrc súbor: "

source: user exrc file: "
sk: u¾ívateµský exrc súbor: "

source: 2nd user exrc file: "
sk: druhý u¾ívateµský exrc súbor: "

source: system gvimrc file: "
sk: systémový gvimrc súbor: "

source: user gvimrc file: "
sk: u¾ívateµský gvimrc súbor: "

source: 2nd user gvimrc file: "
sk: druhý u¾ívateµský gvimrc súbor: "

source: 3rd user gvimrc file: "
sk: tretí u¾ívateµský gvimrc súbor: "

source: system menu file: "
sk: systémový súbor s ponukou: "

source: fall-back for $VIM: "
sk: implicitná hodnota $VIM:"

source: f-b for $VIMRUNTIME: "
sk: f-b pre $VIMRUNTIME: "

source: Compilation:
sk: Preklad:

source: Compiler:
sk: Prekladaè:

source: Linking:
sk: Zlinkované:

source: DEBUG BUILD
sk: PODPORA LADENIA

source: version
sk: verzia

source: by Bram Moolenaar et al.
sk: od Brama Moolenaara a ïal¹ích

source: Vim is open source and freely distributable
sk: Vim je voµne ¹íriteµný program s otvoreným kódom

source: Help poor children in Uganda!
sk: Pomô¾te chudobným de»om v Ugande!

source: type :help iccf<Enter> for information
sk: zadajte :help iccf<Enter> pre informácie

source: type :q<Enter> to exit
sk: zadajte :q<Enter> pre ukonèenie programu

source: type :help<Enter> or <F1> for on-line help
sk: zadajte :help<Enter> alebo <F1> pre pomocníka

source: type :help version7<Enter> for version info
sk: zadajte :help version7<Enter> pre informácie o verzii

source: Running in Vi compatible mode
sk: Pracujem v re¾ime kompatibility s Vi

source: type :set nocp<Enter> for Vim defaults
sk: zadajte :set nocp<Enter> pre implicitné nastavenie Vim

source: type :help cp-default<Enter> for info on this
sk: podrobnej¹ie informácie získate pomocou :help cp-default<Enter>

source: menu Help->Orphans for information
sk: bli¾¹ie informácie v ponuke Pomocník->Samostatné

source: Running modeless, typed text is inserted
sk: Spú¹»am v bezmódovom re¾ime, písaný text je vlo¾ený

source: menu Edit->Global Settings->Toggle Insert Mode
sk: ponuka Úpravy->Globálne mo¾nosti->Prepnú» re¾im vlo¾enia

source: for two modes
sk: pre dva re¾imy

source: menu Edit->Global Settings->Toggle Vi Compatible
sk: ponuka Úpravy->Globálne mo¾nostt->Prepnú» Vi kompatibilný re¾im

source: for Vim defaults
sk: pre predvolené vlastnosti Vim

source: Sponsor Vim development!
sk: Zasponzorujte vývoj Vimu!

source: Become a registered Vim user!
sk: Staòte sa registrovaným u¾ívateµom Vimu!

source: type :help sponsor<Enter> for information
sk: zadajte :help sponsor<Enter> pre informácie

source: type :help register<Enter> for information
sk: zadajte :help register<Enter> pre informácie

source: menu Help->Sponsor/Register for information
sk: bli¾¹ie informácie v ponuke Pomocník->Sponzor/Registrácia

source: WARNING: Windows 95/98/ME detected
sk: VAROVANIE: detekované Windows 95/98/ME

source: type :help windows95<Enter> for info on this
sk: zadajte :help windows95<Enter> pre podrobnej¹ie informácie

source: E441: There is no preview window
sk: E441: Nenájdené ¾iadne okno náhµadu

source: E442: Can't split topleft and botright at the same time
sk: E442: Okno sa nedá rozdeli» zároveò v móde 'vrchný-µavý' a 'spodný-pravý' ('topleft' a 'botright')

source: E443: Cannot rotate when another window is split
sk: E443: Nedá sa rotova», ak je iné okno rozdelené

source: E444: Cannot close last window
sk: E444: Posledné okno sa nedá zatvori»

source: Already only one window
sk: Existuje u¾ iba jedno okno

source: E445: Other window contains changes
sk: E445: Iné okno obsahuje zmeny

source: E446: No file name under cursor
sk: E446: Pod kurzorom sa nenachádza názov súboru

source: E447: Can't find file "%s" in path
sk: E447: Súbor "%s" sa nedá nájs» v ceste

source: E370: Could not load library %s
sk: E370: Nepodarilo sa nahra» kni¾nicu %s

source: Sorry, this command is disabled: the Perl library could not be loaded.
sk: Prepáète, tento príkaz je vypnutý, Perl kni¾nica nemô¾e by» naèítaná.

source: E299: Perl evaluation forbidden in sandbox without the Safe module
sk: E299: Vykonanie kódu v jazyku Perl nie je mo¾né v bezpeènostnej schránke bez bezpeènostného modulu

source: Edit with &multiple Vims
sk: Upravi» s viacerý&mi Vimmi

source: Edit with single &Vim
sk: Upravi» s jedným &Vimom

source: Diff with Vim
sk: Porovna» &Vimom

source: Edit with &Vim
sk: Upravi» s &Vimom

source: Edit with existing Vim -
sk: Upravi» s existujúcim Vimom -

source: Edits the selected file(s) with Vim
sk: Upravi» vybrané súbory s Vimom

source: Error creating process: Check if gvim is in your path!
sk: Chyba vytvárania procesu: Skontrolujte, èi je gvim vo va¹ej ceste!

source: gvimext.dll error
sk: chyba gvimext.dll

source: Path length too long!
sk: Príli¹ dlhá cesta!

source: --No lines in buffer--
sk: --Buffer neobsahuje ¾iadne riadky--

source: E470: Command aborted
sk: E470: Príkaz preru¹ený

source: E471: Argument required
sk: E471: Je vy¾adovaný argument

source: E10: \ should be followed by /, ? or &
sk: E10: po \ by malo nasledova» /, ? alebo &

source: E11: Invalid in command-line window; <CR> executes, CTRL-C quits
sk: E11: Chybný príkaz v okne príkazového riadku; <Enter> spú¹»a, CTRL-C ukonèuje

source: E12: Command not allowed from exrc/vimrc in current dir or tag search
sk: E12: Príkaz nie je z exrc/vimrc v aktuálnom adresári alebo pri hµadaní tagu povolený.

source: E171: Missing :endif
sk: E171: Chýba :endif

source: E600: Missing :endtry
sk: E600: Chýba :endtry

source: E170: Missing :endwhile
sk: E170: Chýba :endwhile

source: E170: Missing :endfor
sk: E170: Chýba :endfor

source: E588: :endwhile without :while
sk: E588: :endwhile bez zodpovedajúceho :while

source: E588: :endfor without :for
sk: E588: :endfor bez zodpovedajúceho :for

source: E13: File exists (add ! to override)
sk: E13: Súbor existuje (pou¾ite ! pre prepísanie)

source: E472: Command failed
sk: E472: Príkaz zlyhal

source: E234: Unknown fontset: %s
sk: E234: Neznáma sada písiem: %s

source: E235: Unknown font: %s
sk: E235: Neznáme písmo: %s

source: E236: Font "%s" is not fixed-width
sk: E236: Písmo "%s" nemá pevnú ¹írku

source: E473: Internal error
sk: E473: Vnútorná chyba

source: Interrupted
sk: Preru¹ené

source: E14: Invalid address
sk: E14: Chybná adresa

source: E474: Invalid argument
sk: E474: Chybný argument

source: E475: Invalid argument: %s
sk: E475: Chybný argument: %s
