Repository: neovim/neovim
Catalog: src/po/*.po
Languages: sk

source: E259: no matches found for cscope query %s of %s
sk: E259: cscope hµadanie %s vo vzore %s nena¹lo ¾iadnu zhodu

source: E469: invalid cscopequickfix flag %c for %c
sk: E469: chybný cscopequickfix príznak %c pre %c

source: cscope commands:
sk: príkazy cscope:

source: %-5s: %-30s (Usage: %s)
sk: %-5s: %-30s (Pou¾itie: %s)

source: E625: cannot open cscope database: %s
sk: E625: nemo¾no otvori» cscope databázu: %s

source: E626: cannot get cscope database information
sk: E626: nemo¾no získa» cscope databázové informácie

source: E568: duplicate cscope database not added
sk: E568: duplicitná cscope databáza nebola pridaná

source: E569: maximum number of cscope connections reached
sk: E569: dosiahnutý maximálny poèet cscope spojení

source: E261: cscope connection %s not found
sk: E261: cscope spojenie %s nenájdené

source: cscope connection %s closed
sk: cscope spojenie %s ukonèené

source: E570: fatal error in cs_manage_matches
sk: E570: vá¾na chyba v cs_manage_matches

source: # line
sk: # riadok

source: filename / context / line
sk: názov súboru/ kontext / riadok

source: E609: Cscope error: %s
sk: E609: Chyba cscope: %s

source: All cscope databases reset
sk: V¹etky cscope databáze resetované

source: no cscope connections
sk: ¾iadne cscope spojenia

source: # pid database name prepend path
sk: # pid názov databázy predpona cesty

source: ???: Sorry, this command is disabled, the MzScheme library could not be loaded.
sk: ???: Prepáète, tento príkaz je vypnutý, MzScheme kni¾nica nemô¾e by» naèítaná.

source: invalid expression
sk: chybný výraz

source: expressions disabled at compile time
sk: podpora výrazov bola vypnutá pri preklade programu

source: hidden option
sk: skrytá voµba

source: unknown option
sk: neznáma voµba

source: window index is out of range
sk: èíslo okna mimo rozsah

source: couldn't open buffer
sk: nemo¾no otvori» buffer

source: cannot save undo information
sk: nedajú sa ulo¾i» zálo¾ne (opravné) informácie

source: cannot delete line
sk: nedá sa vymaza» riadok

source: cannot replace line
sk: nedá sa nahradi» riadok

source: cannot insert line
sk: nedá sa vlo¾i» riadok

source: string cannot contain newlines
sk: re»azec nesmie obsahova» znaky nového riadku

source: Vim error: ~a
sk: Chyba Vim: ~a

source: Vim error
sk: Chyba Vim

source: buffer is invalid
sk: buffer je neplatný

source: window is invalid
sk: okno je neplatné

source: linenr out of range
sk: èíslo riadka mimo rozsah

source: not allowed in the Vim sandbox
sk: nie je dovolené v bezpeènostnej schránke

source: E263: Sorry, this command is disabled, the Python library could not be loaded.
sk: E262: Prepáète, tento príkaz je vypnutý, Python kni¾nica nemô¾e by» naèítaná.

source: E659: Cannot invoke Python recursively
sk: E659: Python nemô¾e by» spustený rekurzívne

source: can't delete OutputObject attributes
sk: nedá sa vymaza» vlastnos» OutputObject

source: softspace must be an integer
sk: softspace musí by» kladné celé èíslo

source: invalid attribute
sk: chybná vlastnos»

source: writelines() requires list of strings
sk: writelines() vy¾aduje zoznam re»azcov

source: E264: Python: Error initialising I/O objects
sk: E264: Python: Chyba pri inicializácii I/O objektov

source: attempt to refer to deleted buffer
sk: pokus o odkaz na vymazaný buffer

source: line number out of range
sk: èíslo riadka mimo rozsah

source: <buffer object (deleted) at %8lX>
sk: <objekt bufferu (vymazaný) na %8lX>

source: invalid mark name
sk: chybné meno znaèky

source: no such buffer
sk: ¾iadny taký buffer

source: attempt to refer to deleted window
sk: pokus o odkaz na vymazané okno

source: readonly attribute
sk: vlastnos» iba pre èítanie

source: cursor position outside buffer
sk: umiestnenie kurzoru mimo buffer

source: <window object (deleted) at %.8lX>
sk: <objekt okna (vymazaný) na %.8lX>

source: <window object (unknown) at %.8lX>
sk: <objekt okna (neznámy) na %.8lX>

source: <window %d>
sk: <okno %d>

source: no such window
sk: ¾iadne také okno

source: E266: Sorry, this command is disabled, the Ruby library could not be loaded.
sk: E266: Prepáète, tento príkaz je vypnutý, Ruby kni¾nica nemô¾e by» naèítaná.

source: E273: unknown longjmp status %d
sk: E273: Neznámy 'longjmp' stav %d

source: Toggle implementation/definition
sk: Prepnú» implementáciu/definíciu

source: Show base class of
sk: Ukáza» základnú triedu

source: Show overridden member function
sk: Ukáza» pre»a¾enú èlenskú funkciu

source: Retrieve from file
sk: Obnovi» zo súboru

source: Retrieve from project
sk: Obnovi» z projektu

source: Retrieve from all projects
sk: Obnovi» zo v¹etkých projektov

source: Retrieve
sk: Obnovi»

source: Show source of
sk: Ukáza» zdroj

source: Find symbol
sk: Nájs» znak

source: Browse class
sk: Prezrie» triedu

source: Show class in hierarchy
sk: Ukáza» triedu v hierarchii

source: Show class in restricted hierarchy
sk: Ukáza» triedu v obmedzenej hierarchii

source: Xref refers to
sk: Xref odkazuje na

source: Xref referred by
sk: Xref odkázaný z

source: Xref has a
sk: Xref má

source: Xref used by
sk: Xref pou¾itý

source: Show docu of
sk: Ukáza» dokumentáciu

source: Generate docu for
sk: Vytvori» dokumentáciu pre

source: Cannot connect to SNiFF+. Check environment (sniffemacs must be found in $PATH).
sk: Zlyhalo pripojenie na SNiFF+, Preverte prostredie (sniffemacs sa musí nachádza» v $PATH).

source: E274: Sniff: Error during read. Disconnected
sk: E274: Sniff: Chyba poèas èítania. Odpojené

source: SNiFF+ is currently
sk: SNiFF+ je aktuálne

source: not
sk: ne

source: connected
sk: pripojený

source: E275: Unknown SNiFF+ request: %s
sk: E275: Neznáma SNiFF+ po¾iadavka: %s

source: E276: Error connecting to SNiFF+
sk: E276: Chyba pripojenia na SNiFF+

source: E278: SNiFF+ not connected
sk: E278: SNiFF+ nie je pripojený

source: E279: Not a SNiFF+ buffer
sk: E279: Nie je SNiFF+ bufferom

source: Sniff: Error during write. Disconnected
sk: Sniff: Chyba zápisu. Odpojené

source: invalid buffer number
sk: chybné èíslo bufferu

source: not implemented yet
sk: nie je e¹te podporované

source: cannot set line(s)
sk: nedajú sa nastavi» riadky

source: mark not set
sk: znaèka nie je nastavená

source: row %d column %d
sk: riadok %d ståpec %d

source: cannot insert/append line
sk: nedá sa vlo¾i»/pripoji» riadok

source: unknown flag:
sk: neznámy príznak:

source: unknown vimOption
sk: neznáma voµba (vimOption)

source: keyboard interrupt
sk: preru¹enie z klávesnice

source: vim error
sk: chyba Vim

source: cannot create buffer/window command: object is being deleted
sk: nedá sa vytvori» príkaz bufferu/okna: objekt bude vymazaný

source: cannot register callback command: buffer/window is already being deleted
sk: nedá sa zaregistrova» príkaz spätného volania: buffer/okno u¾ bol vymazaný

source: E280: TCL FATAL ERROR: reflist corrupt!? Please report this to vim-dev@vim.org
sk: E280: TCL FATAL ERROR: reflist po¹kodený!? Oznámte, prosím, túto chybu na vim-dev@vim.org

source: cannot register callback command: buffer/window reference not found
sk: nedá sa zaregistrova» príkaz spätného volania: odkaz na buffer/okno nenájdený

source: E571: Sorry, this command is disabled: the Tcl library could not be loaded.
sk: E571: Prepáète, tento príkaz je vypnutý, Tcl kni¾nica nemô¾e by» naèítaná.

source: E281: TCL ERROR: exit code is not int!? Please report this to vim-dev@vim.org
sk: E281: TCL CHYBA: návratový kód nie je celé èíslo!? Oznámte, prosím, túto chybu na vim-dev@vim.org

source: E572: exit code %d
sk: E572: návratový kód %d

source: cannot get line
sk: nedá sa preèíta» riadok

source: Unable to register a command server name
sk: Nemô¾em zaregistrova» meno príkazového servra

source: E248: Failed to send command to the destination program
sk: E248: Chyba poèas prenosu príkazu do cieµového programu

source: E573: Invalid server id used: %s
sk: E573: Pou¾íté chybné èíslo servera: %s

source: E251: VIM instance registry property is badly formed. Deleted!
sk: E251: VIM registrová vlastnos» je zle formátovaná. Vymazané!

source: Unknown option argument
sk: Neznámy parameter voµby

source: Too many edit arguments
sk: Príli¹ mnoho upravovacích argumentov

source: Argument missing after
sk: Chýba argument po

source: Garbage after option argument
sk: Chyby za parametrom voµby

source: Too many "+command", "-c command" or "--cmd command" arguments
sk: Príli¹ mnoho "+príkaz", "-c príkaz" alebo "--cmd príkaz" argumentov

source: Invalid argument for
sk: Chybný argument pre

source: %d files to edit
sk: %d súborov pre úpravu

source: This Vim was not compiled with the diff feature.
sk: Tento Vim nebol kompilovaný s porovnávacími funkciami.

source: Attempt to open script file again: "
sk: Pokus o opätovné otvorenie skriptu: "

source: Cannot open for reading: "
sk: Nedá sa otvori» pre zápis: "

source: Cannot open for script output: "
sk: Nedá sa otvori» pre výstup skriptu: "

source: Vim: Error: Failure to start gvim from NetBeans
sk: Vim: Chyba: Chyba spú¹»ania gvim pre NetBeans

source: Vim: Warning: Output is not to a terminal
sk: Vim: Varovanie: Výstup nesmeruje na terminál

source: Vim: Warning: Input is not from a terminal
sk: Vim: Varovanie: Vstup nepochádza z terminálu

source: pre-vimrc command line
sk: pre-vimrc príkazový riadok

source: E282: Cannot read from "%s"
sk: E282: Nedá sa èíta» z "%s"

source: More info with: "vim -h"
sk: Podrobnej¹ie informácie získáte pomocou "vim -h"

source: [file ..] edit specified file(s)
sk: [súbor ..] .. upravi» súbor(y)

source: - read text from stdin
sk: - èíta» text z ¹tandardného vstupu

source: -t tag edit file where tag is defined
sk: -t tag upravi» súbor na mieste definície tagu

source: -q [errorfile] edit file with first error
sk: -q [chybový súbor] upravi» súbor na mieste výskytu prvej chyby

source: usage:
sk: pou¾itie:

source: vim [arguments]
sk: vim [argumenty]

source: or:
sk: alebo:

source: where case is ignored prepend / to make flag upper case
sk: v prípade, ¾e je ignorovaná veµkos» písmen, pou¾ite znak '/' na zaèiatku, aby mal príznak význam veµkého písmena

source: Arguments:
sk: Argumenty:

source: -- Only file names after this
sk: -- Mô¾u nasledova» iba názvy súborov

source: --literal Don't expand wildcards
sk: --literal Nexpandova» ¾olíkové znaky (wildcards)

source: -register Register this gvim for OLE
sk: -register Prihlási» gvim na OLE

source: -unregister Unregister gvim for OLE
sk: -register Odhlási» gvim z OLE

source: -g Run using GUI (like "gvim")
sk: -g Spusti» v grafickom (GUI) móde (rovnaké ako "gvim")

source: -f or --nofork Foreground: Don't fork when starting GUI
sk: -f alebo --nofork Popredie: Pri spustení grafického (GUI) módu sa nepresunie do pozadia

source: -v Vi mode (like "vi")
sk: -v Vi mód (rovnaké ako "vi")

source: -e Ex mode (like "ex")
sk: -e Ex mód (rovnaké ako "ex")

source: -s Silent (batch) mode (only for "ex")
sk: -s Tichý (dávkový) mód (iba pre "ex")

source: -d Diff mode (like "vimdiff")
sk: -d Porovnávací mód (rovnaké ako "vimdiff")

source: -y Easy mode (like "evim", modeless)
sk: -y Jednoduchý mód (rovnaké ako "evim", bezmódový)

source: -R Readonly mode (like "view")
sk: -R Mód iba pre èítanie (ako "view")

source: -Z Restricted mode (like "rvim")
sk: -Z Obmedzený mód (rovnaké ako "rvim")

source: -m Modifications (writing files) not allowed
sk: -m Zmeny (ukladanie súborov) zakázané

source: -M Modifications in text not allowed
sk: -M Zmeny v texte zakázané

source: -b Binary mode
sk: -b Binárny mód

source: -l Lisp mode
sk: -l Lisp mód

source: -C Compatible with Vi: 'compatible'
sk: -C Kompatabilný s Vi: 'compatible'

source: -N Not fully Vi compatible: 'nocompatible'
sk: -N Kompatibilita s Vi vypnutá: 'nocompatible'

source: -V[N] Verbose level
sk: -V[N] Úroveò výpisu hlá¹ok

source: -D Debugging mode
sk: -D Ladiaci mód

source: -n No swap file, use memory only
sk: -n Nevytvára» odkladací súbor, pou¾íva» iba pamä»

source: -r List swap files and exit
sk: -r Vypí¹ zoznam odkladacích súborov a skonèi

source: -r (with file name) Recover crashed session
sk: -r (s názvom súboru) Obnoví preru¹ené sedenie

source: -L Same as -r
sk: -L Rovnaké ako -r

source: -f Don't use newcli to open window
sk: -f Nebude pou¾íva» newcli pre otvorenie okna

source: -dev <device> Use <device> for I/O
sk: -dev <zariadenie> Pou¾i» <zariadenie> pre I/O

source: -A start in Arabic mode
sk: -A spusti v Arabic móde

source: -H Start in Hebrew mode
sk: -H spusti v hebrejskom móde

source: -F Start in Farsi mode
sk: -F spusti vo Farsi móde

source: -T <terminal> Set terminal type to <terminal>
sk: -T <terminál> Nastaví typ terminálu na <terminál>

source: -u <vimrc> Use <vimrc> instead of any .vimrc
sk: -u <vimrc> Pou¾ije <vimrc> namiesto akéhokoµvek .vimrc

source: -U <gvimrc> Use <gvimrc> instead of any .gvimrc
sk: -U <gvimrc> Pou¾ije <gvimrc> namiesto akéhokoµvek .gvimrc

source: --noplugin Don't load plugin scripts
sk: --noplugin Nenahrá zásuvné moduly(plugin skripty)

source: -o[N] Open N windows (default: one for each file)
sk: -o[N] Otvorí N okien (implicitne jedno pre ka¾dý súbor)

source: -O[N] Like -o but split vertically
sk: -O[N] Ako -o ale rozdelí vertikálne

source: + Start at end of file
sk: + Nastaví kurzor na koniec súboru

source: +<lnum> Start at line <lnum>
sk: +<riadok> Nastaví kurzor na <riadok>

source: --cmd <command> Execute <command> before loading any vimrc file
sk: --cmd <príkaz> Vykoná <príkaz> pred nahratím vimrc súboru

source: -c <command> Execute <command> after loading the first file
sk: -c <príkaz> Po nahratí prvého súboru vykoná <príkaz>

source: -S <session> Source file <session> after loading the first file
sk: -S <sedenie> Po nahratí prvého súboru vykoná príkazy v súbore <sedenie>

source: -s <scriptin> Read Normal mode commands from file <scriptin>
sk: -s <skript> Naèíta príkazy normálneho módu zo <skriptu>

source: -w <scriptout> Append all typed commands to file <scriptout>
sk: -w <skript> Pripojí v¹etky napísané príkazy do súboru <skript>

source: -W <scriptout> Write all typed commands to file <scriptout>
sk: -W <skript> Ulo¾í v¹etky napísané príkazy do súboru <skript>

source: -x Edit encrypted files
sk: -x Úprava za¹ifrovaných súborov

source: -display <display> Connect vim to this particular X-server
sk: -display <displej> Pripojí vim na príslu¹ný X-server

source: -X Do not connect to X server
sk: -X Nepripojí sa k X serveru

source: --remote <files> Edit <files> in a Vim server if possible
sk: --remote <súbory> Upravi» <súbory> na Vim servri ak je to mo¾né

source: --remote-silent <files> Same, don't complain if there is no server
sk: --remote-silent <súbory> To isté, ale nes»a¾uj si, ak neexistuje server

source: --remote-wait <files> As --remote but wait for files to have been edited
sk: --remote-wait <súbory> Ako --remote ale èaká na súbory pre ukonèenie úprav

source: --remote-wait-silent <files> Same, don't complain if there is no server
sk: --remote-wait-silent <súbory> To isté, ale nes»a¾uj si, ak neexistuje server

source: --remote-send <keys> Send <keys> to a Vim server and exit
sk: --remote-send <voµby> Odo¹le <voµby> na Vim server a skonèí

source: --remote-expr <expr> Evaluate <expr> in a Vim server and print result
sk: --remote-expr <výraz> Spusti <výraz> na servri a vytlaèí výsledok

source: --serverlist List available Vim server names and exit
sk: --serverlist Vypí¹e zoznam mien dostupných Vim servrov a skonèí

source: --servername <name> Send to/become the Vim server <name>
sk: --servername <názov> Odo¹le na Vim server <názov>

source: -i <viminfo> Use <viminfo> instead of .viminfo
sk: -i <viminfo> Pou¾ije <viminfo> namiesto akéhokoµvek .viminfo

source: -h or --help Print Help (this message) and exit
sk: -h alebo --help Vypí¹e túto nápovedu a skonèí

source: --version Print version information and exit
sk: --version Vypí¹e informácie o verzii a skonèí

source: Arguments recognised by gvim (Motif version):
sk: Argumenty dostupné pre gvim (Motif verzia):

source: Arguments recognised by gvim (neXtaw version):
sk: Argumenty dostupné pre gvim (neXtaw verzia):

source: Arguments recognised by gvim (Athena version):
sk: Argumenty dostupné pre gvim (Athena verzia):

source: -display <display> Run vim on <display>
sk: -display <displej> Spustí vim na <displej>

source: -iconic Start vim iconified
sk: -iconic Spustí vim minimalizované

source: -name <name> Use resource as if vim was <name>
sk: -name <názov> Pou¾ije resource ako by vim mal <názov>

source: (Unimplemented)
sk: (nie je implementované)

source: -background <color> Use <color> for the background (also: -bg)
sk: -background <farba> Nastaví sa <farba> pozadia (tie¾ -bg)

source: -foreground <color> Use <color> for normal text (also: -fg)
sk: -foreground <farba> Nastaví sa <farba> popredia (tie¾ -fg)

source: -font <font> Use <font> for normal text (also: -fn)
sk: -font <písmo> Nastaví <písmo> normálneho textu (tie¾ -fn)

source: -boldfont <font> Use <font> for bold text
sk: -boldfont <písmo> Nastaví <písmo> pre zvýraznený text

source: -italicfont <font> Use <font> for italic text
sk: -italicfont <písmo> Nastaví <písmo> pre kurzívu

source: -geometry <geom> Use <geom> for initial geometry (also: -geom)
sk: -geometry <geometrie> Nastaví sa <geometria> (tie¾ -geom)

source: -borderwidth <width> Use a border width of <width> (also: -bw)
sk: -borderwidth <¹írka> Nastaví <¹írku> okrajov (tie¾ -bw)

source: -scrollbarwidth <width> Use a scrollbar width of <width> (also: -sw)
sk: -scrollbarwidth <¹írka> Nastaví <¹írku> posuvnej li¹ty (tie¾ -sw)

source: -menuheight <height> Use a menu bar height of <height> (also: -mh)
sk: -menuheight <vý¹ka> Nastaví <vý¹ku> ponuky (tie¾ -mh)

source: -reverse Use reverse video (also: -rv)
sk: -reverse Pou¾ije reverzné farby (tie¾ -rv)

source: +reverse Don't use reverse video (also: +rv)
sk: +reverse Nepou¾ije reverzné farby (tie¾ +rv)

source: -xrm <resource> Set the specified resource
sk: -xrm <resource> Nastaví zadaný <resource>

source: Arguments recognised by gvim (RISC OS version):
sk: Argumenty dostupné pre gvim (RISC OS verzia):

source: --columns <number> Initial width of window in columns
sk: --columns <poèet> Poèiatoèná ¹írka okna v ståpcoch

source: --rows <number> Initial height of window in rows
sk: --rows <poèet> Poèiatoèná vý¹ka okna v riadkoch

source: Arguments recognised by gvim (GTK+ version):
sk: Argumenty dostupné pre gvim (GTK+ verzia):

source: -display <display> Run vim on <display> (also: --display)
sk: -display <displej> Spustí vim na <displej> (tie¾ --display)

source: --role <role> Set a unique role to identify the main window
sk: -role <rola> Nastaví unikátnu rolu pre identifikáciu hlavného okna

source: --socketid <xid> Open Vim inside another GTK widget
sk: --socketid <xid> Otvorí Vim vnútri iného GTK programu.

source: Arguments recognised by kvim (KDE version):
sk: Argumenty dostupné pre kvim (KDE verzia):

source: -black Use reverse video
sk: -black Pou¾ije reverzné farby

source: -tip Display the tip dialog on startup
sk: -tip Zobraz tip pri ¹tarte

source: -notip Disable the tip dialog
sk: -notip Nezobrazuj tip pri ¹tarte

source: --display <display> Run vim on <display>
sk: -display <displej> Spustí vim na <displej>

source: -P <parent title> Open Vim inside parent application
sk: -P <titulok rodièa> Otvor Vim vnútri materskej aplikácie

source: No display
sk: Bez grafického rozhrania

source: : Send failed.
sk: : Odoslanie zlyhalo.

source: : Send failed. Trying to execute locally
sk: : Odoslanie zlyhalo. Pokú¹am sa spusti» lokálne

source: %d of %d edited
sk: %d upravených súborov z %d

source: No display: Send expression failed.
sk: ®iaden graf. mód: Odoslanie výrazu zlyhalo.

source: : Send expression failed.
sk: : Odoslanie výrazu zlyhalo.

source: No marks set
sk: Nie sú nastavené ¾iadne znaèky

source: E283: No marks matching "%s"
sk: E283:"%s" nevyhovujú ¾iadne znaèky

source: mark line col file/text
sk: znaèka riadok ståpec súbor/text

source: jump line col file/text
sk: skok riadok ståpec súbor/text

source: change line col text
sk: znaèka riadok ståpec text

source: # File marks:
sk: # Súborové znaèky:

source: # Jumplist (newest first):
sk: # Zoznam skokov (zaèínajúci najnov¹ou polo¾kou):

source: # History of marks within files (newest to oldest):
sk: # História znaèiek v súboroch (zaèínajúci najnov¹ou polo¾kou):

source: Missing '>'
sk: Chýba '>'

source: E543: Not a valid codepage
sk: E543: Chybná kódová stránka

source: E284: Cannot set IC values
sk: E284: Nedajú sa nastavi» IC hodnoty

source: E285: Failed to create input context
sk: E285: Nepodarilo sa vytvori» vstupný kontext

source: E286: Failed to open input method
sk: E286: Nepodarilo sa otvori» vstupnú metódu

source: E287: Warning: Could not set destroy callback to IM
sk: E287: Varovanie: likvidaèné spätné volanie sa nedá nastavi» na IM

source: E288: input method doesn't support any style
sk: E288: vstupná metóda nepodporuje ¾iadny ¹týl

source: E289: input method doesn't support my preedit type
sk: E289: vstupná metóda nepodporuje môj 'preedit' typ

source: E290: over-the-spot style requires fontset
sk: E290: Nadbodový ¹týl vy¾aduje sadu fontov (fontset)

source: E291: Your GTK+ is older than 1.2.3. Status area disabled
sk: E291: Máte GTK+ verziu star¹iu ne¾ 1.2.3. Stavová plocha vypnutá.

source: E292: Input Method Server is not running
sk: E292: Server vstupných metód nebe¾í

source: E293: block was not locked
sk: E293: blok nebol zamknutý

source: E294: Seek error in swap file read
sk: E294: Chyba posunu pri èítaní odkladacieho súboru

source: E295: Read error in swap file
sk: E295: Chyba pri èítaní odkladacieho súboru

source: E296: Seek error in swap file write
sk: E296: Chyba posunu pri ukladaní do odkladacieho súboru

source: E297: Write error in swap file
sk: E297: Chyba pri ukladaní do odkladacieho súboru

source: E300: Swap file already exists (symlink attack?)
sk: E300: Odkladací súbor u¾ existuje (symlink útok?)

source: E298: Didn't get block nr 0?
sk: E298: Nedá sa získa» blok 0?

source: E298: Didn't get block nr 1?
sk: E298: Nedá sa získa» blok 1?

source: E298: Didn't get block nr 2?
sk: E298: Nedá sa získa» blok 2?

source: E301: Oops, lost the swap file!!!
sk: E301: Ups, odkladací súbor bol stratený!!!

source: E302: Could not rename swap file
sk: E302: Nedá sa premenova» odkladací súbor

source: E303: Unable to open swap file for "%s", recovery impossible
sk: E303: Nedá sa otvori» odkladací súbor pre "%s", oprava nemo¾ná

source: E304: ml_upd_block0(): Didn't get block 0??
sk: E304: ml_upd_block0(): nedá sa získa» blok 0??

source: E305: No swap file found for %s
sk: E305: Odkladací súbor pre %s nebol nájdený

source: Enter number of swap file to use (0 to quit):
sk: Zadajte èíslo odkladacieho súboru, ktorý sa má pou¾it (0 pre ukonèenie):

source: E306: Cannot open %s
sk: E306: Nedá sa otvori» %s

source: Unable to read block 0 from
sk: Nedá sa èíta» blok 0 z

source: Maybe no changes were made or Vim did not update the swap file.
sk: Mo¾no nedo¹lo k ¾iadnym zmenám, alebo Vim neaktualizoval odkladací súbor.

source: cannot be used with this version of Vim.
sk: nedá sa pou¾i» s touto verziou Vim.

source: Use Vim version 3.0.
sk: Pou¾ite Vim verziu 3.0.

source: E307: %s does not look like a Vim swap file
sk: E307: %s sa nezdá by» odkladacím súborom Vim

source: cannot be used on this computer.
sk: nedá sa pou¾í» na tomto poèítaèi.

source: The file was created on
sk: Súbor bol vytvorený

source: , or the file has been damaged.
sk: , alebo bol súbor po¹kodený.

source: Using swap file "%s"
sk: Pou¾ívam odkladací súbor "%s"

source: Original file "%s"
sk: Pôvodný súbor "%s"

source: E308: Warning: Original file may have been changed
sk: E308: Varovanie: Pôvodný súbor mohol by» zmenený

source: E309: Unable to read block 1 from %s
sk: E309: Nedá sa èíta» blok 1 z %s

source: ???MANY LINES MISSING
sk: ???CHÝBA MNOHO RIADKOV
