Repository: neovim/neovim
Catalog: src/po/*.po
Languages: sk

source: E15: Invalid expression: %s
sk: E15: Chybný výraz: %s

source: E16: Invalid range
sk: E16: Chybný rozsah

source: E476: Invalid command
sk: E476: Chybný príkaz

source: E17: "%s" is a directory
sk: E17: "%s" je adresárom

source: E364: Library call failed for "%s()"
sk: E364: Vyvolanie kni¾niènej funkcia zlyhalo pre "%s()"

source: E448: Could not load library function %s
sk: E448: Nepodarilo sa nahra» funkciu kni¾nice %s

source: E19: Mark has invalid line number
sk: E19: Znaèka má chybné èíslo riadku

source: E20: Mark not set
sk: E20: Znaèka nie je nastavená

source: E21: Cannot make changes, 'modifiable' is off
sk: E21: Nemo¾no robi» zmeny, voµba 'modifiable' je vypnutá

source: E22: Scripts nested too deep
sk: E22: Skripty vnorené príli¹ hlboko

source: E23: No alternate file
sk: E23: ®iadny alternatívny súbor

source: E24: No such abbreviation
sk: E24: Taká skratka neexistuje

source: E477: No ! allowed
sk: E477: ! nie je povolený

source: E25: GUI cannot be used: Not enabled at compile time
sk: E25: Nedá sa pou¾í» GUI: nebolo zapnuté pri preklade programu

source: E26: Hebrew cannot be used: Not enabled at compile time
sk: E26: Nedá sa pou¾í» hebrejský re¾im: nebol zapnutý pri preklade programu

source: E27: Farsi cannot be used: Not enabled at compile time
sk: E27: Nedá sa pou¾í» farsi re¾im: nebol zapnutý pri preklade programu

source: E800: Arabic cannot be used: Not enabled at compile time
sk: E800: Nedá sa pou¾í» arabic re¾im: nebol zapnutý pri preklade programu

source: E28: No such highlight group name: %s
sk: E28: Skupina zvýraznenia %s neexistuje

source: E29: No inserted text yet
sk: E29: Zatiaµ nie je vlo¾ený ¾iaden text

source: E30: No previous command line
sk: E30: ®iadny predchádzajúci príkazový riadok

source: E31: No such mapping
sk: E31: Mapovanie nenájdené

source: E479: No match
sk: E479: ®iadna zhoda

source: E480: No match: %s
sk: E480: ®iadna zhoda: %s

source: E32: No file name
sk: E32: ®iadny názov súboru

source: E33: No previous substitute regular expression
sk: E33: ®iadny predchádzajúci prislúchajúci správny výraz

source: E34: No previous command
sk: E34: ®iadny predchádzajúci príkaz

source: E35: No previous regular expression
sk: E35: ®iadny predchádzajúci regulárny výraz

source: E481: No range allowed
sk: E481: Rozsah nie je povolený

source: E36: Not enough room
sk: E36: Nedostatok miesta

source: E247: no registered server named "%s"
sk: E247: ¾iaden registrovaný server pomenovaný "%s"

source: E482: Can't create file %s
sk: E482: Nedá sa vytvori» súbor %s

source: E483: Can't get temp file name
sk: E483: Nedá sa získa» názov doèasného súboru

source: E484: Can't open file %s
sk: E484: Nedá sa otvori» súbor %s

source: E485: Can't read file %s
sk: E485: Nedá sa èíta» súbor %s

source: E37: No write since last change (add ! to override)
sk: E37: Neulo¾ené zmeny (pou¾ite ! pre vynútenie)

source: E38: Null argument
sk: E38: Nulový argument

source: E39: Number expected
sk: E39: Oèakávané èíslo

source: E40: Can't open errorfile %s
sk: E40: Nedá sa otvori» chybový súbor %s

source: E233: cannot open display
sk: E233: nedá sa otvori» displej

source: E41: Out of memory!
sk: E41: Nedostatok pamäti!

source: Pattern not found
sk: Vzor nenájdený

source: E486: Pattern not found: %s
sk: E486: Vzor nenájdený: %s

source: E487: Argument must be positive
sk: E487: Argument musí by» kladný

source: E459: Cannot go back to previous directory
sk: E459: ®iadny predchádzajúci adresár

source: E42: No Errors
sk: E42: ®iadne chyby

source: E43: Damaged match string
sk: E43: Po¹kodený re»azac pre vyhµadávanie

source: E44: Corrupted regexp program
sk: E44: Po¹kodený regexp program

source: E45: 'readonly' option is set (add ! to override)
sk: E45: voµba 'readonly' (iba na èítanie) je nastavená (pou¾ite ! pre prepísanie)

source: E46: Cannot change read-only variable "%s"
sk: E46: Nedá sa nastavi» premenná len na èítanie "%s"

source: E46: Cannot set variable in the sandbox: "%s"
sk: E46: Nedá sa nastavi» premenná v bezpeènostnej schránke: "%s"

source: E47: Error while reading errorfile
sk: E47: Chyba pri èítaní chybového súboru

source: E48: Not allowed in sandbox
sk: E48: Nie je dovolené v bezpeènostnej schránke

source: E523: Not allowed here
sk: E523: Nie je na povolené na tomto mieste

source: E359: Screen mode setting not supported
sk: E359: Nastavovanie re¾imu obrazovky nie je podporované

source: E49: Invalid scroll size
sk: E49: Chybná hodnota veµkosti rolovania

source: E91: 'shell' option is empty
sk: E91: voµba 'shell' je prázdna

source: E255: Couldn't read in sign data!
sk: E255: Chyba -- nedájú sa preèíta» oznaèovacie dáta!

source: E72: Close error on swap file
sk: E72: Chyba pri uzatváraní odkladacieho súboru

source: E73: tag stack empty
sk: E73: zoznam tagov je prázdny

source: E74: Command too complex
sk: E74: Príkaz je príli¹ zlo¾itý

source: E75: Name too long
sk: E75: Názov je príli¹ dlhý

source: E76: Too many [
sk: E76: Príli¹ mnoho [

source: E77: Too many file names
sk: E77: Príli¹ mnoho názvov súborov

source: E488: Trailing characters
sk: E488: Nadbytoèné znaky na konci

source: E78: Unknown mark
sk: E78: Neznáma znaèka

source: E79: Cannot expand wildcards
sk: E79: Nemo¾no expandova» ¾olíkové znaky (wildcards)

source: E591: 'winheight' cannot be smaller than 'winminheight'
sk: E591: hodnota voµby 'winheight' (vý¹ka okna) nesmie by» men¹ia ne¾ hodnota voµby 'winminheight' (minimálna vý¹ka okna)

source: E592: 'winwidth' cannot be smaller than 'winminwidth'
sk: E592: hodnota voµby 'winwidth' (¹írka okna) nesmie by» men¹ia ne¾ hodnota volµy 'winminwidth' (minimálna ¹írka okna)

source: E80: Error while writing
sk: E80: Chyba pri ukladaní

source: Zero count
sk: Nulový poèet

source: E81: Using <SID> not in a script context
sk: E81: Pou¾itie <SID> mimo kontext skriptu

source: E449: Invalid expression received
sk: E449: Bol prijatý chybný výraz

source: E463: Region is guarded, cannot modify
sk: E463: Región je uzamknutý, nemo¾no modifikova»

source: E744: NetBeans does not allow changes in read-only files
sk: E744: NetBeans nepovoµuje zmeny v súboroch len na èítanie

source: E685: Internal error: %s
sk: E685: Vnútorná chyba: %s

source: E363: pattern uses more memory than 'maxmempattern'
sk: E363: vzor pou¾íva viac pamäte ako 'maxmempattern'

source: E749: empty buffer
sk: E749: prázdny buffer

source: E682: Invalid search pattern or delimiter
sk: E682: Neprípustný hµadaný re»azec alebo oddeµovaè

source: E139: File is loaded in another buffer
sk: E139: Súbor je naèítaný v inom buffere

source: E764: Option '%s' is not set
sk: E764: Voµba "%s" nie je nastavená

source: search hit TOP, continuing at BOTTOM
sk: hµadanie dosiahlo zaèiatok, pokraèovanie od konca

source: search hit BOTTOM, continuing at TOP
sk: hµadanie dosiahlo koniec, pokraèovanie od zaèiatku
