Repository: neovim/neovim
Catalog: src/po/*.po
Languages: sk

source: E82: Cannot allocate any buffer, exiting...
sk: E82: Nedá sa alokova» buffer, konèím...

source: E83: Cannot allocate buffer, using other one...
sk: E83: Nedá sa alokova» buffer, pou¾ijem iný...

source: E515: No buffers were unloaded
sk: E515: ®iadny buffer nebol uvoµnený

source: E516: No buffers were deleted
sk: E516: ®iadny buffer nebol vymazaný

source: E517: No buffers were wiped out
sk: E517: ®iadny buffer nebol vymazaný

source: 1 buffer unloaded
sk: 1 buffer uvoµnený

source: %d buffers unloaded
sk: %d bufferov uvoµnených

source: 1 buffer deleted
sk: 1 buffer vymazaný

source: %d buffers deleted
sk: %d bufferov vymazaných

source: 1 buffer wiped out
sk: 1 buffer odstránený

source: %d buffers wiped out
sk: %d bufferov odstránených

source: E84: No modified buffer found
sk: E84: Nebol nájdený ¾iadny zmenený buffer

source: E85: There is no listed buffer
sk: E85: Nena¹iel som ¾iadny buffer

source: E86: Buffer %ld does not exist
sk: E86: Buffer %ld neexistuje

source: E87: Cannot go beyond last buffer
sk: E87: Za posledný buffer sa nedá preskoèi»

source: E88: Cannot go before first buffer
sk: E88: Pred prvý buffer sa nedá preskoèi»

source: E89: No write since last change for buffer %ld (add ! to override)
sk: E89: Zmeny v bufferi %ld neboli ulo¾ené (! pre vynútenie)

source: E90: Cannot unload last buffer
sk: E90: Posledný buffer sa nedá odstráni»

source: W14: Warning: List of file names overflow
sk: W14: Varovanie: preteèenie zoznamu s názvami súborov

source: E92: Buffer %ld not found
sk: E92: buffer %ld nenájdený

source: E93: More than one match for %s
sk: E93: Vzoru %s vyhovuje viac bufferov

source: E94: No matching buffer for %s
sk: E94: Vzoru %s nevyhovuje ¾iadny buffer

source: line %ld
sk: riadok %ld

source: E95: Buffer with this name already exists
sk: E95: Buffer takéhoto mena u¾ existuje

source: [Modified]
sk: [Zmenený]

source: [Not edited]
sk: [Neupravovaný]

source: [New file]
sk: [Nový súbor]

source: [Read errors]
sk: [Chyby pri èítaní]

source: [readonly]
sk: [iba pre èítanie]

source: 1 line --%d%%--
sk: 1 riadok --%d%%--

source: %ld lines --%d%%--
sk: %ld riadkov --%d%%--

source: line %ld of %ld --%d%%-- col
sk: riadok %ld z %ld --%d%%-- ståpec

source: [No Name]
sk: [Bez mena]

source: help
sk: pomocník

source: [help]
sk: [pomocník]

source: [Preview]
sk: [Náhµad]

source: All
sk: V¹etko

source: Bot
sk: Koniec

source: Top
sk: Zaèiatok

source: # Buffer list:
sk: # Zoznam bufferov:

source: [Error List]
sk: [Zoznam chýb]

source: --- Signs ---
sk: --- Znaky ---

source: Signs for %s:
sk: Znaky pre %s:

source: line=%ld id=%d name=%s
sk: riadok=%ld id=%d meno=%s

source: E96: Can not diff more than %ld buffers
sk: E96: Nemô¾em porovna» viac ako %ld bufferov

source: E97: Cannot create diffs
sk: E97: Nedajú sa vytvori» porovnania

source: Patch file
sk: Záplatový súbor

source: E98: Cannot read diff output
sk: E98: Nedá sa èíta» výstup porovnania

source: E99: Current buffer is not in diff mode
sk: E99: Aktuálny buffer nie je v porovnávacom móde

source: E100: No other buffer in diff mode
sk: E100: V porovnávacom móde sa nenachádza iný buffer

source: E101: More than two buffers in diff mode, don't know which one to use
sk: E101: Viac ako dva buffery v porovnávacom móde; neviem, ktorý pou¾i»

source: E102: Can't find buffer "%s"
sk: E102: Nedá sa nájs» buffer "%s"

source: E103: Buffer "%s" is not in diff mode
sk: E103: Buffer "%s" nie je v porovnávacom móde

source: E104: Escape not allowed in digraph
sk: E104: digraph nesmie obsahova» znak Escape

source: E544: Keymap file not found
sk: E544: Mapa kláves nenájdená

source: E105: Using :loadkeymap not in a sourced file
sk: E105: Pou¾itý príkaz :loadkeymap v súbore, ktorý nie je interpretovaný

source: Keyword completion (^N^P)
sk: Doplòovanie kµúèových slov (^N^P)

source: ^X mode (^]^D^E^F^I^K^L^N^O^P^S^U^V^Y)
sk: ^X re¾im (^]^D^E^F^I^K^L^N^O^P^S^U^V^Y)

source: Whole line completion (^L^N^P)
sk: Doplòovanie celých riadkov (^L^N^P)

source: File name completion (^F^N^P)
sk: Doplòovanie názvov súborov (^F^N^P)

source: Tag completion (^]^N^P)
sk: Doplòovanie tagov (^]^N^P)

source: Path pattern completion (^N^P)
sk: Doplòovanie vzoru ciest (^N^P)

source: Definition completion (^D^N^P)
sk: Doplòovanie definícií (^D^N^P)

source: Dictionary completion (^K^N^P)
sk: Doplòovanie podµa slovníka (^K^N^P)

source: Thesaurus completion (^T^N^P)
sk: Doplòovanie podµa lexikonu (^T^N^P)

source: Command-line completion (^V^N^P)
sk: Doplòovanie príkazového riadka (^V^N^P)

source: User defined completion (^U^N^P)
sk: Doplòovanie celých riadkov (^U^N^P)

source: Omni completion (^O^N^P)
sk: Doplòovanie tagov (^O^N^P)

source: Spelling suggestion (^S^N^P)
sk: Doplòovanie celých riadkov (^S^N^P)

source: Keyword Local completion (^N^P)
sk: Miestne doplòovanie kµúèových slov (^N^P)

source: Hit end of paragraph
sk: Koniec odstavca

source: 'dictionary' option is empty
sk: voµba 'dictionary' (slovník) je prázdna

source: 'thesaurus' option is empty
sk: voµba 'thesaurus' (lexikon) je prázdna

source: Scanning dictionary: %s
sk: prehµadávam slovník %s

source: (insert) Scroll (^E/^Y)
sk: (insert) Rolovanie (^E/^Y)

source: (replace) Scroll (^E/^Y)
sk: (replace) Rolovanie (^E/^Y)

source: Scanning: %s
sk: Prehµadávam: %s

source: Scanning tags.
sk: Prehµadávam tagy.

source: Adding
sk: Pridávam

source: -- Searching...
sk: -- Hµadám...

source: Back at original
sk: Východzia podoba

source: Word from other line
sk: Slovo z iného riadku

source: The only match
sk: Jediná zhoda

source: match %d of %d
sk: zhoda %d z %d

source: match %d
sk: zhoda %d

source: E18: Unexpected characters in :let
sk: E18: Neoèekávané znaky v :let

source: E684: list index out of range: %ld
sk: E684: index v zozname je mimo rozsah: %ld

source: E121: Undefined variable: %s
sk: E121: Nedefinovaná premenná: %s

source: E111: Missing ']'
sk: E111: Chýba ']'

source: E686: Argument of %s must be a List
sk: E686: Argument %s musí by» Zoznam (List)

source: E712: Argument of %s must be a List or Dictionary
sk: E712: Argument %s musí by» Zoznam (List) alebo Slovník (Dictionary)

source: E713: Cannot use empty key for Dictionary
sk: E713: Nemo¾no pou¾i» prázdny kµúè pre Slovník (Dictionary)

source: E714: List required
sk: E714: vy¾aduje sa Zoznam (List)

source: E715: Dictionary required
sk: E715: Vy¾aduje sa Slovník (Dictionary)

source: E118: Too many arguments for function: %s
sk: E118: Príli¹ mnoho argumentov pre funkciu %s

source: E716: Key not present in Dictionary: %s
sk: E716: kµúè sa v Slovníku (Dictionary) nenachádza: %s

source: E122: Function %s already exists, add ! to replace it
sk: E122: Funkcia %s u¾ existuje. Pou¾ite ! pre jej nahradenie.

source: E717: Dictionary entry already exists
sk: E717: Záznam v Slovníku (Dictionary) u¾ existuje

source: E718: Funcref required
sk: E718: Je vy¾adovaný odkaz na Funkciu (Funcref)

source: E719: Cannot use [:] with a Dictionary
sk: E719: Nemo¾no pou¾it [:] so Slovníkom (Dictionary)

source: E734: Wrong variable type for %s=
sk: E734: Zlý typ premennej pre %s=

source: E130: Unknown function: %s
sk: E130: Neznáma funkcia: %s

source: E461: Illegal variable name: %s
sk: E461: Neprípustné meno premennej: %s

source: E687: Less targets than List items
sk: E687: Menej cieµov ako polo¾iek Poµa (List items)

source: E688: More targets than List items
sk: E688: Viac cieµov ako polo¾iek Poµa (List items)

source: Double ; in list of variables
sk: Dvojitá ; v zozname premenných

source: E738: Can't list variables for %s
sk: E738: Nemo¾no vypísa» premenné pre %s

source: E689: Can only index a List or Dictionary
sk: E689: Indexova» mo¾no iba Zoznam (List) alebo Slovník (Dictionary)

source: E708: [:] must come last
sk: E708: [:] musí prís» ako posledná

source: E709: [:] requires a List value
sk: E709: [:] vy¾aduje hodnotu Poµa (List value)

source: E710: List value has more items than target
sk: E710: Hodnota Poµa (List value) má viac polo¾iek ako cieµ

source: E711: List value has not enough items
sk: E711: Hodnota Poµa (List value) nemá dostatok polo¾iek

source: E690: Missing "in" after :for
sk: E690: Chýba "in" po :for

source: E107: Missing parentheses: %s
sk: E107: Chýbajú zátvorky: %s

source: E108: No such variable: "%s"
sk: E108: Premenná "%s" neexistuje

source: E743: variable nested too deep for (un)lock
sk: E743: premenná je príli¹ vnorená na (od)blokovanie

source: E109: Missing ':' after '?'
sk: E109: Po '?' chýba ':'

source: E691: Can only compare List with List
sk: E691: Porovnáva» mo¾no iba Zoznam so Zoznamom (List with List)

source: E692: Invalid operation for Lists
sk: E692: Neplatná operácia pre Zoznamy (Lists)

source: E735: Can only compare Dictionary with Dictionary
sk: E735: Porovnáva» mo¾no iba Slovník so Slovníkom (Dictionary with Dictionary)

source: E736: Invalid operation for Dictionary
sk: E736: Neplatná operácia pre Slovník

source: E693: Can only compare Funcref with Funcref
sk: E693: Porovnáva» mo¾no iba odkaz na Funkciu s odkazom na Funkciu (Funcref with Funcref)

source: E694: Invalid operation for Funcrefs
sk: E694: Neplatná operácia pre odkazy na Funkcie (Funcrefs)

source: E110: Missing ')'
sk: E110: Chýba ')'

source: E695: Cannot index a Funcref
sk: E695: Nemo¾no indexova» odkaz na Funkciu (Funcref)

source: E112: Option name missing: %s
sk: E112: Chýba meno voµby: %s

source: E113: Unknown option: %s
sk: E113: Neznáma voµba: %s

source: E114: Missing quote: %s
sk: E114: Chýbajú úvodzovky: %s

source: E115: Missing quote: %s
sk: E115: Chýbajú úvodzovky: %s

source: E696: Missing comma in List: %s
sk: E696: Chýba èiarka v Zozname: %s

source: E697: Missing end of List ']': %s
sk: E697: Chýba koniec Zoznamu (List) ']': %s

source: E720: Missing colon in Dictionary: %s
sk: E720: Chýba dvojbodka v Slovníku (Dictionary): %s

source: E721: Duplicate key in Dictionary: "%s"
sk: E721: Duplikovaný kµúè v Slovníku (Dictionary): "%s"

source: E722: Missing comma in Dictionary: %s
sk: E722: Chýba èiarka v Slovníku (Dictionary): %s

source: E723: Missing end of Dictionary '}': %s
sk: E723: Chýba koniec Slovníka (Dictionary) '}': %s

source: E724: variable nested too deep for displaying
sk: E724: premenná je vnorená príli¹ hlboko pre zobrazenie

source: E699: Too many arguments
sk: E699: Príli¹ mnoho argumentov

source: E737: Key already exists: %s
sk: E737: Kµúè u¾ existuje: %s

source: +-%s%3ld lines:
sk: +-%s%3ld riadky:

source: E700: Unknown function: %s
sk: E700: Neznáma funkcia: %s

source: &OK &Cancel
sk: &OK &Zru¹i»

source: called inputrestore() more often than inputsave()
sk: funkcia inputrestore() volaná èastej¹ie ako inputsave()

source: E745: Range not allowed
sk: E745: Rozsah nie je povolený

source: E701: Invalid type for len()
sk: E701: Neplatný typ pre len()

source: E726: Stride is zero
sk: E726: Krok je nulový

source: E727: Start past end
sk: E727: Zaèiatok presahuje koniec

source: <empty>
sk: <prázdny>

source: E240: No connection to Vim server
sk: E240: Neexistuje pripojenie k Vim serveru

source: E241: Unable to send to %s
sk: E241: Nemô¾em posla» na %s

source: E277: Unable to read a server reply
sk: E277: Nemô¾em èíta» odpoveï servra

source: E655: Too many symbolic links (cycle?)
sk: E655: Príli¹ mnoho symbolických odkazov (sluèka?)

source: E258: Unable to send to client
sk: E258: Nemô¾em posla» klientovi

source: E702: Sort compare function failed
sk: E702: Funkcia na utriedenie/porovnanie zlyhala

source: (Invalid)
sk: (Chybný)

source: E677: Error writing temp file
sk: E677: Chyba pri zápise doèasného súboru

source: E703: Using a Funcref as a Number
sk: E703: Pou¾itý odkaz na Funkciu (Funcref) ako èíslo

source: E745: Using a List as a Number
sk: E745: Zoznam (List) pou¾itý ako èíslo

source: E728: Using a Dictionary as a Number
sk: E728: Slovník (Dictionary) pou¾itý ako èíslo

source: E729: using Funcref as a String
sk: E729: Odkaz na Funkciu (Funcref) pou¾itý ako Re»azec (String)

source: E730: using List as a String
sk: E730: Zoznam (List) pou¾itý ako Re»azec (String)

source: E731: using Dictionary as a String
sk: E731: Slovník (Dictionary) pou¾itý ako Re»azec (String)

source: E704: Funcref variable name must start with a capital: %s
sk: E704: Premenná typu odkaz na Funkciu (Funcref) musí zaèína» s veµkým písmenom: %s

source: E705: Variable name conflicts with existing function: %s
sk: E705: Meno premennej je v konflikte s existujúcou funkciou: %s

source: E706: Variable type mismatch for: %s
sk: E706: Typ premennej sa nezhoduje: %s

source: E741: Value is locked: %s
sk: E741: Hodnota je uzamknutá: %s

source: Unknown
sk: Neznámy

source: E742: Cannot change value of %s
sk: E742: Nemo¾no zmeni» hodnotu %s

source: E698: variable nested too deep for making a copy
sk: E698: premenná je vnorená príli¹ hlboko pre skopírovanie

source: E124: Missing '(': %s
sk: E124: Chýba '(': %s

source: E125: Illegal argument: %s
sk: E125: Neprípustný argument: %s

source: E126: Missing :endfunction
sk: E126: Chýba :endfunction

source: E746: Function name does not match script file name: %s
sk: E746: Meno funkcie sa nezhoduje s menom interpretovaného súboru: %s

source: E129: Function name required
sk: E129: Je vy¾adované meno funkcie

source: E128: Function name must start with a capital or contain a colon: %s
sk: E128: Názov funkcie musí zaèína» veµkým písmenom alebo obsahova» dvojbodku: %s

source: E131: Cannot delete function %s: It is in use
sk: E131: Nedá sa vymaza» funkcia %s: je pou¾ívaná

source: E132: Function call depth is higher than 'maxfuncdepth'
sk: E132: Zanorenie funkcií je hlb¹ie ne¾ 'maxfuncdepth'

source: calling %s
sk: volám %s

source: %s aborted
sk: %s zru¹ený

source: %s returning #%ld
sk: %s vrátilo #%ld

source: %s returning %s
sk: %s vrátilo %s

source: continuing in %s
sk: pokraèujem v %s

source: E133: :return not inside a function
sk: E133: :return mimo funkciu

source: # global variables:
sk: # globálne premenné:

source: Last set from
sk: Posledné nastavenie z

source: <%s>%s%s %d, Hex %02x, Octal %03o
sk: <%s>%s%s %d, ¹estnástkovo %02x, osmièkovo %03o

source: > %d, Hex %04x, Octal %o
sk: > %d, ¹estnástkovo %04x, osmièkovo %o

source: > %d, Hex %08x, Octal %o
sk: > %d, ¹estnástkovo %08x, osmièkovo %o

source: E134: Move lines into themselves
sk: E134: Prekrytie riadkov sebou samými

source: 1 line moved
sk: 1 riadok presunutý

source: %ld lines moved
sk: %ld riadkov presunutých

source: %ld lines filtered
sk: %ld riadkov filtrovaných

source: E135: *Filter* Autocommands must not change current buffer
sk: E135: Automatické príkazy *Filter* nesmú meni» aktuálny buffer

source: [No write since last change]
sk: [Neulo¾ené zmeny]

source: %sviminfo: %s in line:
sk: %sviminfo: %s na riadku:

source: E136: viminfo: Too many errors, skipping rest of file
sk: E136: viminfo: príli¹ mnoho chýb, preskakujem zbytok súboru

source: Reading viminfo file "%s"%s%s%s
sk: Èítam viminfo súbor "%s"%s%s%s

source: info
sk: informácie

source: marks
sk: znaèky

source: FAILED
sk: ZLYHALO

source: E137: Viminfo file is not writable: %s
sk: E137: Do viminfo súboru %s sa nedá zapisova»

source: E138: Can't write viminfo file %s!
sk: E138: Nedá sa ulo¾i» viminfo súbor %s!

source: Writing viminfo file "%s"
sk: Ukládám viminfo súboru "%s"

source: # This viminfo file was generated by Vim %s.
sk: # Tento viminfo súbor bol vytvorený editorom Vim %s.

source: # You may edit it if you're careful!
sk: # Pokiaµ budete opatrný, mô¾ete ho upravova».

source: # Value of 'encoding' when this file was written
sk: # Hodnota 'encoding' (kódovania) poèas zápisu tohoto súboru

source: Illegal starting char
sk: Neprípustný zaèiatoèný znak

source: Save As
sk: Ulo¾i» ako

source: Write partial file?
sk: Ulo¾i» neúplný súbor?

source: E140: Use ! to write partial buffer
sk: E140: Pou¾ite ! pre ulo¾enie neúplného bufferu

source: Overwrite existing file "%s"?
sk: Prepísa» existujúci súbor "%s"?

source: Swap file "%s" exists, overwrite anyway?
sk: Odkladací súbor "%s" existuje, aj tak prepísa»?

source: E768: Swap file exists: %s (:silent! overrides)
sk: E768: Odkladací súbor existuje: %s (pou¾ite :silent! pre prepísanie)

source: E141: No file name for buffer %ld
sk: E141: ®iadny názov súboru pre buffer %ld

source: E142: File not written: Writing is disabled by 'write' option
sk: E142: Súbor nebol ulo¾ený: ukladanie je zakázané voµbou 'write'

source: 'readonly' option is set for "%s". Do you wish to write anyway?
sk: Pre "%s" je nastavená voµba 'readonly' (iba na èítanie). Prajete si aj tak ulo¾i»?

source: Edit File
sk: Upravova» súbor

source: E143: Autocommands unexpectedly deleted new buffer %s
sk: E143: Automatické príkazy neoèakávane zmazali nový buffer %s

source: E144: non-numeric argument to :z
sk: E144: neèíselný argument pre :z

source: E145: Shell commands not allowed in rvim
sk: E145: rvim nepovoµuje pou¾itie príkazov shellu

source: E146: Regular expressions can't be delimited by letters
sk: E146: Regulárne výrazy nesmú by» oddelené písmenami

source: replace with %s (y/n/a/q/l/^E/^Y)?
sk: nahradi» %s (y/n/a/q/l/^E/^Y)?

source: (Interrupted)
sk: (preru¹ený)

source: 1 match
sk: 1 zhoda

source: 1 substitution
sk: 1 nahradenie

source: %ld matches
sk: %ld zhôd

source: %ld substitutions
sk: %ld nahradení

source: on 1 line
sk: na 1 riadku

source: on %ld lines
sk: na %ld riadkov

source: E147: Cannot do :global recursive
sk: E147: :global sa nedá vola» rekurzívne

source: E148: Regular expression missing from global
sk: E148: Pri príkaze global chýba regulárny výraz

source: Pattern found in every line: %s
sk: Vzor nájdený na ka¾dom riadku: %s

source: # Last Substitute String: $
sk: # Posledný zamieòaný re»azec: $

source: E478: Don't panic!
sk: E478: ®iadnu paniku!

source: E661: Sorry, no '%s' help for %s
sk: E661: ¥utujem, ¾iadny '%s' pomocník pre %s

source: E149: Sorry, no help for %s
sk: E149: ¥utujem, pre %s nie je ¾iadny pomocník

source: Sorry, help file "%s" not found
sk: ¥utujem, súbor "%s" s pomocníkom nebol nájdený

source: E150: Not a directory: %s
sk: E150: %s nie je adresárom

source: E152: Cannot open %s for writing
sk: E152: %s sa nedá sa otvori» pre zápis

source: E153: Unable to open %s for reading
sk: E153: %s as nedá otvori» pre èítanie

source: E670: Mix of help file encodings within a language: %s
sk: E670: Rôzne kódovania pre súbory s pomocníkom pre jazyk: %s

source: E154: Duplicate tag "%s" in file %s/%s
sk: E154: Duplicitný tag "%s" v súbore %s/%s

source: E160: Unknown sign command: %s
sk: E160: Neznámu príkaz pre znaèky: %s

source: E156: Missing sign name
sk: E156: Chýba meno pre znaèku

source: E612: Too many signs defined
sk: E612: Príli¹ mnoho definovaných znaèiek

source: E239: Invalid sign text: %s
sk: E239: Chybný text znaèky: %s

source: E155: Unknown sign: %s
sk: E155: Neznáma znaèka: %s

source: E159: Missing sign number
sk: E159: Chýba èislo znaèky

source: E158: Invalid buffer name: %s
sk: E158: Chybné meno bufferu: %s

source: E157: Invalid sign ID: %ld
sk: E157: Chybné ID znaèky: %ld

source: (NOT FOUND)
sk: (NENÁJDENÉ)

source: (not supported)
sk: (nepodporované)

source: [Deleted]
sk: [vymazaný]

source: Entering Debug mode. Type "cont" to continue.
sk: Spú¹»am re¾im ladenia. Pre ukonèenie napí¹te "cont".

source: line %ld: %s
sk: riadok %ld: %s

source: cmd: %s
sk: príkaz: %s

source: Breakpoint in "%s%s" line %ld
sk: Bod preru¹enia v "%s%s" na riadku %ld

source: E161: Breakpoint not found: %s
sk: E161: Bod preru¹enia nenájdený: %s

source: No breakpoints defined
sk: Neboli definovné ¾iadne body preru¹enia

source: %3d %s %s line %ld
sk: %3d %s %s riadok %ld

source: E750: First use :profile start <fname>
sk: E750: Najprv pou¾ite príkaz :profile start <meno_suboru>

source: Save changes to "%s"?
sk: Ulo¾i» zmeny do "%s"?

source: Untitled
sk: Bez mena

source: E162: No write since last change for buffer "%s"
sk: E162: Buffer "%s" obsahuje neulo¾ené zmeny

source: Warning: Entered other buffer unexpectedly (check autocommands)
sk: Varovanie: Neèakaný vstup do iného bufferu (skontrolujte automatické príkazy)

source: E163: There is only one file to edit
sk: E163: Pre úpravu bol zadaný iba jeden súbor

source: E164: Cannot go before first file
sk: E164: Nedá sa preskoèi» pred prvý súbor

source: E165: Cannot go beyond last file
sk: E165: Nedá sa preskoèi» za posledný súbor

source: E666: compiler not supported: %s
sk: E666: prekladaè nie je podporovaný: %s

source: Searching for "%s" in "%s"
sk: Hµadám "%s" v "%s"

source: Searching for "%s"
sk: Hµadám "%s"

source: not found in 'runtimepath': "%s"
sk: súbor "%s" nebol nájdený v 'runtimepath'

source: Source Vim script
sk: Zdrojový skript Vim

source: Cannot source a directory: "%s"
sk: Nemo¾no interpretova» adresár: "%s"

source: could not source "%s"
sk: nedá sa interpretova» "%s"

source: line %ld: could not source "%s"
sk: riadok %ld: nemô¾no interpretova» "%s"

source: sourcing "%s"
sk: interpretujem "%s"

source: line %ld: sourcing "%s"
sk: riadok %ld: interpretujem "%s"

source: finished sourcing %s
sk: dokonèená interpretácia %s

source: W15: Warning: Wrong line separator, ^M may be missing
sk: W15: Varovanie: chybný oddeµovaè riadkov. Mo¾no chýba ^M

source: E167: :scriptencoding used outside of a sourced file
sk: E167: príkaz :scriptencoding pou¾itý mimo interpretovaný súbor

source: E168: :finish used outside of a sourced file
sk: E168: príkaz :finish pou¾itý mimo interpretovaný súbor

source: Current %slanguage: "%s"
sk: Aktuálny %sjazyk: "%s"

source: E197: Cannot set language to "%s"
sk: E197: Nedá sa nastavi» jazyk na "%s"

source: Entering Ex mode. Type "visual" to go to Normal mode.
sk: Spú¹»am Ex re¾im. Napí¹te "visual" pre návrat do Normálneho re¾imu.

source: E501: At end-of-file
sk: E501: Koniec súboru

source: E169: Command too recursive
sk: E169: Príkaz je príli¹ rekurzívny

source: E605: Exception not caught: %s
sk: E605: Výnimka nezachytená: %s

source: End of sourced file
sk: Koniec interpretovaného súboru

source: End of function
sk: Koniec funkcie

source: E464: Ambiguous use of user-defined command
sk: E464: Nejednoznaèné pou¾itie pou¾ívateµom definovaného príkazu

source: E492: Not an editor command
sk: E492: Nie je príkazom editoru

source: E493: Backwards range given
sk: E493: Zadaný spätný rozsah

source: Backwards range given, OK to swap
sk: Zadaný spätný rozsah. OK pre zámenu

source: E494: Use w or w>>
sk: E494: Pou¾ite w alebo w>>

source: E319: Sorry, the command is not available in this version
sk: E319: ¥utujem, ale tento príkaz nie je dostupný v tejto verzii

source: E172: Only one file name allowed
sk: E172: Prípustný je iba jeden názov súboru

source: 1 more file to edit. Quit anyway?
sk: E¹te zostáva 1 súbor k úprave. Chcete napriek tomu ukonèi» editor?

source: %d more files to edit. Quit anyway?
sk: E¹te zostáva %d súborov k úprave. Chcete napriek tomu ukonèi» editor?

source: E173: 1 more file to edit
sk: E173: E¹te zostáva 1 súbor k úprave.

source: E173: %ld more files to edit
sk: E173: E¹te zostáva %ld súborov k úprave.

source: E174: Command already exists: add ! to replace it
sk: E174: Príkaz u¾ existuje: pou¾ite ! pre predefinovanie

source: Name Args Range Complete Definition
sk: Meno Args Rozsah Úplnos» Definícia

source: No user-defined commands found
sk: Neboli nájdené ¾iadne pou¾ivateµom definované príkazy

source: E175: No attribute specified
sk: E175: Neboli zadané ¾iadne vlastnosti

source: E176: Invalid number of arguments
sk: E176: Chybný poèet argumentov

source: E177: Count cannot be specified twice
sk: E177: Poèet nemô¾e by» zadaný dvakrát

source: E178: Invalid default value for count
sk: E178: Chybná implicitná hodnota pre poèet

source: E179: argument required for -complete
sk: E179: pre doplnenie (-complete) je potrebný argument

source: E181: Invalid attribute: %s
sk: E181: Chybná vlastnos»: %s

source: E182: Invalid command name
sk: E182: Chybné meno príkazu
