Repository: neovim/neovim
Catalog: src/po/*.po
Languages: sk

source: ???LINE COUNT WRONG
sk: ???CHYBNÝ POÈET RIADKOV

source: ???EMPTY BLOCK
sk: ???PRÁZDNY BLOK

source: ???LINES MISSING
sk: ???CHÝBAJÚCE RIADKY

source: E310: Block 1 ID wrong (%s not a .swp file?)
sk: E310: ID bloku 1 je chybné (je %s odkladacím súborom?)

source: ???BLOCK MISSING
sk: ???CHÝBA BLOK

source: ??? from here until ???END lines may be messed up
sk: od ??? po ???END mô¾u by» riadky pomie¹ané

source: ??? from here until ???END lines may have been inserted/deleted
sk: od ??? po ???END mô¾u by» riadky vlo¾ené/vymazané

source: ???END
sk: ???KONIEC

source: E311: Recovery Interrupted
sk: E311: Obnova preru¹ená

source: E312: Errors detected while recovering; look for lines starting with ???
sk: E312: V priebehu obnovy do¹lo k chybám; skontrolujte riadky zaèínajúce na ???

source: See ":help E312" for more information.
sk: Pozrite ":help E312" pre ïal¹ie informácie

source: Recovery completed. You should check if everything is OK.
sk: Obnova dokonèená. Skontrolujte, èi je v¹etko v poriadku.

source: (You might want to write out this file under another name
sk: (Zvá¾te ulo¾enie tohoto súboru pod iným menom

source: and run diff with the original file to check for changes)
sk: a pomocou programu diff zistite zmeny oproti pôvodnému súboru)

source: Delete the .swp file afterwards.
sk: Potom vyma¾te odkladací súbor s príponou .swp.

source: Swap files found:
sk: Nájdené odkladacie súbory:

source: In current directory:
sk: V aktuálnom adresári:

source: Using specified name:
sk: So zadaným menom:

source: In directory
sk: V adresári

source: -- none --
sk: -- ¾iadne --

source: owned by:
sk: vlastník:

source: dated:
sk: dátum vytvorenia:

source: dated:
sk: dátum vytvorenia:

source: [from Vim version 3.0]
sk: [od Vim verzie 3.0]

source: [does not look like a Vim swap file]
sk: [nevyzerá ako odkladací súbor Vim]

source: file name:
sk: názov súboru:

source: modified:
sk: zmenený:

source: YES
sk: ÁNO

source: no
sk: nie

source: user name:
sk: u¾ívateµské meno:

source: host name:
sk: názov poèítaèa:

source: host name:
sk: názov poèítaèa:

source: process ID:
sk: ID procesu :

source: (still running)
sk: (stále be¾í)

source: [not usable with this version of Vim]
sk: [nepou¾iteµné s touto verziou Vim]

source: [not usable on this computer]
sk: [nepou¾itelné na tomto poèítaèi]

source: [cannot be read]
sk: [nedá sa preèíta»]

source: [cannot be opened]
sk: [nedá sa otvori»]

source: E313: Cannot preserve, there is no swap file
sk: E313: Nedá sa zachova» - odkladací súbor neexistuje

source: File preserved
sk: Súbor zachovaný

source: E314: Preserve failed
sk: E314: Uchovanie sa nepodarilo

source: E315: ml_get: invalid lnum: %ld
sk: E315: ml_get: chybné èíslo riadku: %ld

source: E316: ml_get: cannot find line %ld
sk: E316: ml_get: nedá sa nájs» riadok %ld

source: E317: pointer block id wrong 3
sk: E317: chybné èíslo ukazovateµa na blok 3

source: stack_idx should be 0
sk: stack_idx by mal ma» hodnotu 3

source: E318: Updated too many blocks?
sk: E318: Aktualizovaných príli¹ veµa blokov?

source: E317: pointer block id wrong 4
sk: E317: chybné èíslo ukazovateµa na blok 4

source: deleted block 1?
sk: vymazaný blok 1?

source: E320: Cannot find line %ld
sk: E320: Nedá sa nájs» riadok %ld

source: E317: pointer block id wrong
sk: E317: chybné èíslo ukazovateµa na blok

source: pe_line_count is zero
sk: pe_line_count má nulovú hodnotu

source: E322: line number out of range: %ld past the end
sk: E322: èíslo riadku je mimo rozsah: %ld (za koncom)

source: E323: line count wrong in block %ld
sk: E323: chybný poèet riadkov v bloku %ld

source: Stack size increases
sk: Nárast veµkosti zásobníku

source: E317: pointer block id wrong 2
sk: E317: chybný èíslo ukazovateµa na blok 2

source: E325: ATTENTION
sk: E325: POZOR

source: Found a swap file by the name "
sk: Nájdený odkladací súbor s menom "

source: While opening file "
sk: Pri otváraní súboru "

source: NEWER than swap file!
sk: NOV©Í ako odkladací súbor!

source: (1) Another program may be editing the same file. If this is the case, be careful not to end up with two different instances of the same file when making changes.
sk: (1) Súbor mô¾e by» upravovaný iným programom. Ak je tomu tak, potom si dajte pozor, aby ste po ulo¾ení zmien nemali dve rôzne verzie toho istého súboru.

source: Quit, or continue with caution.
sk: Ukonèite program, alebo opatrne pokraèujte v úpravách.

source: (2) An edit session for this file crashed.
sk: (2) Úprava tohoto súboru bola preru¹ená neoèakávaným ukonèením programu.

source: If this is the case, use ":recover" or "vim -r
sk: Ak je tomu tak, potom pou¾ite ":recover" alebo "vim -r

source: " to recover the changes (see ":help recovery").
sk: " pre obnovenie zmien (viï ":help recovery)".

source: If you did this already, delete the swap file "
sk: Pokiaµ ste tak u¾ urobili, tak vyma¾te odkladací súbor "

source: " to avoid this message.
sk: " a táto správa sa u¾ nebude objavova».

source: Swap file "
sk: Odkladací súbor "

source: " already exists!
sk: " u¾ existuje!

source: VIM - ATTENTION
sk: VIM - POZOR

source: Swap file already exists!
sk: Odkladací súbor u¾ existuje!

source: &Open Read-Only &Edit anyway &Recover &Quit &Abort
sk: &Otvori» iba pre èítanie &Pokraèova» v úpravách O&bnovi» súbor &Koniec &Zru¹i»

source: &Open Read-Only &Edit anyway &Recover &Quit &Abort &Delete it
sk: &Otvori» iba pre èítanie &Pokraèovat v úpravách O&bnovi» súbor &Koniec &Zru¹i» Z&maza»

source: E326: Too many swap files found
sk: E326: Príli¹ mnoho odkladacích súborov

source: E327: Part of menu-item path is not sub-menu
sk: E327: Èas» cesty k predmetu ponuky nie je podponukou

source: E328: Menu only exists in another mode
sk: E328: Ponuka existuje iba v inom móde

source: E329: No menu "%s"
sk: E329: Ponuka "%s" neexistuje

source: E330: Menu path must not lead to a sub-menu
sk: E330: Cesta ponuky nesmie vies» do podponuky

source: E331: Must not add menu items directly to menu bar
sk: E331: Polo¾ky ponuky sa nejdú pridáva» priamo na li¹tu

source: E332: Separator cannot be part of a menu path
sk: E332: Oddeµovaè nesmie by» èas»ou cesty ponuky

source: --- Menus ---
sk: --- Ponuky ---

source: Tear off this menu
sk: Odtrhnú» tuto ponuku

source: E333: Menu path must lead to a menu item
sk: E333: Cesta ponuky musí vies» k polo¾ke ponuky

source: E334: Menu not found: %s
sk: E334: Ponuka nenájdená: %s

source: E335: Menu not defined for %s mode
sk: E335: V %s móde nie je ponuka definovaná

source: E336: Menu path must lead to a sub-menu
sk: E336: Cesta ponuky musí vies» do podponuky

source: E337: Menu not found - check menu names
sk: E337: Ponuka nenájdená - skontrolujte názvy ponúk

source: Error detected while processing %s:
sk: Chyba pri spracovaní %s:

source: line %4ld:
sk: riadok %4ld:

source: E354: Invalid register name: '%s'
sk: E354: '%s' nie je prístupné meno registru

source: Messages maintainer: Bram Moolenaar <Bram@vim.org>
sk: Správca prekladu: Lubomir Host <rajo@platon.sk>

source: Interrupt:
sk: Preru¹enie:

source: Press ENTER or type command to continue
sk: Stlaète ENTER alebo zadajte príkaz pre pokraèovanie

source: -- More --
sk: -- Pokraèovanie --

source: SPACE/d/j: screen/page/line down, b/u/k: up, q: quit
sk: MEDZERA/d/j: obrazovka/stránka/riadok dole, b/u/k: hore, q: koniec

source: Question
sk: Otázka

source: &Yes &No
sk: &Ano &Nie

source: &Yes &No Save &All &Discard All &Cancel
sk: &Ano &Nie &Ulo¾i» v¹etko Zahodi» &v¹etko &Zru¹i»

source: Select Directory dialog
sk: Dialóg pre vytvorenie adresára

source: Save File dialog
sk: Dialóg pre ukladanie súborov

source: Open File dialog
sk: Dialóg pre otváranie súborov

source: E338: Sorry, no file browser in console mode
sk: E338: ¥utujem, ale konzolová verzia nepodporuje prehliadaè súborov

source: E766: Insufficient arguments for printf()
sk: E766: Chybné argumenty pre funkciu printf()

source: E767: Too many arguments to printf()
sk: E767: Príli¹ mnoho argumentov pre funkciu printf()

source: W10: Warning: Changing a readonly file
sk: W10: Varovanie: mením súbor iba pre èítanie

source: Type number or click with mouse (<Enter> cancels):
sk: Zadajte èíslo ale kliknite my¹ou (<Enter> zru¹í):

source: Choice number (<Enter> cancels):
sk: Zvoµte èíslo (<Enter> zru¹í):

source: 1 more line
sk: 1 nový riadok

source: 1 line less
sk: 1 vymazaný riadok

source: %ld more lines
sk: %ld nových riadkov

source: %ld fewer lines
sk: %ld vymazaných riadkov

source: (Interrupted)
sk: (Preru¹ené)

source: Beep!
sk: Piip!

source: Vim: preserving files...
sk: Vim: zachovávam súbory...

source: Vim: Finished.
sk: Vim: ukonèený

source: ERROR:
sk: CHYBA:

source: [bytes] total alloc-freed %lu-%lu, in use %lu, peak use %lu
sk: [bajtov] celkom uvolnené-alokované %lu-%lu, vyu¾ité %lu, maximálne vyu¾itie %lu

source: [calls] total re/malloc()'s %lu, total free()'s %lu
sk: [volanie] celkom re/malloc(): %lu, celkom free() %lu

source: E340: Line is becoming too long
sk: E340: Riadok sa stáva príli¹ dlhým

source: E341: Internal error: lalloc(%ld, )
sk: E341: Vnútorná chyba: lalloc(%ld, )

source: E342: Out of memory! (allocating %lu bytes)
sk: E342: Nedostatok pamäte! (alokujem %lu bajtov)

source: Calling shell to execute: "%s"
sk: Volám shell na spustenie: "%s"

source: E545: Missing colon
sk: E545: Chýba dvojbodka

source: E546: Illegal mode
sk: E546: Neprípustný mód

source: E547: Illegal mouseshape
sk: E547: Chybný tvar my¹i

source: E548: digit expected
sk: E548: oèakávaná èíslica

source: E549: Illegal percentage
sk: E549: Neprípustné percento

source: Enter encryption key:
sk: Zadajte ¹ifrovací kµúè:

source: Enter same key again:
sk: Vlo¾te ten istý kµúè znova:

source: Keys don't match!
sk: Kµúèe sa nezhodujú!

source: E343: Invalid path: '**[number]' must be at the end of the path or be followed by '%s'.
sk: E343: Chybná cesta: '**[èíslo] musí by» buï na konci cesty, alebo musí by» nasledované '%s. Viï :help path.

source: E344: Can't find directory "%s" in cdpath
sk: E344: Adresár "%s" sa nedá nájs» v cdpath

source: E345: Can't find file "%s" in path
sk: E345: Súbor "%s" sa nepodarilo nájs»

source: E346: No more directory "%s" found in cdpath
sk: E346: ®iadny ïal¹í adresár "%s" nebol v cdpath nájdený

source: E347: No more file "%s" found in path
sk: E347: ®iadny ïal¹í súbor "%s" nebol v ceste nájdený

source: Cannot connect to Netbeans #2
sk: Nedá sa pripoji» na Netbeans #2

source: Cannot connect to Netbeans
sk: Nedá sa pripoji» na Netbeans

source: E668: Wrong access mode for NetBeans connection info file: "%s"
sk: E668: Zlé prístupové práva pre súbor s informáciami pre NetBeans spojenie: "%s"

source: read from Netbeans socket
sk: èítanie z Netbeans soketu

source: E658: NetBeans connection lost for buffer %ld
sk: E658: Stratené NetBeans spojenie pre buffer %ld

source: Warning: terminal cannot highlight
sk: Varovanie: terminál nepodporuje zvýrazòovanie

source: E348: No string under cursor
sk: E348: Pod kurzorom nie je ¾iadny re»azec

source: E349: No identifier under cursor
sk: E349: Pod kurzorom nie je ¾iadny identifikátor

source: E352: Cannot erase folds with current 'foldmethod'
sk: E352: Pomocou 'foldmethod' sa nedá vymaza» vnorenie

source: E664: changelist is empty
sk: E664: zoznam zmien je prázdny

source: E662: At start of changelist
sk: E662: Na zaèiatku zoznamu zmien

source: E663: At end of changelist
sk: E663: Na konci zoznamu zmien

source: Type :quit<Enter> to exit Vim
sk: Zadajte :quit<Enter> pre ukonèenie programu Vim

source: 1 line %sed 1 time
sk: poèet riadkov upravených naraz pomocou %s: 1

source: 1 line %sed %d times
sk: 1 riadok upravený pomocou %s %d krát

source: %ld lines %sed 1 time
sk: %ld riadkov upravených naraz pomocou %s

source: %ld lines %sed %d times
sk: %ld riadkov upravených pomocou %s %d krát

source: %ld lines to indent...
sk: %ld riadkov pre odsadenie...

source: 1 line indented
sk: 1 riadok odsadený

source: %ld lines indented
sk: %ld riadkov odsadených

source: E748: No previously used register
sk: E748: ®iadny predtým pou¾ívaný register

source: cannot yank; delete anyway
sk: nedá sa kopírova»; napriek tomu vymazané

source: 1 line changed
sk: 1 riadok zmenený

source: %ld lines changed
sk: %ld zmenených riadkov

source: freeing %ld lines
sk: uvolòujem %ld riadkov

source: block of 1 line yanked
sk: skopírovaný blok 1 riadku

source: 1 line yanked
sk: 1 riadok skopírovaný

source: block of %ld lines yanked
sk: skopírovaný blok %ld riadkov

source: %ld lines yanked
sk: %ld skopírovaných riadkov

source: E353: Nothing in register %s
sk: E353: Register %s je prázdny

source: --- Registers ---
sk: --- Registre ---

source: Illegal register name
sk: Neprípustný názov registra

source: # Registers:
sk: # Registre:

source: E574: Unknown register type %d
sk: E574: Neznámy typ registra %d

source: %ld Cols;
sk: %ld Ståpcov;

source: Selected %s%ld of %ld Lines; %ld of %ld Words; %ld of %ld Bytes
sk: Vybraných %s%ld z %ld Riadkov; %ld zo %ld Slov; %ld z %ld Bajtov

source: Selected %s%ld of %ld Lines; %ld of %ld Words; %ld of %ld Chars; %ld of %ld Bytes
sk: Vybraných %s%ld z %ld Riadkov; %ld zo %ld Slov; %ld z %ld Znakov; %ld z %ld Bajtov

source: Col %s of %s; Line %ld of %ld; Word %ld of %ld; Byte %ld of %ld
sk: Ståpec %s z %s; Riadok %ld z %ld; Slovo %ld z %ld; Bajt %ld z %ld

source: Col %s of %s; Line %ld of %ld; Word %ld of %ld; Char %ld of %ld; Byte %ld of %ld
sk: Ståpec %s z %s; Riadok %ld z %ld; Slovo %ld z %ld; Znak %ld z %ld; Bajt %ld z %ld

source: (+%ld for BOM)
sk: (+%ld pre BOM)

source: %<%f%h%m%=Page %N
sk: %<%f%h%m%=Strana %N

source: Thanks for flying Vim
sk: Ïakujeme za pou¾itie Vim

source: E518: Unknown option
sk: E518: Neznáma voµba

source: E519: Option not supported
sk: E519: Voµba nie je podporovaná

source: E520: Not allowed in a modeline
sk: E520: Nie je v modeline povolené

source: E521: Number required after =
sk: E521: Po = je vy¾adované èíslo

source: E522: Not found in termcap
sk: E522: Nenájdený v termcape

source: E539: Illegal character <%s>
sk: E539: Neprípustný znak <%s>

source: E529: Cannot set 'term' to empty string
sk: E529: Voµba 'term' nemô¾e by» prázdna

source: E530: Cannot change term in GUI
sk: E530: V grafickom móde (GUI) sa nedá meni» typ terminálu

source: E531: Use ":gui" to start the GUI
sk: E531: Pou¾ite "gui" pre spustenie GUI

source: E589: 'backupext' and 'patchmode' are equal
sk: E589: voµby 'backupext' a 'patchmode' majú rovnakú hodnotu

source: E617: Cannot be changed in the GTK+ 2 GUI
sk: E617: Nedá sa zmeni» v grafickom rozhraní GTK+ 2

source: E524: Missing colon
sk: E524: Chýba dvojbodka

source: E525: Zero length string
sk: E525: Re»azec s nulovou då¾kou

source: E526: Missing number after <%s>
sk: E526: Po <%s> chýba èíslo

source: E527: Missing comma
sk: E527: Chýba èiarka

source: E528: Must specify a ' value
sk: E528: Je nutné zada» hodnotu '

source: E595: contains unprintable or wide character
sk: E595: obsahuje netlaèiteµné znaky

source: E596: Invalid font(s)
sk: E596: Chybné písma

source: E597: can't select fontset
sk: E597: nedá sa vybra» sada písiem

source: E598: Invalid fontset
sk: E598: Chybná sada písiem

source: E533: can't select wide font
sk: E533: nedá sa vybra» ¹iroký font

source: E534: Invalid wide font
sk: E534: Chybné ¹iroké písmo

source: E535: Illegal character after <%c>
sk: E535: Neprípustný znak po <%c>

source: E536: comma required
sk: E536: je nutná èiarka

source: E537: 'commentstring' must be empty or contain %s
sk: E537: 'commentstring' (komentár) musí by» prázdny alebo musí obsahova» %s

source: E538: No mouse support
sk: E538: Bez podpory my¹i

source: E540: Unclosed expression sequence
sk: E540: Neuzatvorené zoskupenie výrazov

source: E541: too many items
sk: E541: príli¹ mnoho polo¾iek

source: E542: unbalanced groups
sk: E542: nevyvá¾ené skupiny

source: E590: A preview window already exists
sk: E590: Okno náhµadu u¾ existuje

source: W17: Arabic requires UTF-8, do ':set encoding=utf-8'
sk: W17: Mód Arabic vy¾aduje kódovanie UTF-8, nastavte to príkazom ':set encoding=utf-8'

source: E593: Need at least %d lines
sk: E593: Minimálny potrebný poèet riadkov je %d

source: E594: Need at least %d columns
sk: E594: Minimálne potrebný poèet ståpcov je %d

source: E355: Unknown option: %s
sk: E355: Neznáma voµba: %s

source: --- Terminal codes ---
sk: --- Kódy terminálu ---

source: --- Global option values ---
sk: --- Nastavenie globálnych volieb ---

source: --- Local option values ---
sk: --- Nastavenie lokálnych volieb ---

source: --- Options ---
sk: --- Mo¾nosti ---

source: E356: get_varp ERROR
sk: E356: get_varp CHYBA

source: E357: 'langmap': Matching character missing for %s
sk: E357: 'langmap': pre %s chýba vyhovujúci znak

source: E358: 'langmap': Extra characters after semicolon: %s
sk: E358: 'langmap': nadbytoèné znaky po bodkoèiarke: %s

source: cannot open
sk: nedá sa otvori»

source: VIM: Can't open window!
sk: VIM: Nedá sa otvori» okno!

source: Need Amigados version 2.04 or later
sk: Je potrebná Amigados verzia 2.04 alebo nov¹ia

source: Need %s version %ld
sk: Potrebná %s verzia %ld

source: Cannot open NIL:
sk: Nedá sa otvori» NIL:

source: Cannot create
sk: Nedá sa vytvori»

source: Vim exiting with %d
sk: Vim ukonèený s %d

source: cannot change console mode ?!
sk: nemô¾em zmeni» konzolový mód ?!

source: mch_get_shellsize: not a console??
sk: mch_get_shellsize: nie je konzolou??

source: E360: Cannot execute shell with -f option
sk: E360: Nedá sa spusti» shell s -f voµbou

source: Cannot execute
sk: Nedá sa spusti»

source: returned
sk: vrátené

source: ANCHOR_BUF_SIZE too small.
sk: ANCHOR_BUF_SIZE príli¹ malá.

source: I/O ERROR
sk: I/O CHYBA

source: ...(truncated)
sk: ...(skrátené)

source: 'columns' is not 80, cannot execute external commands
sk: 'ståpce' nie je 80, nemô¾em spusti» externý príkaz

source: E237: Printer selection failed
sk: E237: Zlyhal výber tlaèiarne

source: to %s on %s
sk: %s na %s

source: E613: Unknown printer font: %s
sk: E613: Neznámy font tlaèiarne: %s

source: E238: Print error: %s
sk: E238: Chyba tlaèe: %s

source: Printing '%s'
sk: Tlaèím '%s'

source: E244: Illegal charset name "%s" in font name "%s"
sk: E244: Chybný názov znakovej sady "%s" v názve písma "%s"

source: E245: Illegal char '%c' in font name "%s"
sk: E245: Chybný znak '%c' v názve písma "%s"

source: Vim: Double signal, exiting
sk: Vim: dvojitý signál, konèím

source: Vim: Caught deadly signal %s
sk: Vim: Zachytený smrtiaci signál %s

source: Vim: Caught deadly signal
sk: Vim: Zachytený smrtiaci signál

source: Opening the X display took %ld msec
sk: Otvorenie X displej zabralo %ld msec

source: Vim: Got X error but we continue...
sk: Vim: Chyba X ale pokraèujem ...

source: Vim: Got X error
sk: Vim: Chyba X

source: Testing the X display failed
sk: Testovanie X displeja zlyhalo

source: Opening the X display timed out
sk: Uplynul èas otvorenia X displeja

source: Cannot execute shell
sk: Nedá sa spusti» shell

source: Cannot execute shell sh
sk: Nedá sa spusti» sh shell

source: shell returned
sk: návratová hodnota shellu

source: Cannot create pipes
sk: Nedjú sa vytvori» rúry

source: Cannot fork
sk: Vyvolanie fork zlyhalo

source: Command terminated
sk: Príkaz ukonèený

source: XSMP lost ICE connection
sk: XSMP stratilo ICE spojenie

source: Opening the X display failed
sk: Otvorenie X displeja zlyhalo

source: XSMP handling save-yourself request
sk: XSMP spracuváva po¾iadavku na samoulo¾enie

source: XSMP opening connection
sk: XSMP otvára spojenie

source: XSMP ICE connection watch failed
sk: XSMP kontrola spojenia ICE zlyhala

source: XSMP SmcOpenConnection failed: %s
sk: XSMP SmcOpenConnection zlyhalo: %s

source: At line
sk: Na riadku

source: Could not load vim32.dll!
sk: Nemô¾em nahra» vim32.dll!

source: VIM Error
sk: VIM Chyba

source: Could not fix up function pointers to the DLL!
sk: Nemô¾em opravi» odkazy funkcií na DLL!

source: shell returned %d
sk: návratová hodnota shellu %d

source: Vim: Caught %s event
sk: Vim: Zachytená udalos» %s

source: close
sk: zavrie»

source: logoff
sk: odhlási»

source: shutdown
sk: vypnú»

source: E371: Command not found
sk: E371: Príkaz nenájdený

source: VIMRUN.EXE not found in your $PATH. External commands will not pause after completion. See :help win32-vimrun for more information.
sk: VIMRUN.EXE nenájdený v $PATH. Po dokonèení externých príkazov nebude výstup pozastavený. Pozrite :help win32-vimrun pre viac informácií.

source: Vim Warning
sk: Vim Varovanie

source: E372: Too many %%%c in format string
sk: E372: Príli¹ mnoho %%%c vo formátovacom re»azci

source: E373: Unexpected %%%c in format string
sk: E373: Neoèakávaný výskyt %%%c vo formátovacom re»azci

source: E374: Missing ] in format string
sk: E374: Vo formátovacom re»azci chýba ]

source: E375: Unsupported %%%c in format string
sk: E375: Nepodporovaná formátová ¹pecifikácia %%%c vo formátovacom re»azci

source: E376: Invalid %%%c in format string prefix
sk: E376: Neprístupné %%%c v prefixe formátovacieho re»azca

source: E377: Invalid %%%c in format string
sk: E377: Neprístupné %%%c vo formátovacom re»azci

source: E378: 'errorformat' contains no pattern
sk: E378: 'errorformat' neobsahuje ¾iadny vzor

source: E379: Missing or empty directory name
sk: E379: Chýbajúci alebo prázdny názov adresára

source: E553: No more items
sk: E553: ®iadne ïal¹ie polo¾ky

source: (%d of %d)%s%s:
sk: (%d z %d)%s%s:

source: (line deleted)
sk: (riadok vymazaný)

source: E380: At bottom of quickfix stack
sk: E380: Koniec quickfix zoznamu

source: E381: At top of quickfix stack
sk: E381: Zaèiatok quickfix zoznamu

source: error list %d of %d; %d errors
sk: zoznam chýb %d z %d; %d chýb

source: E382: Cannot write, 'buftype' option is set
sk: E382: Nedá sa ulo¾i», je nastavená voµba 'buftype'

source: E683: File name missing or invalid pattern
sk: E683: Chýba meno súboru alebo chybný vzor

source: Cannot open file "%s"
sk: Nedá sa otvori» súbor "%s"

source: E681: Buffer is not loaded
sk: E681: Buffer nie je naèítaný

source: E369: invalid item in %s%%[]
sk: E369: chybná polo¾ka v %s%%[]

source: E339: Pattern too long
sk: E339: Vzor je príli¹ dlhý

source: E50: Too many \z(
sk: E50: Príli¹ mnoho \z(

source: E51: Too many %s(
sk: E51: Príli¹ mnoho %s(

source: E52: Unmatched \z(
sk: E52: Nespárované \z(

source: E53: Unmatched %s%%(
sk: E53: Nespárované %s%%(

source: E54: Unmatched %s(
sk: E54: Nespárované %s(

source: E55: Unmatched %s)
sk: E55: Nespárované %s)

source: E59: invalid character after %s@
sk: E59: Neprípustný znak po %s@

source: E60: Too many complex %s{...}s
sk: E60: Príli¹ komplexné %s{...}

source: E61: Nested %s*
sk: E61: Vnorený %s*

source: E62: Nested %s%c
sk: E62: Vnorený %s%c

source: E63: invalid use of \_
sk: E63: Chybne pou¾ité \_

source: E64: %s%c follows nothing
sk: E64: %s%c niè nenasleduje

source: E65: Illegal back reference
sk: E65: Chybná spätná referencia

source: E66: \z( not allowed here
sk: E66: \z( tu nie je povolené

source: E67: \z1 et al. not allowed here
sk: E67: \z1 a spol. tu nie je povolené

source: E68: Invalid character after \z
sk: E68: Neprípustný znak po \z

source: E69: Missing ] after %s%%[
sk: E69: Chýbajúca ] po %s%%[

source: E70: Empty %s%%[]
sk: E70: Prázdny %s%%[]

source: E678: Invalid character after %s%%[dxouU]
sk: E678: Neprípustný znak po %s%%[dxouU]

source: E71: Invalid character after %s%%
sk: E71: Neprípustný znak po %s%%

source: E769: Missing ] after %s[
sk: E769: Chýbajúca ] po %s[

source: E554: Syntax error in %s{...}
sk: E554: Chyba syntaxe v %s{...}

source: External submatches:
sk: Vnútorné podradené zhody:

source: VREPLACE
sk: NAHRADI« VERTIKÁLNE

source: REPLACE
sk: NAHRADI«

source: REVERSE
sk: OBRÁTI«

source: INSERT
sk: VLO®I«

source: (insert)
sk: (vlo¾i»)

source: (replace)
sk: (nahradi»)

source: (vreplace)
sk: (nahradi» vertikálne)

source: Hebrew
sk: Hebrejský

source: Arabic
sk: Arabský
