Repository: neovim/neovim
Catalog: src/po/*.po
Languages: sk

source: E183: User defined commands must start with an uppercase letter
sk: E183: Pou¾ívateµom definované príkazy musia zaèína» veµkým písmenom

source: E184: No such user-defined command: %s
sk: E184: Pou¾ívateµom definovaný príkaz %s neexistuje

source: E180: Invalid complete value: %s
sk: E180: Chybná hodnota doplnenia: %s

source: E468: Completion argument only allowed for custom completion
sk: E468: Argument doplnenia je povolený iba pre vlastné dopåòania (completion)

source: E467: Custom completion requires a function argument
sk: E467: Vlastné doplnenia vy¾adujú meno funkcie ako argument

source: E185: Cannot find color scheme %s
sk: E185: Schéma farieb %s nenájdená

source: Greetings, Vim user!
sk: Pozdravujem, u¾ívateµ Vimu!

source: Edit File in new window
sk: Upravi» súbor v novom okne

source: No swap file
sk: ®iadny odkladací súbor

source: Append File
sk: Pripoji» súbor

source: E747: Cannot change directory, buffer is modified (add ! to override)
sk: E747: Nemo¾no zmeni» adresár, buffer je modifikovaný (pou¾ite ! pre vynútenie)

source: E186: No previous directory
sk: E186: ®iadny predchádzajúci adresár

source: E187: Unknown
sk: E187: Neznámy

source: E465: :winsize requires two number arguments
sk: E465: :winsize (veµkos» okna) vy¾aduje dva argumenty

source: Window position: X %d, Y %d
sk: Pozícia okna: X %d, Y %d

source: E188: Obtaining window position not implemented for this platform
sk: E188: Na tejto platforme sa nedá zisti» umiestnenie okna

source: E466: :winpos requires two number arguments
sk: E466: :winpos (pozícia okna) vy¾aduje dva argumenty

source: Save Redirection
sk: Ulo¾i» presmerovanie

source: Save View
sk: Ulo¾i» pohµad

source: Save Session
sk: Ulo¾i» sedenie

source: Save Setup
sk: Ulo¾i» nastavenie

source: E739: Cannot create directory: %s
sk: E739: Nemo¾no vytvori» adresár: %s

source: E189: "%s" exists (add ! to override)
sk: E189: "%s" existuje (pou¾ite ! pre vynútenie)

source: E190: Cannot open "%s" for writing
sk: E190: "%s" sa nedá otvori» pre zápis

source: E191: Argument must be a letter or forward/backward quote
sk: E191: Argumentem mô¾e by» iba písmeno alebo pravý èi µavý apostrof

source: E192: Recursive use of :normal too deep
sk: E192: Rekurzívne pou¾itie príkazu :normal príli¹ hlboké

source: E194: No alternate file name to substitute for '#'
sk: E194: ®iadny alternatívny názov súboru, ktorým by bolo mo¾né nahradi» '#'

source: E495: no autocommand file name to substitute for "<afile>"
sk: E495: ¾iadny názov súboru, ktorým by bolo mo¾né nahradi» "<afile>"

source: E496: no autocommand buffer number to substitute for "<abuf>"
sk: E496: ¾iadne èíslo bufferu, ktorým by bolo mo¾né nahradi» "<abuf>"

source: E497: no autocommand match name to substitute for "<amatch>"
sk: E497: ¾iadna zhoda automatických príkazov, ktorou by bolo mo¾né nahradi» "<amatch>"

source: E498: no :source file name to substitute for "<sfile>"
sk: E498: ¾iadny :source súbor, ktorým by bolo mo¾né nahradi» "<sfile>"

source: E499: Empty file name for '%' or '#', only works with ":p:h"
sk: E499: Prázdný názov súboru pre '%' alebo '#', funguje iba s ":p:h"

source: E500: Evaluates to an empty string
sk: E500: Výsledkom vyhodnotenia je prázdny re»azec

source: E195: Cannot open viminfo file for reading
sk: E195: Súbor viminfo sa nedá sa otvori» na èítanie

source: E196: No digraphs in this version
sk: E196: V tejto verzi nie sú digraphy podporované

source: E608: Cannot :throw exceptions with 'Vim' prefix
sk: E608: Nemo¾no spracova» výnimku :throw s preponou 'Vim'

source: Exception thrown: %s
sk: Spracovanie výnimky: %s

source: Exception finished: %s
sk: Výnimka ukonèená: %s

source: Exception discarded: %s
sk: Výnimka zahodená: %s

source: %s, line %ld
sk: %s, riadok %ld

source: Exception caught: %s
sk: Zachytená výnimka: %s

source: %s made pending
sk: %s prebieha

source: %s resumed
sk: %s vrátené

source: %s discarded
sk: %s zahodené

source: Exception
sk: Výnimka

source: Error and interrupt
sk: Chyba a preru¹ené

source: Error
sk: Chyba

source: Interrupt
sk: Preru¹ené

source: E579: :if nesting too deep
sk: E579: vnorenie :if je príli¹ hlboké

source: E580: :endif without :if
sk: E580: :endif bez zodpovedajúceho :if

source: E581: :else without :if
sk: E581: :else bez zodpovedajúceho :if

source: E582: :elseif without :if
sk: E582: :elseif bez zodpovedajúceho :if

source: E583: multiple :else
sk: E583: viacnásobné :else

source: E584: :elseif after :else
sk: E584: :elseif nasleduje po :else

source: E585: :while/:for nesting too deep
sk: E585: vnorenie :while/:for je príli¹ hlboké

source: E586: :continue without :while or :for
sk: E586: :continue bez zodpovedajúceho :while alebo :for

source: E587: :break without :while or :for
sk: E587: :break bez zodpovedajúceho :while alebo :for

source: E732: Using :endfor with :while
sk: E732: Pou¾ité :endfor spolu s :while

source: E733: Using :endwhile with :for
sk: E733: Pou¾ité :endwhile spolu s :for

source: E601: :try nesting too deep
sk: E601: vnorenie :try je príli¹ hlboké

source: E603: :catch without :try
sk: E603: :catch bez :try

source: E604: :catch after :finally
sk: E604: :catch nasleduje po :finally

source: E606: :finally without :try
sk: E606: :finally bez :try

source: E607: multiple :finally
sk: E607: viacnásobné pou¾ité :finally

source: E602: :endtry without :try
sk: E602: :endtry bez :try

source: E193: :endfunction not inside a function
sk: E193: :endfunction mimo funkciu

source: tagname
sk: meno tagu

source: kind file
sk: typ súboru

source: 'history' option is zero
sk: 'voµba 'history' je nastavená na nulu

source: # %s History (newest to oldest):
sk: # História %s (zaèínajúci najnov¹ou polo¾kou):

source: Command Line
sk: Príkazový riadok

source: Search String
sk: Vyhµadávaný re»azec

source: Expression
sk: Výraz

source: Input Line
sk: Vstupný riadok

source: E198: cmd_pchar beyond the command length
sk: E198: cmd_pchar prevy¹uje då¾ku príkazu

source: E199: Active window or buffer deleted
sk: E199: Aktívne okno alebo buffer bol vymazaný

source: Illegal file name
sk: Neprípustný názov súboru

source: is a directory
sk: je adresárom

source: is not a file
sk: nie je súborom

source: [New File]
sk: [nový súbor]

source: [Permission Denied]
sk: [prístup odmietnutý]

source: E200: *ReadPre autocommands made the file unreadable
sk: E200: automatické príkazy *ReadPre urobili súbor neèitateµným

source: E201: *ReadPre autocommands must not change current buffer
sk: E201: automatické príkazy *ReadPre nesmú meni» aktuálny buffer

source: Vim: Reading from stdin...
sk: Vim: èítam zo ¹tandardného vstupu...

source: Reading from stdin...
sk: Èítam zo ¹tandardného vstupu...

source: E202: Conversion made file unreadable!
sk: E202: Po konverzii je súbor neèitateµný!

source: [fifo/socket]
sk: [pomenovaná rúra/soket]

source: [fifo]
sk: [pomenovaná rúra]

source: [socket]
sk: [soket]

source: [CR missing]
sk: [chýba CR]

source: [NL found]
sk: [nájdené NL]

source: [long lines split]
sk: [dlhé riadky zalomené]

source: [NOT converted]
sk: [neskonvertovaný]

source: [converted]
sk: [skonvertovaný]

source: [crypted]
sk: [¹ifrovaný]

source: [CONVERSION ERROR]
sk: [CHYBA PREVODU]

source: [ILLEGAL BYTE in line %ld]
sk: [NEPRÍPUSTNÝ BAJT na riadku %ld]

source: [READ ERRORS]
sk: [CHYBY ÈÍTANIA]

source: Can't find temp file for conversion
sk: Nedá sa nájs» doèasný súbor pre konverziu

source: Conversion with 'charconvert' failed
sk: Konverzia s 'charconvert' sa nepodarila

source: can't read output of 'charconvert'
sk: nedá sa èíta» výstup 'charconvert'

source: E676: No matching autocommands for acwrite buffer
sk: E676: ®iadne vyhovujúce automatické príkazy pre acwrite buffer

source: E203: Autocommands deleted or unloaded buffer to be written
sk: E203: Automatické príkazy zmazali èi deaktivovali buffer, ktorý mal by» ulo¾ený

source: E204: Autocommand changed number of lines in unexpected way
sk: E204: Automatický príkaz neoèakávaným spôsobom zmenil poèet riadkov

source: NetBeans disallows writes of unmodified buffers
sk: NetBeans rozhranie nedovolilo zapísa» nemodifikované buffre

source: Partial writes disallowed for NetBeans buffers
sk: Èiastoèné zápisy nie sú povolené pre NetBeans buffre

source: is not a file or writable device
sk: nie je súborom ani zapisovatelným zariadením

source: is read-only (add ! to override)
sk: je iba pre èítanie (pou¾ite ! pre vynútenie)

source: E506: Can't write to backup file (add ! to override)
sk: E506: Nedá sa zapisova» do zálo¾ného súboru (pou¾ite ! pre vynútenie)

source: E507: Close error for backup file (add ! to override)
sk: E507: Chyba pri uzatváraní zálo¾ného súboru (pou¾ite ! pre vynútenie)

source: E508: Can't read file for backup (add ! to override)
sk: E508: Nedá sa naèíta» súbor pre zálohu (pou¾ite ! pre vynútenie)

source: E509: Cannot create backup file (add ! to override)
sk: E509: Nedá sa vytvori» zálo¾ný súbor (pou¾ite ! pre vynútenie)

source: E510: Can't make backup file (add ! to override)
sk: E510: Nedá sa vytvori» zálo¾ný súbor (pou¾ite ! pre vynútenie)

source: E460: The resource fork would be lost (add ! to override)
sk: E460: 'Resource fork' bude stratený (pou¾ite ! pre vynútenie)

source: E214: Can't find temp file for writing
sk: E214: Nedá sa nájs» doèasný súbor pre ukladanie

source: E213: Cannot convert (add ! to write without conversion)
sk: E213: Nedá sa spravi» konverzia (pou¾ite ! pre zápis bez konverzie)

source: E166: Can't open linked file for writing
sk: E166: Súbor sa nedá otvori» pre ukladanie

source: E212: Can't open file for writing
sk: E212: Súbor sa nedá otvori» pre ukladanie

source: E667: Fsync failed
sk: E667: Fsync zlyhal

source: E512: Close failed
sk: E512: Zatvorenie zlyhalo

source: E513: write error, conversion failed (make 'fenc' empty to override)
sk: E513: chyba pri zápise, konverzia sa nepodarila (nastavte voµbu 'fenc' na prázdnu pre vynútenie)

source: E514: write error (file system full?)
sk: E514: chyba pri ukladaní (plný disk?)

source: CONVERSION ERROR
sk: CHYBA PREVODU

source: [Device]
sk: [zariadenie]

source: [New]
sk: [nový]

source: [a]
sk: [p]

source: appended
sk: pripojený

source: [w]
sk: [u]

source: written
sk: ulo¾ený

source: E205: Patchmode: can't save original file
sk: E205: patchmode: nedá sa ulo¾i» pôvodný súbor

source: E206: patchmode: can't touch empty original file
sk: E206: patchmode: nedá sa zapisova» do prázdneho pôvodného súboru

source: E207: Can't delete backup file
sk: E207: Nedá sa vymaza» zálo¾ný súbor

source: WARNING: Original file may be lost or damaged
sk: VAROVANIE: Obsah pôvodného súboru mô¾e by» stratený alebo po¹kodený

source: don't quit the editor until the file is successfully written!
sk: neukonèujte editor skôr, ne¾ bude súbor úspe¹ne ulo¾ený!

source: [dos format]
sk: [dos formát]

source: [mac format]
sk: [mac formát]

source: [unix format]
sk: [unix formát]

source: 1 line,
sk: 1 riadok,

source: %ld lines,
sk: %ld riadkov,

source: 1 character
sk: 1 znak

source: %ld characters
sk: %ld znakov

source: [noeol]
sk: [bez znaku konca riadku]

source: [Incomplete last line]
sk: [neúplný posledný riadok]

source: WARNING: The file has been changed since reading it!!!
sk: VAROVANIE: Súbor bol zmenený od jeho naèítania!!!

source: Do you really want to write to it
sk: Chcete ho naozaj ulo¾i»

source: E208: Error writing to "%s"
sk: E208: Chyba pri zápise do "%s"

source: E209: Error closing "%s"
sk: E209: Chyba pri uzatváraní "%s"

source: E210: Error reading "%s"
sk: E210: Chyba pri èítaní "%s"

source: E246: FileChangedShell autocommand deleted buffer
sk: E246: automatický príkaz FileChangedShell vymazal buffer

source: E211: File "%s" no longer available
sk: E211: Varovanie: súbor "%s" u¾ nie je dostupný

source: W12: Warning: File "%s" has changed and the buffer was changed in Vim as well
sk: W12: Varovanie: súbor "%s" bol po zaèatí úpravy zmenený a buffer sa tie¾ zmenil

source: See ":help W12" for more info.
sk: Pozrite ":help W12" pre viac informácií.

source: W11: Warning: File "%s" has changed since editing started
sk: W11: Varovanie: súbor "%s" bol po zaèatí úpravy zmenený

source: See ":help W11" for more info.
sk: Pozrite ":help W11" pre viac informácií.

source: W16: Warning: Mode of file "%s" has changed since editing started
sk: W16: Varovanie: Prístupové práva k súboru "%s" boli po zaèatí úprav zmenené

source: See ":help W16" for more info.
sk: Pozrite ":help W16" pre viac informácií.

source: W13: Warning: File "%s" has been created after editing started
sk: W13: Varovanie: Súbor "%s" bol vytvorený po zaèatí úpravy

source: Warning
sk: Varovanie

source: &OK &Load File
sk: &OK &Naèíta» súbor

source: E462: Could not prepare for reloading "%s"
sk: E462: Nemo¾no pripravi» na opätovné naèítanie "%s"

source: E321: Could not reload "%s"
sk: E321: nedá sa obnovi» "%s"

source: --Deleted--
sk: --Vymazaný--

source: auto-removing autocommand: %s <buffer=%d>
sk: samomazací automatický príkaz: %s <buffer=%d>

source: E367: No such group: "%s"
sk: E367: Skupina "%s" neexistuje

source: E215: Illegal character after *: %s
sk: E215: Neprípustný znak po *: %s

source: E216: No such event: %s
sk: E216: Udalos» %s neexistuje

source: E216: No such group or event: %s
sk: E216: Udalos» alebo skupina %s neexistuje

source: --- Auto-Commands ---
sk: --- Automatické príkazy ---

source: E680: <buffer=%d>: invalid buffer number
sk: E680: <buffer=%d>: chybné èíslo bufferu

source: E217: Can't execute autocommands for ALL events
sk: E217: Automatické príkazy sa nedajú spusti» pre V©ETKY udalosti

source: No matching autocommands
sk: ®iadne vyhovujúce automatické príkazy

source: E218: autocommand nesting too deep
sk: E218: vnorenia automatického príkazu sú príli¹ hlboké

source: %s Auto commands for "%s"
sk: %s Automatické príkazy pre "%s"

source: Executing %s
sk: Spú¹»am %s

source: autocommand %s
sk: automatický príkaz %s

source: E219: Missing {.
sk: E219: Chýba {.

source: E220: Missing }.
sk: E220: Chýba }.

source: E490: No fold found
sk: E490: Nebol nájdené ¾iadne vnorenie

source: E350: Cannot create fold with current 'foldmethod'
sk: E350: Nedá sa vytvori» vnorenie s aktuálnou metódou 'foldmethod'

source: E351: Cannot delete fold with current 'foldmethod'
sk: E351: Nedá sa zru¹i» vnorenie s aktuálnou metódou 'foldmethod'

source: +--%3ld lines folded
sk: +--%3ld riadkov zahnutých

source: E222: Add to read buffer
sk: E222: Prida» do bufferu pre èítanie

source: E223: recursive mapping
sk: E223: rekurzívne mapovanie

source: E224: global abbreviation already exists for %s
sk: E224: pre %s u¾ globálna skratka existuje

source: E225: global mapping already exists for %s
sk: E225: pre %s u¾ globálne mapovanie existuje

source: E226: abbreviation already exists for %s
sk: E226: pre %s u¾ skratka existuje

source: E227: mapping already exists for %s
sk: E227: pre %s u¾ mapovanie existuje

source: No abbreviation found
sk: ®iadna skratka nebola nájdená

source: No mapping found
sk: ®iadne mapovanie nebolo nájdené

source: E228: makemap: Illegal mode
sk: E228: makemap: neprípustný mód

source: E229: Cannot start the GUI
sk: E229: Nedá sa spusti» GUI (grafické rozhranie)

source: E230: Cannot read from "%s"
sk: E230: Nedá sa èíta» z "%s"

source: E665: Cannot start GUI, no valid font found
sk: E665: Nemo¾no na¹tartova» grafické rozhranie, nenájdený ¾iaden pou¾itelný font

source: E231: 'guifontwide' invalid
sk: E231: voµba 'guifontwide' (nastavenie ¹irokého písma) je chybne nastavená

source: E599: Value of 'imactivatekey' is invalid
sk: E599: Hodnota 'imactivatekey' je nesprávne nastavená

source: E254: Cannot allocate color %s
sk: E254: Nedá sa alokova» farba %s

source: No match at cursor, finding next
sk: ®iadna zhoda na pozícii kurzora, hµadám ïalej

source: <cannot open>
sk: <nedá sa otvori»>

source: E616: vim_SelFile: can't get font %s
sk: E616: vim_SelFile: písmo %s nie je dostupné

source: E614: vim_SelFile: can't return to current directory
sk: E614: vim_SelFile: nedá sa vráti» do aktuálneho adresára

source: Pathname:
sk: Názov cesty:

source: E615: vim_SelFile: can't get current directory
sk: E615: vim_SelFile: nedá sa zisti» aktuálny adresár

source: Cancel
sk: Zru¹i»

source: Scrollbar Widget: Could not get geometry of thumb pixmap.
sk: Prípravok posuvnej li¹ty: nedá sa zisti» geometria náhµadu obrázku.

source: Vim dialog
sk: Vim dialóg

source: E232: Cannot create BalloonEval with both message and callback
sk: E232: BalloonEval nedá sa vytvori» správou a zároveò spätným volaním

source: Vim dialog...
sk: Vim dialóg..

source: &Yes &No &Cancel
sk: &Ano &Nie &Zru¹i»

source: Input _Methods
sk: Vstupné metódy (_Methods)

source: VIM - Search and Replace...
sk: VIM - Nájs» a nahradi»...

source: VIM - Search...
sk: VIM - Nájs»...

source: Find what:
sk: Vyhµada»:

source: Replace with:
sk: Nahradi» s:

source: Match whole word only
sk: Hµada» len celé slová

source: Match case
sk: Zhoda veµkosti písmen

source: Direction
sk: Smer

source: Up
sk: Hore

source: Down
sk: Dolu

source: Find Next
sk: Nájs» ïal¹ie

source: Replace
sk: Nahradi»

source: Replace All
sk: Nahradi» V¹etko

source: Vim: Received "die" request from session manager
sk: Vim: Prijatá po¾iadavka na ukonèenie (die) od mana¾éra sedení

source: Vim: Main window unexpectedly destroyed
sk: Vim: Hlavné okno neoèakávane zru¹ené

source: Font Selection
sk: Výber Písma

source: Used CUT_BUFFER0 instead of empty selection
sk: Pou¾itý CUT_BUFFER0 namiesto prázdneho výberu

source: &Cancel
sk: &Zru¹i»

source: Directories
sk: Adresáre

source: &Help
sk: &Pomocník

source: Files
sk: Súbory

source: Selection
sk: Výber

source: Find &Next
sk: Nájs» ïa&l¹ie

source: &Replace
sk: &Nahradi»

source: Replace &All
sk: Nahradi» &V¹etko

source: &Undo
sk: &Spä»

source: E671: Cannot find window title "%s"
sk: E671: Nemo¾no nájs» okno s titulkom "%s"

source: E243: Argument not supported: "-%s"; Use the OLE version.
sk: E243: Argument nie je podporovaný: "-%s"; Pou¾ite OLE verziu.

source: E672: Unable to open window inside MDI application
sk: E672: Nemo¾no otvori» okno vnútri MDI aplikácie

source: Find string (use '\\' to find a '\')
sk: Nájs» re»azec (pou¾ite '\\' ak chete nájs» '\')

source: Find & Replace (use '\\' to find a '\')
sk: Nájs» a Nahradi» (pou¾ite '\\' ak chcete nájs» '\')

source: Not Used
sk: [neupravovaný]

source: Directory *.nothing
sk: Adresár *.niè

source: Vim E458: Cannot allocate colormap entry, some colors may be incorrect
sk: Vim E458: Nedá sa alokova» polo¾ka mapy farieb, niektoré farby mô¾u by» nesprávne

source: E250: Fonts for the following charsets are missing in fontset %s:
sk: E250: Chýba písmo pre nasledujúce znakové sady %s:

source: E252: Fontset name: %s
sk: E252: Názov sady písiem: %s

source: Font '%s' is not fixed-width
sk: Písmo '%s' nemá pevnou ¹írku

source: E253: Fontset name: %s
sk: E253: Názov sady písiem: %s

source: Font0: %s
sk: Písmo0: %s

source: Font1: %s
sk: Písmo1: %s

source: Font%ld width is not twice that of font0
sk: Písmo%ld nie je dvakrát ¹ir¹ie ako písmo0

source: Font0 width: %ld
sk: ©írka písma0: %ld

source: Font1 width: %ld
sk: ©írka písma1: %ld

source: Invalid font specification
sk: Chybná ¹pecifikácia písma

source: &Dismiss
sk: &Zru¹i»

source: no specific match
sk: ¾iadna ¹pecifická zhoda

source: Vim - Font Selector
sk: Vim - Výber písma

source: Name:
sk: Meno:

source: Show size in Points
sk: Ukazuj veµkos» v bodoch

source: Encoding:
sk: Kódujem:

source: Font:
sk: Písmo:

source: Style:
sk: ©týl

source: Size:
sk: Veµkos»:

source: E256: Hangul automata ERROR
sk: E256: Hangul ERROR - chyba kórejského spôsobu vkladania znakov

source: E550: Missing colon
sk: E550: Chýba dvojbodka

source: E551: Illegal component
sk: E551: Neprípustný komponent

source: E552: digit expected
sk: E552: oèakávaná èíslica

source: Page %d
sk: Strana %d

source: No text to be printed
sk: ®iadny text na tlaè

source: Printing page %d (%d%%)
sk: Tlaèím stranu %d (%d%%)

source: Copy %d of %d
sk: Kópia %d z %d

source: Printed: %s
sk: Vytlaèené: %s

source: Printing aborted
sk: Tlaè bola zru¹ená

source: E455: Error writing to PostScript output file
sk: E455: Nedá sa zapisova» do výstupného PostScriptového súboru

source: E624: Can't open file "%s"
sk: E624: Nedá sa otvori» súbor "%s"

source: E457: Can't read PostScript resource file "%s"
sk: E457: Nedá sa èíta» PostScriptový súbor "%s"

source: E618: file "%s" is not a PostScript resource file
sk: E618: súbor "%s" nie je vo formáte PostScript

source: E619: file "%s" is not a supported PostScript resource file
sk: E619: súbor "%s" nie je podporvaný PostScriptový súbor

source: E621: "%s" resource file has wrong version
sk: E621: "%s" zdrojový súbor má zlé èíslo verzie

source: E673: Incompatible multi-byte encoding and character set.
sk: E673: nekompatibilné viacbajtové kódovanie a znaková sada.

source: E674: printmbcharset cannot be empty with multi-byte encoding.
sk: E674: voµba printmbcharset nemô¾e by» prázdna pri viacbajtovom kódovaní.

source: E675: No default font specified for multi-byte printing.
sk: E675: Nie je ¹pecifikované ¾iadne písmo pre viacbajtové tlaèenie.

source: E324: Can't open PostScript output file
sk: E324: Nedá sa otvori» výstupný PostScriptový súbor

source: E456: Can't open file "%s"
sk: E456: Nedá sa otvori» súbor "%s"

source: E456: Can't find PostScript resource file "prolog.ps"
sk: E456: Nemo¾no nájs» PostScriptový zdrojový súbor "prolog.ps"

source: E456: Can't find PostScript resource file "cidfont.ps"
sk: E456: Nemo¾no nájs» PostScriptový zdrojový súbor "cidfont.ps"

source: E456: Can't find PostScript resource file "%s.ps"
sk: E456: Nemo¾no nájs» PostScriptový zdrojový súbor "%s.ps"

source: E620: Unable to convert to print encoding "%s"
sk: E620: Nemo¾no skonvertova» do kódovania na tlaèenie "%s"

source: Sending to printer...
sk: Posielam na tlaèiareò...

source: E365: Failed to print PostScript file
sk: E365: PostScriptový súbor sa nepodarilo vytlaèi»

source: Print job sent.
sk: Tlaèová úloha bola odoslaná.

source: Add a new database
sk: Prida» novú databázu

source: Query for a pattern
sk: Hµadanie vzoru

source: Show this message
sk: Zobrazi» túto správu

source: Kill a connection
sk: Ukonèi» spojenie

source: Reinit all connections
sk: Znovu inicializova» v¹etky spojenia

source: Show connections
sk: Zobrazi» spojenia

source: E560: Usage: cs[cope] %s
sk: E560: Pou¾itie: cs[cope] %s

source: This cscope command does not support splitting the window.
sk: Tento cscope príkaz nepodporuje rozdeµovanie okna.

source: E562: Usage: cstag <ident>
sk: E562: Pou¾itie: cstag <odsadenie>

source: E257: cstag: tag not found
sk: E257: cstag: tag nenájdený

source: E563: stat(%s) error: %d
sk: E563: stat(%s) chyba: %d

source: E563: stat error
sk: E563: chyba stat

source: E564: %s is not a directory or a valid cscope database
sk: E564: %s nie je ani adresárom ani správnou cscope databázou

source: Added cscope database %s
sk: Pridaná cscope databáza %s

source: E262: error reading cscope connection %ld
sk: E262: chyba pri èítaní cscope spojenia %ld

source: E561: unknown cscope search type
sk: E561: neznámy typ cscope hµadania

source: E566: Could not create cscope pipes
sk: E566: Nedajú sa vytvori» cscope rúry

source: E622: Could not fork for cscope
sk: E622: Nemo¾no spusti» proces pre cscope

source: cs_create_connection exec failed
sk: spustenie cs_create_connection zlyhalo

source: E623: Could not spawn cscope process
sk: E623: Nedajú sa vytvori» cscope rúry

source: cs_create_connection: fdopen for to_fp failed
sk: cs_create_connection: volanie fdopen pre to_fp zlyhalo

source: cs_create_connection: fdopen for fr_fp failed
sk: cs_create_connection: volanie fdopen pre fr_fp zlyhalo

source: E567: no cscope connections
sk: E567: ¾iadne cscope spojenia
